{
  "job": {
    "id": "1470704",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1470704",
    "title": "Senior Backend Engineer",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-20T11:06:45.000+00:00",
    "discovered_date": "2025-12-03T03:04:00.097065",
    "description": "What will help you to succeed in the role: :\nHands-on experience with C# and the .NET framework, with a minimum of 5 years of experience\nExperience developing, shipping, and maintaining cloud-based applications\nGood knowledge and experience working with microservices and distributed architectures\nStrong understanding of RESTful APIs\nExperience with relational databases, preferably Microsoft SQL Server\nWorking knowledge of ORMs, preferably Entity Framework\nFamiliarity with cloud development; experience with Azure is a plus\nExperience with messaging platforms in distributed architectures (e.g., RabbitMQ, MassTransit, Kafka)\nProficiency with containerization technologies such as Docker\nExperience with Kubernetes for container orchestration\nTerraform for Infrastructure as Code (IaC)\nMonitoring and observability experience using tools like NewRelic\nProficiency in both written and spoken English\nExperience in the FinTech or banking industry is a plus\n\nWhat will be your challenge: :\nYou will join one of our product teams and daily you will:\nDesign, develop, test, and ship robust, maintainable, and readable software, applications, APIs, and other workflows\nInitiate, participate in, and communicate technical architecture designs\nAttend regular scrum ceremonies as a member of an agile cross-functional team\nAnalyze, discuss, and implement business requirements while maintaining good documentation of the systems and components you create\nBring in industry standards and best practices to continually improve our codebase and architecture\nMake a positive impact on our engineering culture by adopting, implementing, and providing feedback on both organizational and industry standards and practices\n\nWhat do we offer: :\nInclusive and valuing culture\nAt Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks.\nHealth & Wellbeing\nYour physical and mental health is important to us. Take advantage of our various preventive care and support services.\nProfessional and Personal Development\nTake advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings\nMonetary Benefits & Discounts\nKnow that you're appreciated with plenty of employee benefits & discounts just for you.\nFlexibility\nOur diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 100.0,
  "score_breakdown": {
    "positive_keywords": 140.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0
  },
  "matched_keywords": [
    "architect",
    "architecture",
    "senior",
    "kubernetes",
    "docker",
    "azure",
    "terraform",
    "infrastructure",
    "backend",
    "API",
    "microservices",
    "database",
    "agile",
    "scrum"
  ],
  "category": "High Priority"
}