{
  "job": {
    "id": "1473609",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473609",
    "title": "JavaScript / TypeScript Engineer (React) - Several Openings",
    "company": "EvoGame Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-26T12:27:23.760+00:00",
    "discovered_date": "2025-12-03T03:03:55.318023",
    "description": "Company Description:\nEvolution is a multinational business at the forefront of the online gaming industry. We have an extensive track record of number 1s and are always looking for great people to help us create the next big product hit. Our team of 1,000+ engineers operates out of 8 engineering hubs running code 24/7/365 to serve users around the world. This is run through a modern software stack supporting over 250 fully automated releases per month to our main live environment. We believe in building in-house competence and agile work processes so that we can deliver on our Engineering mission:\nA flawless player experience.\n\nJob Description:\nWe are searching for passionate JavaScript / TypeScript engineers to take an integral part in building a cross-platform web application used by hundreds of thousands of users worldwide on iOS, Android, and desktop platforms. Our technology stack is modern and based on TypeScript, React, Babylon.js, RxJs, HTML Canvas, and webpack.\nWhat You'll Be Doing:\nDevelop full-fledged games from start to finish, ensuring high-quality performance and maintainability.\nWork within a cross-functional team consisting of backend developers, frontend developers, and QA engineers, maintaining seamless communication and collaboration.\nCollaborate closely with 3D designers, UI/UX designers, and Product Delivery Managers.\nCover all code with tests using Jest and ensure UI components are documented and tested in Storybook with visual regression testing.\nOptimize performance and maintain high FPS for visually rich gaming experiences.\nContribute to architectural decisions and technology choices for front-end development.\n\nRequirements:\nJavaScript and TypeScript\n: strong proficiency, including ESNext standards and advanced types.\nFrameworks and Libraries (React or equivalents: Vue, Svelte, Angular)\n: experience in developing multi-page SPA applications.\nState Management (MobX or equivalents: Redux, Vuex, Pinia)\n: deep understanding of centralized state management and performance optimization.\nT\nesting (Jest and React Testing Library or equivalents: Vitest, Mocha, Jasmine)\n: experience with unit and component testing, TDD/BDD.\nEducation and Experience\n: bachelors degree in IT or proven work experience in the field.\nPassion for Front-End Development\n: genuine enthusiasm for front-end development and a commitment to continuous technical improvement.\nProblem-Solving and Communication\n: excellent communication skills and a pragmatic approach to problem-solving, ensuring effective collaboration within cross-functional teams.\nFluency in English\n: proficient in both written and spoken English.\n\nWe will appreciate:\nStyling and Animations\n: experience with CSS preprocessors (Sass, Less), modular CSS (CSS Modules, PostCSS), and techniques for managing complex animations and responsive layouts.\nTooling and Configuration (Webpack, Vite, ESLint, Prettier\n): experience in setting up build tools, linting, and code formatting.\n3D Development (Babylon.js, Three.js)\n: experience with 3D graphics, custom shaders, and performance optimization.\nApplication Architecture\n: knowledge of design patterns, system modularization, and SOLID Principles.\nPerformance\n: experience with profiling, GPU acceleration, and resource optimization.\n\nWe Offer:\nA healthy mix of startup-like culture of the company, which enables us to try new approaches and technologies and remain on the edge of technological development and enterprise, with stability and supporting functions to help you focus on your job.\nRecognition from the business which translates to very competitive salaries and a supportive attitude.\nDeveloping games featuring live video serving customers around the world.\nModern and developer-friendly delivery processes, including Agile (Scrum / Kanban), JIRA issue tracking, Confluence wiki, GitLab source control, Jenkins continuous integration and delivery, modern hardware and software for development (an IDE of your choice).\nBeing a part of an international team in a successful, publicly traded company.\nHealth insurance, contemporary office environment, international IT conferences, training, hackathons, top-notch equipment, and other benefits and perks.\n\nOverview:\nInterview Process\n:\nApplication Submission\n: Share your LinkedIn profile or CV to express your interest.\nIntroduction Chat:\nA casual conversation where we get to know each other, answer basic questions, and discuss the role.\nVerbal Technical Interview\n: An opportunity to assess your understanding of key concepts and identify areas where we can support your growth.\nCulture Fit Meeting\n: A chance for you to meet the team, ensuring a mutual fit in terms of values and work environment.\nWhat Drives Us:\nOur\nmission\nis simply to make operators successful and provide an excellent gaming experience for their end users.\nOur\nvision\nis to be the leading online gaming provider in the world.\nOur culture is rooted in our corporate\nvalues\n:\nALIVE\nWe are entrepreneurial, innovative and always on our toes, eager to catch the next opportunity. We challenge ourselves to do what no one has done before, and we deliver a unique end-user experience and first-class customer service, simply because\nwe try harder\n. We look at our customers business as our business and opt to always be ahead of the game.\ndo RIGHT\nWe are committed to responsible gambling practices and to promoting a professional work environment which rewards integrity and high standards. We honor the trust that our customers put in us and recognize that our ability to deliver a reliable high-quality user experience is essential to our success. We strive to be an admirable employer and we believe in giving back to the communities in which we operate.\nwork TOGETHER\nWe recognize our diversity as a key strength. We promote an honest, inclusive and open work environment where we respect and support each other. Our pioneering ambition is dependent on our ability to work and develop together. At Evolution, every part of the chain counts.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 80.0,
  "score_breakdown": {
    "positive_keywords": 110.0,
    "negative_keywords": -40.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "javascript",
    "java",
    "typescript",
    "react",
    "vue",
    "angular",
    "architect",
    "architecture",
    "backend",
    "agile",
    "scrum"
  ],
  "category": "High Priority"
}