{
  "job": {
    "id": "1477909",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1477909",
    "title": "Secondary System Designer",
    "company": "Siemens Energy Oy Eesti filiaal",
    "location": "Unknown",
    "posted_date": "2025-12-05T08:07:35.177+00:00",
    "discovered_date": "2025-12-10T15:09:25.281025",
    "description": "Are you passionate about electrical design and eager to work on large-scale international projects? We are looking for a skilled secondary systems designer to join our team, specializing in medium and high voltage substations, control circuit, and auxiliary design. The project are mostly located in Finland and Baltics, but sometimes in other countries.\nYour Profile:\nDegree in Electrical Engineering or Electrical Technician qualification.\nMinimum of 3 years of hands-on experience in electrical design and engineering.\nProficiency in design software (e.g., Eplan) and Microsoft Office.\nFluency in written and spoken English; (Finnish or Estonian language skills are an asset).\nAbility to work independently as well as collaboratively within a team.\nStrong ownership and the attention to details and accuracy.\nGood communication skills and cultural awareness.\nWillingness to travel occasionally and visit project sites.\nValid driving license.\n\nKey Responsibilities::\nDesign and engineer relay protection, control circuits, and auxiliary systems for medium and high voltage substations.\nPrepare and review technical documentation, drawings, and schematics.\nCollaborate with project teams to ensure designs meet project requirements and timelines.\nCommunicate effectively with customers, colleagues, and stakeholders from diverse backgrounds.\nEnsure compliance with industry standards and safety regulations.\n\nWhat We Offer::\nCompetitive salary with additional performance-based bonuses.\nFlexible working arrangements (office/home).\nAdditional paid vocation days\nAdditional health insurance\nSport compensation\nOpportunity to work on large-scale international projects.\nLong-term career development and the chance to become an expert in your field.\nSupport for expanding your technical knowledge, including training opportunities.\nSupportive colleagues with good team spirit.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}