{
  "job": {
    "id": "1478569",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1478569",
    "title": "Teenuste projektijuht",
    "company": "Kesko Senukai Estonia",
    "location": "Unknown",
    "posted_date": "2025-12-05T13:16:26.048+00:00",
    "discovered_date": "2025-12-10T15:09:38.676038",
    "description": "Peamised tööülesanded:\nteenuste müügi-, kasumi- ja kasvuprognooside planeerimine ning nende täitmise tagamine;\nteenuste portfelli arendamine: transporditeenused, haagiste ja tööriistade rent, disainiteenused, pikendatud garantii, järelmaks ja muud teenused;\nklientide arvamuste kogumine ja analüüsimine: küsitlused, kaebuste lahendamine ja paranduste tegemine;\nteenuste sisemiste tööprotsesside parandamine ning uute teenindusstandardite juurutamine kauplustes;\nteenustega seotud projektide juhtimine: planeerimine, ressursside jaotamine,  elluviimine, tähtaegade ja eelarve jälgimine;\nkaupluste töötajate koolitamine teenuste alal.\nSobid hästi, kui Sul on:\nvähemalt 1-aastane müügijuhtimise kogemus (eeliseks on varasem kogemus teenuste valdkonnas);\noskus planeerida finantseelarvet, jälgida selle täitmist ning koostada tegevusplaane äriliste eesmärkide saavutamiseks;\nprojektide planeerimise ja juhtimise oskused;\nväga head suhtlemis- ja läbirääkimisoskused, võime töötada erinevate osakondadega ning motiveerida meeskonda;\nväga hea eesti ja inglise keele oskus (vene keele oskus on eeliseks);\nväga hea arvutioskuse tase, sh Microsoft Office: Excel, Outlook, PowerPoint, Word jm;\nisikuomadused: tulemustele orienteeritus, vastutustunne, võime kiirelt iseseisvalt otsuseid langetada, kliendikesksus, oskus veenda ja tugevad kommunikatsioonioskused.\nOmalt poolt pakume:\nhuvitavat ning vastutusrikast tööd rahvusvahelises ettevõttes;\nsporditoetust;\ntasustatud teist haiguspäeva;\nomatöötaja soodustusi;\ntoetusi oluliste sündmuste puhul elus;\nsõbralikku ja toetavat meeskonda;\narenguvõimalusi.\nSoovime alustada valikuprotsessiga\nkandideerimisperioodi jooksul,\nseega rõõmustame, kui\nkandideerid juba täna!\nTöö tüüp:\ntäistööaeg.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "language_russian": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}