{
  "job": {
    "id": "1478854",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1478854",
    "title": "Müügiesindaja",
    "company": "Gitana OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-08T08:06:30.000+00:00",
    "discovered_date": "2025-12-10T15:09:33.198877",
    "description": "Rahvusvaheline ettevõtte kutsub oma perre tehnilise huviga inimest!:\nTöö kirjeldus:\nGitana ettevõtte ja toodete tuntuse edendamine kohalike klientide seas;\nPlaneeritud B2B müügikasvu ja -eesmärkide saavutamine;\nPikaajaliste kliendisuhete arendamine ja hoidmine tiheda koostöö ning kliendi vajaduste mõistmise kaudu;\nUute klientide aktiivne leidmine ja kaasamine.\nOotused kandidaadile:\nHuvi tehnika ja tööriistade vastu;\nHea kliendisuhete arendamise ja haldamise oskus;\nVäga hea suhtlemis- ja ajajuhtimisoskus;\nVäga hea eesti keele oskus nii kõnes kui kirjas;\nAvatud ellusuhtumine, julgus ja positiivne hoiak;\nIseseisvus, sihikindlus, ettevõtlikkus ja tulemusele orienteeritus;\nInglise ja/või vene keele oskus suhtlustasandil;\nB-kategooria juhiluba.\nKasuks tuleb varasem töökogemus tehniliste toodete müügi valdkonnas;\nHea füüsiline vorm ( vahest on vaja kliendi juures teha tööriista demo, mis kaalub 5-10-20+kg)\nEttevõte pakub:\nMotiveerivat põhipalka koos tulemustel põhineva müügiboonusega;\nTööks vajalikke vahendeid, sh mobiiltelefoni, sülearvutit ja ametiautot;\nToetavat ja sõbralikku meeskonda, kuhu kuuluvad oma ala spetsialistid;\nArenguvõimalusi rahvusvahelises ettevõttes ning koostööd maailma tasemel brändidega;\nVõimalusi osaleda välisreisidel ja rahvusvahelistel kohtumistel.\nGITANA OÜ\nGitana on Leedu juurtega tehniliste toodete partner ehituse, tööstuse, masinaehituse ning teiste ärisektorite klientidele. Ettevõte on asutatud 1992. aastal.\nGitana on professionaalne, vastutustundlik ja kliendikeskne ettevõte, mis pakub laia valikut tööriistu, seadmeid ja tarvikuid ning tagab kvaliteetse garantii- ja müügijärgse teeninduse. Ettevõte panustab järjepidevalt töötajate kompetentside arendamisse ja tehnoloogia uuendamisse, eesmärgiga luua pikaajalisi ja väärtuspõhiseid koostöösuhteid nii töötajate kui ka klientidega.\nGitanal on esindused Leedus, Lätis ning alates 2018. aastast ka Eestis. Kokku töötab ettevõttes üle Baltikumi enam kui 230 töötaja.\n\nLisainfo::\n*Kuus kuud on ette nähtud väljaõppeks ja sujuvaks sisseelamiseks müügiesindaja rolli;\n*Ootused pärast sisseelamisperioodi: igakuine müügikäive vähemalt 25 000 € (käibemaksuta) ning keskmiselt 4 B2B kliendikülastust päevas;\n*Pakume netotöötasu(põhipalk):\nkuu 1 300 €;\nkuu 1 400 €;\nkuu ja edaspidi 1 500 €.\nMinimaalse käibenõude (25 000 €) täitmisel on võimalik teenida lisaks tulemustasu suuruses 2% kasumist;\nTöötajale tagatakse tööks vajalikud vahendid: sülearvuti, mobiiltelefon ja ametiauto. Ametiautot on võimalik kasutada ka isiklikeks sõitudeks, kuid sellisel juhul katab töötaja ise isiklike sõitude kütuse- ja muud kulud.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "language_latvian": 20.0,
    "language_russian": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}