{
  "job": {
    "id": "1478451",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1478451",
    "title": "Multilingual Global Client Associate",
    "company": "Interactive Brokers Software Services Estonia",
    "location": "Unknown",
    "posted_date": "2025-12-05T11:48:19.846+00:00",
    "discovered_date": "2025-12-10T15:09:25.280068",
    "description": "Responsibilities:\nResolve routine and complex client service issues thoroughly and expeditiously via phone, email, and chat, utilizing sound judgment and emphasizing courtesy. Client inquiries typically encompass a wide array of themes, including the operability of IBKR Trader Workstation, Web Trader and Mobile Trader execution platforms, trading modules and analytical tools.\nCash deposit and withdrawal activity, position transfers, and account administrative functions\nProduct availability and attributes\nExchange, clearing and depository functions; Order types and routing logic; Order status, trade and delivery settlement, exercise & assignment, expiration processing, and corporate actions\nMargin calculations, commission structure, interest and fees\nCoordinate activities with other local and international Client Service divisions and interact with external departments such as Programming, Clearing, Cashiering and Compliance on common issues. Contribute to the development of client service systems, policies and procedures.\n\nQualifications, Skills & Attributes:\nBachelors or advanced degree in finance, economics or a related field\n2-3 years of experience in client services or related field.\nStrong verbal and written communication skills to accommodate client inquiries directed via telephone, email and online chat\nGeneral understanding of the following financial instruments: stocks, securities options, futures, options on futures, foreign exchange and fixed-income\nLanguages:\nFluent in English + Italian/French/Spanish/Russian\nAbility to work in a dynamic, medium-size office environment\nCandidates must have an EU passport or a qualifying work permit/residency to work in Estonia.\n\nCompany Benefits & Perks :\nDiscretionary, performance based bonus\nPrivate health insurance, sport activity compensation\nStock incentive plan\nDaily food allowance in the office\nHybrid way of working (2 days home office/week)\nGreat atmosphere with friendly and exceptional colleagues and frequent company outings.\n*The benefits package will be reviewed regularly and may be subject to change.\nPlease apply here\n: https://job-boards.greenhouse.io/ibkr/jobs/7700175002",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "language_russian": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}