{
  "job": {
    "id": "1479928",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1479928",
    "title": "Software Engineer / QA",
    "company": "Swedbank AS",
    "location": "Unknown",
    "posted_date": "2025-12-09T12:25:34.226+00:00",
    "discovered_date": "2025-12-10T15:09:22.051815",
    "description": "Are you passionate about testing and troubleshooting? Do you thrive in a dynamic environment and enjoy working on complex assignments?\nIf so, we have the perfect opportunity for you!\nWe are looking for\nSoftware Engineer Developer in Test (SEDT)\nto join our pan-Baltic agile team. You’ll play a key role in ensuring high-quality deliveries for mission critical account services used by thousands of our customers.\nIn Swedbank you have the opportunity to:\nCollaborate with a      cross-functional Accounts Baltic team across Lithuania, Latvia, and      Estonia;\nDevelop and maintain various      account and deposit services, ensuring high-quality software delivery;\nEnsure secure and efficient      payment transactions within Swedbank and across the EU and global markets;\nContinuously improve and refine      software development and maintenance processes;\nDeliver high-value solutions to      customers and users with speed, quality, and stability;\nNavigate complex areas of accounts      services, learning and adapting to new challenges daily.\nWhat is needed in this role:\nSoftware quality assurance is the area you enjoy and feel      comfortable with;\nKnowledge      of QA methodologies, software development processes, and testing      frameworks;\nExperience with automation tools and frameworks;\nA collaborative, open-minded team player who is willing to learn      on the go;\nFamiliarity with Agile (Scrum, SAFe) ways of working;\nFluent English and at least one Baltic language.\nOur daily tech stack:\nJava · REST · SpringBoot · Kafka · IntelliJ · Git · Jenkins · Selenium · Postman · JMeter · Oracle DB · MS SQL · Jira · Confluence · MS Teams\nWith us, you can experience:\nPersonal and professional growth through self-leadership and continuous development;\nMeaningful work that positively impacts our workplace, our customers, and society;\nAn open and collaborative culture that encourages cross-functional teamwork and provides networking opportunities;\nA supportive and inclusive environment that promotes a balanced and sustainable work-life, with flexible working conditions when suitable for the role;\nBenefits such as our share based reward program Eken, company pension plan, employee offer for banking products, health insurance.\n\" Join our team and...\nyou’ll collaborate with talented, driven colleagues who are committed to delivering high-quality, stable software — and who go the extra mile to  improve how we work. Needless to mention fun, friendly atmosphere and plenty of opportunities for your growth development.\"\nMigle Nael, your future leader\nWe look forward to your application at 28.12.2025 the latest.\nWe may begin the selection during the application period, so we welcome your application as soon as possible.\nWe have made our choice regarding recruitment media and therefore kindly decline contact with ad sellers or sellers of other recruitment services.\nIf you are to be employed in Latvia, please note that the salary offered for this position ranges from 3\n,200–4,800 €\ngross i.e. before taxes. Read more here.\nIf you are to be employed in Lithuania, please note that the salary offered for this position ranges from 3\n,900–5,800 €\ngross i.e. before taxes. Read more here.\nIf you are to be employed in Estonia, please note that the salary offered for this position ranges from 3\n,650–5,450 €\ngross i.e. before taxes. Read more here!\nSwedbank does not discriminate anybody based on gender, age, sexual orientation or sexual identity, ethnicity, religion or disability – everybody is welcome.\n#LI-Hybrid #LI-ML1",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 5.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "title_match": 15.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "java",
    "agile",
    "scrum"
  ],
  "category": "Low Priority"
}