{
  "job": {
    "id": "1480107",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1480107",
    "title": "Senior Facilities Manager",
    "company": "Luminor",
    "location": "Unknown",
    "posted_date": "2025-12-09T15:41:14.484+00:00",
    "discovered_date": "2025-12-10T15:09:26.870510",
    "description": "Join our team as a Senior Facilities Manager!\nYes, you can! That's our attitude towards our work, ambitions, ideas, and relationships. We at Luminor believe that anyone has the potential to achieve big things and encourage everyone to achieve them, professionally and personally.\nWhoever you are and whatever your role is, with Luminor, you will get a once-in-a-lifetime opportunity to build a local banking champion.\nYour mission is to lead the seamless operation of our facilities, delivering a secure and high-quality environment for employees and customers.\nHow You Will Make an Impact:\nOwn facilities-related processes and contracts (rent, maintenance, etc. other services)\nProvide employees with a contemporary and high quality working environment, initiating necessary improvement projects\nShape a long-term strategic view for the premises\nExecute security and safety processes\nOwn workplace management process and transportation services technical part\nCooperate with other units for development and execution of processes (People & Culture, Op Risk, accounting, legal etc.)\nOversee fixed assets of the bank, keeping inventory of the assets\nOrganize training to bank employees in matters relating to facilities\nCooperate with suppliers\nWhat Makes You a Great Fit:\nDeep understanding of Facilities management and previous 5 year experience in a similar profession, that includes overseeing and owning questions and improvements that relate to physical security\nExcellent communication skills and ability to act as advisor for stakeholders\nAbility to read technical drawings\nKnowledge of health & safety regulations\nAbility to manage construction and development projects\nAbility to write internal procedures in area of expertise\nFluent English and Estonian is required in spoken and written communication due to working on the Pan-Baltic level\nWhy You Will Love Working Here:\nFlexibility.\nFlexible working hours, Hybrid work, and the possibility to work from anywhere in the EU, Iceland, Switzerland, and the UK (in total 90 days per year)\nInternational teams.\nTeams that go outside Pan-Baltic borders, where people value challenging work together with good humor and having fun\nCulture.\nYou’ll be joining a team where things move fast, ideas flow freely, and change is part of the everyday. It’s a dynamic environment that keeps you learning, growing, and never bored\nMore vacation.\nAdditional weeks of vacation are available to all employees who have been in the company for 1 year or more\nVolunteer time off.\nWe care about giving back to society, therefore, you will get additional days off for volunteering purposes\nPaid leave.\nWe are proud of our employees who are participating in military training. Therefore, Luminor offers 30 fully paid calendar days for military training every year\nHealth benefits.\nA competitive benefits package in addition to your salary that includes health insurance after the first 3 months pass in all three Baltic states, as well as Health days in case of your absence due to sickness without a doctor's note needed\nWellbeing.\nAccess to tools and resources that help you feel good and be productive at work and in life\nProfessional growth.\nInternal and external training programs, LinkedIn learning, workshops, conferences, online training, etc\nSpecial Offer for Luminor products & services.\nEnjoy special offers & pricing for products and services provided by Luminor\nGross salary.\n2,400 - 3,700 EUR/month, which is to be determined depending on your level of experience and competencies\nThe application deadline is the 31st of December.\nWe are looking for a candidate primarily already located within the Baltics. Please apply with your CV in English and\nPDF format\n!",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "title_match": 15.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "senior"
  ],
  "category": "Low Priority"
}