{
  "job": {
    "id": "23933ae7fc4c6491",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/product-designer-svsei-19815165",
    "title": "Product Designer",
    "company": "Veikkaus Oy",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 9.12.",
    "discovered_date": "2025-12-10T15:11:28.069325",
    "description": "Veikkaus is a gaming company for everyone, striving to be better in every aspect. Our passion is to drive better gaming so that our customers can enjoy every moment. Caring, teamwork, and courage are the values that guide everything we do. Responsibility is a core of our operations. Our goal is to be a respected and successful international money gaming group that continuously improves while always putting both customers and employees first. For a better game - and working life. Product Designer The future of gaming in Finland is changing - and we're recruiting. In 2027, the Finnish license market will open, bringing a new era for iGaming. At Veikkaus, we're preparing for this transformation - and we're looking for passionate professionals to join us on this exciting journey. We're strengthening our Betting and iCasino teams with true iGaming experts: people with international experience, a hunger for success, and a persistent drive to win. If you're ready to help shape the future of responsible, competitive money gaming, now is the time to join us. We're looking for a Product Designer - Sports to create seamless user journeys and high-quality interfaces across our digital sports betting products, support user testing and strengthen our design system. In this role, you'll collaborate closely with product designers, product owners, and developers to deliver intuitive solutions that improve the look, feel and usability of our digital experiences while creating interactions that feel seamless, intuitive, and well-structured. Key responsibilities Design user flows, wireframes, and high-fidelity UI for features and products. Support user testing activities and incorporate feedback into designs. Contribute to and maintain the design system for consistency and scalability. Deliver high-quality user flows, concepts, prototypes, and design documentation. Qualifications and experience: 3+ years of experience in product or UX design. Proficiency in Figma and design tools for creating user flows, wireframes, and prototypes. Understanding of design systems and multi-platform UX principles. Ability to collaborate and integrate feedback from stakeholders and users. Experience in the iGaming industry and especially Sports betting is highly valued. Proven international track record in B2C products. Experience in cross-platform products, including native iOS (Swift), native Android (Kotlin), mobile web, and desktop web is required. Bachelor's degree in Design, HCI, or related field, or equivalent experience. We offer: A workplace where the game evolves - and so do you . You'll face meaningful challenges and gain new skills while contributing to shared success - in Finland and beyond. We value curiosity and create the space for it to thrive. Inspiring and supportive teammates you can rely on. The best ideas and world-class entertainment are built together - and Veikkaus thrives because of its people. Balanced and inspiring work life. At Veikkaus, we believe a good job adds something to life - but isn't all there is to it. Excellent employee benefits. You can read more about us and our benefits from here . It is important to us that everyone can come to work as their authentic selves. We value diverse backgrounds, skills, and perspectives, and believe that success comes from working in diverse teams. We encourage individuals from various backgrounds to apply for our jobs. The position is located at Veikkaus' headquarters in Pohjois-Haaga, Helsinki. We work flexibly in a hybrid model. The position is permanent and full-time. Interested? Awesome! Please send your application with your portfolio, CV and salary request no later than 22.12.2025. We are excited to hear from you! For any inquiries about the position don't hesitate to contact Sanna Shibasaki-Rosenberg, Head of Design at sanna.shibasaki-rosenberg(at)veikkaus.fi A drug test under Section 7 of the Act on the Protection of Privacy in Working Life (759/2004) will be conducted on the selected candidate.",
    "contact_name": null,
    "contact_email": "sanna.shibasaki-rosenberg@veikkaus.fi",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "product owner"
  ],
  "category": "Low Priority"
}