{
  "job": {
    "id": "32613b7136ae176c",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/product-group-manager-feeding-temporary-helsinki-smsus-19805175",
    "title": "Product Group Manager Feeding (temporary), Helsinki",
    "company": "Musti Group Finland Oy",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 4.12.",
    "discovered_date": "2025-12-10T15:12:23.917858",
    "description": "Musti Group is the leading Nordic pet care specialist operating in Finland, Sweden, Norway, and the Baltics. Our mission is to make the life of pets and their parents easier, safer and more fun throughout the entire lifespan of the pet. We want to be a full-service product provider and operator for our customers - both physically and digitally. We believe that a full-service ecosystem offers a unique value proposition that enhances and strengthens strong customer relationships and sets us apart from our competitors. Musti Group's net sales were EUR 444 million in 2024. We have over 2,000 employees, 1,9 million customers and 415 stores. Read more about us! Product Group Manager Feeding (temporary) We are looking for a dedicated Product Group Manager (PGM) for Global & Exclusive (G&E) feeding brands. This is a temporary role as a parental leave substitute, lasting approximately 9 months, starting latest in February 2026. As PGM G&E, you will be responsible for Global and Exclusive food brands within Nordic and Baltic markets. You will manage category development, assortment planning, and supplier collaboration, working alongside internal & external stakeholders to drive profitable growth within the Musti channels. You will be a part of the Category and Campaign team and work closely with colleagues from Nordics and Baltics. The position is based at our Helsinki office and will report to the Group Category Manager. Key Responsibilities Category management and assortment planning for the G&E portfolio. Define consumer pricing strategies and supplier collaborations. Manage G&E product and brand development within Feeding. Conduct market, consumer, and competitor analysis to optimize profitability and meet customer needs. Manage supplier relations related to assortment planning and data collection. Develop and maintain product information and marketing materials. Oversee performance reporting and analytics for G&E feeding brands What are we looking for? Analytical and driven person with a strategic growth mindset and hands-on execution skills. You thrive in a dynamic, fast-paced environment, balancing big-picture thinking with operational details. Strong interpersonal skills and the ability to collaborate across teams are essential. Background and Experience Bachelor's or master's degree in business administration or a related field Proven track record in brand and portfolio development, ideally within petcare Strong project management and organizational skills. Experience in category management, pricing strategy, and supplier negotiations. Excellent collaboration and stakeholder management skills. Proven track record of understanding consumer and pet needs is an advantage. Why to join our pack? We offer you diverse and inspiring work in a rapidly growing and evolving business within one of the leading pet retail companies. You'll have the opportunity to shape your own role and contribute to our development. You'll collaborate closely with various stakeholders while enjoying a high degree of independence in your work. Plus, you'll meet furry colleagues every day - and you're welcome to bring your own four-legged friend to the office! The position is based in Helsinki Käpylä with the possibility to work remotely two days a week. We often have furry friends in the office; therefore, the work might not be suitable for a person who is allergic to pets. Next steps If you have any questions about the position, please contact our Group Category Manager Joonas Santala, tel.+358 (0)40 8402920. Available on 9.12. 16-16.30 and 10.12. during 8.30-9.00. Got excited to join our pack? Then please go ahead and submit your application with CV at the latest by 14.12.2025. We will fulfill the position as soon as we find a suitable candidate.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "title_match": 15.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "data",
    "API"
  ],
  "category": "Low Priority"
}