{
  "job": {
    "id": "69c20ad74dcb7002",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/solution-analyst-digitaaliset-asiakirjat-sospp-19817116",
    "title": "Solution Analyst, Digitaaliset asiakirjat",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 10.12.",
    "discovered_date": "2025-12-10T15:11:28.068583",
    "description": "OP Pohjolan asiakaskohtaamisissa syntyy päivittäin suuri määrä digitaalista dokumentaatiota. Vaikka itse sanommekin, on tekemisemme merkittävässä roolissa 4 miljoonan asiakkaan pankkiryhmässä. Tiimimme huolehtii siitä, että kaikki asiakirjat tallennetaan, säilytetään, näytetään ja poistetaan lakien ja regulaatioiden mukaisesti sekä että asiakirjat ovat ajantasaisesti sekä asiakkaiden, että toimihenkilöiden käytettävissä. Kiinnostaako sinua syventyä moderniin prosessikehitykseen sekä asiakirjojen tiedolla ohjaamiseen Solution Analystin roolissa? Hieno juttu - lukaise ihmeessä ilmoitus loppuun ja tule meille työkaveriksi. Tehtävästä Autat liiketoimintoja ottamaan käyttöön digitaalisen asiakirja-arkiston (Asiakasarkisto). Keräät ja arvioit liiketoiminnan tarpeita, huolehdit käyttöönottoprosessin vaivattomasta etenemisestä ja ehdotat sekä kehität uusia ratkaisuja tiimimme tuella. Käyttöönottoprosessissa määritellään järjestelmämme vaatimat tiedot Tiedonohjaussuunnitelmaan sekä tuetaan liiketoimintoja testauksessa ja tuotantoon viennissä. Palvelet koko OP Pohjolaa, sen kaikkia liiketoimintoja sekä toimihenkilöitä käyttöönottojen lisäksi myös osana toimihenkilöiden työtä tukevaa back-office tiimiä. Tehtävään kuuluu myös rooli tiimimme Agile Masterina. Agile Masterin tehtävään kuuluu motivoiden, arjen esteitä poistaen sekä ohjaten tukea tiimiämme ketterän kulttuurin mukaisten toimintatapojen hiomisessa. Agile Masterina pääset myös jalkauttamaan uusia toimintamalleja ja työkaluja osaksi arkeamme. Etsimämme Solution Analystin tuntomerkit Emme oleta sinun olevan seppä syntyessäsi ja ottavan haltuun aivan kaikkea ensimmäisestä työpäivästäsi lähtien. Uskomme silti, että tehtävässä menestyy parhaiten henkilö, jolta löytyy jo useamman vuoden kokemusta kehitysprojekteissa tai -tehtävissä toimimisesta vastaavanlaisissa tehtävissä. Aiemmasta kokemuksesta finanssialan tietomallien, tietomallinnuksen ja tiedolla ohjaamisen parista on tässä tehtävässä iso etu. Pähkinänkuoressa odotamme myös, että sinulla on reipas ja innostunut asenne sekä halua oppia uutta ymmärrystä sovelluskehittämisestä, kokemusta määrittelytyöstä sekä palvelukehityksestä järjestelmien näkökulmasta kykyä fasilitoida, oivalluttaa ja tukea liiketoimintaa palveluiden kehittämisessä ja fasilitoida modernia prosessikehitystä suunnittelusta toteutukseen asti kokonaisuuksien ja riippuvuuksien hahmottamista lisäksi kykyä tarkkuuteen yksityiskohdissa kokemusta Jiran ja Confluencen käytöstä Teknisten taitojen lisäksi arvostamme erityisesti itseohjautuvaa ja prosessilähtöistä ajattelutapaa. Verkostomaisessa ympäristössämme erinomaiset yhteistyö- ja viestintätaidot (niin suomeksi kuin englanniksi) ovat arjessa tärkeässä roolissa. Muutama sana meistä... Arkistopalvelut nykymuodossaan on uusi organisaatio, joka kokoaa OP Pohjolan arkistointipalvelut yhteen. Tarjoamme yleispalvelut koko OP Pohjolan asiantuntevien tiimien ja laajan palveluvalikoiman voimin. Organisaatio on kehitysvaiheessa ja etsimme jatkuvasti parhaita toimintatapoja tiimirajojen yli. Työskentely on joustavaa ja hybridimallista (etänä ja ja Vallilan toimipisteessä Helsingissä). Päivittäisessä työssä käytetään Microsoft O365-, Jira- ja Confluence-työkaluja. ...ja syistä, miksi meille kannattaa hakea Solution Analystina pääset Asiakasarkistotiimiin rakentamaan uutta toimintatapaa ja tutustumaan laajasti OP Pohjolan eri liiketoimintoihin. Saat kattavan perehdytyksen tehtäviisi. Työskentelet työparin kanssa ja Arkistopalveluissa on laaja verkosto asiantuntijoita tukemassa sinua onnistumaan työssäsi. Tekemiselläsi ja timanttisella asenteellasi pystyt vaikuttamaan omaan urapolkuusi meillä, tuemme sinua omassa kehittymisessäsi ja kannustamme rohkeasti eteenpäin! Työllistyt OP Pohjolaan vakituiseen työsuhteeseen. Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme , johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Hae osaksi tulevaisuuden tähtijoukkoa! Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään sunnuntaina 4.1.2026 . Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Jos sinulla on mielessä kysymyksiä tehtävästä tai meillä työskentelystä, lisätietoja tehtävästä antaa tuleva tiimin vetäjäsi Product owner Maija Pasternack puh. 040 501 9505 tai perehdyttäjäsi Operations Product Owner Tiia Hautala puh. 045 652 2070. Parhaiten tavoitat heidät torstaina 18.12. klo 15-16 ja maanantaina 22.12. klo 13-14. Alamme käsitellä hakemuksia heti hakuajan auettua, joten lähetä hakemuksesi meille jo tänään! Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat sekä teetetään huumausainetesti. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": "0405019505",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "agile",
    "product owner"
  ],
  "category": "Low Priority"
}