{
  "job": {
    "id": "a12cb91d572ae23d",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/pilviarkkitehti-svsal-19816059",
    "title": "Pilviarkkitehti",
    "company": "Valtion tieto- ja viestintätekniikkakeskus Valtori",
    "location": "Lappeenranta ja 10 muuta –",
    "posted_date": "Julkaistu 8.12.",
    "discovered_date": "2025-12-10T15:13:41.651233",
    "description": "Tule edistämään valtionhallinnon pilvimatkaa. Etsimme Pilvi- ja työympäristöpalveluiden ryhmään M365-arkkitehtia varmistamaan, että valtion laaja pilvityöympäristö toimii sujuvasti, turvallisesti ja kehittyy asiakkaiden tarpeiden mukana. M365-arkkitehti suunnittelee, ohjaa ja kehittää M365 -palvelukokonaisuutta. Roolissa vastaat palveluarkkitehtuurin linjauksista ja ratkaisujen kokonaiskuvasta. Työskentelet tiiviisti M365-asiantuntijoiden, tietoturvatoimintojen ja muiden teknisten tiimien kanssa. Rooliin kuuluu: • Tekninen ohjaus ja vaatimusten määrittely: Ohjaat ratkaisujen teknistä toteutusta, määrität vaatimuksia, arvioit muutoksia ja varmistat kokonaisuuden yhdenmukaisuuden • Tietoturva ja vaatimustenmukaisuus: Suunnittelet M365-ympäristön tietoturva/-suojaratkaisuja ja teet yhteistyötä tietoturva-asiantuntijoiden kanssa • Kehitys- ja käyttöönottohankkeiden tuki: Osallistut projekteihin teknisen arkkitehdin roolissa, tuet käyttöönottoja ja arvioit uusien ominaisuuksien vaikutuksia ympäristöön • Roadmap ja jatkuva parantaminen: Seuraat Microsoft 365 -palvelujen kehityssuuntia ja varmistat, että ympäristö kehittyy suunnitelmallisesti ja tukee organisaation tavoitteita Pilvipalveluita tuottavan tiimimme jäsenenä pääset laajasti edistämään valtionhallinnon pilvisiirtymää, sekä tutustumaan eri organisaatioihin, teknologioihin ja ratkaisuihin. Tarjoamme sinulle mielenkiintoisen ja vastuullisen työn sekä sen tueksi ammattitaitoiset kollegat ja organisaation, jossa autamme toisiamme menestymään. Meillä sinulla onkin mahdollisuus kehittyä, luoda uutta ja vaikuttaa. Lisätietoja http://www.valtori.fi Hakijalta odotamme Odotamme sinulta: • Kokemusta Microsoft 365 -ympäristön suunnittelusta ja Teamsin, Exchange Onlinen, OneDriven, SharePoint Onlinen sekä M365-tenantin asetusten kanssa työskentelystä • Laajaa kokonaisymmärrystä Microsoft 365 -palveluista ja identiteettien hallinnasta • Kykyä johtaa teknisiä ratkaisuja ja tehdä arkkitehtuurisia linjauksia • Vahvaa ymmärrystä tietoturvan ja vaatimustenmukaisuuden vaatimuksista • Hyviä dokumentointitaitoja • Hyviä yhteistyö- ja viestintätaitoja, sillä työ tehdään tiiviissä yhteistyössä muiden asiantuntijoiden, sidosryhmien ja asiakkaiden kanssa • Soveltuva korkeakoulututkinto Eduksi luemme: • TOGAF- tai muun yritysarkkitehtuuriviitekehyksen tuntemus, ja kyky soveltaa sitä pilvi- ja M365-kokonaisuuksissa • Sertifioinnit tai muu vahva näyttö osaamisesta Tarjoamme sinulle • Ateriaetu • Liikunta- ja kulttuurietu • Laajat työterveyden palvelut • Ergonomiset työvälineet ja erityistyölasit • Työkokemuksen perusteella jopa 38 arkipäivää lomaa / vuosi • Opiskelun palkallinen tuki 9 päivää / vuosi • Joustavuus työajassa ja etätyössä Selvitykset Virkaan tai tehtävään valittavasta henkilöstä voidaan tehdä hakijan suostumuksella perusmuotoinen henkilöturvallisuusselvitys (turvallisuusselvityslaki 726/2014). Menettelystä ja selvityksen kohteen oikeuksista löytyy tarkempia tietoja osoitteessa www.supo.fi. Yhteystietomme Anders Kortesniemi Vastuualuepäällikkö puh. 050 5161528 Hakemuksen lähettäminen Toivomme hakemukset ensisijaisesti sähköisinä Valtiolle.fi-palvelun kautta. Voit kuitenkin hakea tätä työpaikkaa myös toimittamalla hakemuksesi kirjaamon postiosoitteeseen. Sekä hakemuksessa että kirjekuoressa tulee mainita haettavan tehtävän ID-numero. Kirjeen tulee olla perillä hakuajan päättymiseen mennessä. Valtorin kirjaamo Lintulahdenkatu 5 00530 Helsinki Työnantaja Valtori rakentaa digitaalista Suomea. Tuotamme valtionhallinnon toimialariippumattomat ICT-palvelut sekä korkean varautumisen ja turvallisuuden vaatimukset täyttäviä tieto- ja viestintäteknisiä palveluja ja integraatiopalveluja. Mahdollistamme valtionhallinnon työn sujumisen toimivien ja turvallisten palvelujen avulla. Valtorissa työskentelee 1 600 ammattilaista eri puolilla Suomea. Valtorin asiakkaita ovat kaikki valtionhallinnon virastot ja laitokset. Asiakkaina voivat olla myös valtion liikelaitokset, muut julkisen hallinnon viranomaiset, julkisoikeudelliset laitokset, eduskunta ja valtion talousarvion ulkopuoliset rahastot ja julkista hallinto- tai palvelutehtävää hoitavat yritykset tai yhteisöt. Työkulttuurimme rakentuu luottamukselle ja arvostukselle. Yhdessä teemme Valtorista työpaikan, jossa on mukava tehdä töitä. Sijainti Lappeenranta, Mikkeli, Oulu, Helsinki, Hämeenlinna, Joensuu, Tampere, Jyväskylä, Kajaani, Kouvola, Raisio Voit tehdä työtä jossain seuraavista toimipisteistämme Lappeenranta Pormestarinkatu 1 53100 Lappeenranta Mikkeli Jääkärinkatu 33 50130 Mikkeli Oulu Viestikatu 1 90130 Oulu Helsinki, Lintulahdenaukio Lintulahdenkatu 5 00530 Helsinki Hämeenlinna Suomen kasarmi 10 13100 Hämeenlinna Joensuu Yliopistonkatu 6 80100 Joensuu Tampere Hatanpään valtatie 36 A 33100 Tampere Jyväskylä Vapaudenkatu 58 40100 Jyväskylä Kajaani Kalliokatu 4 87101 Kajaani Kouvola Valimontie 5 45100 Kouvola Raisio Nallinkatu 8 21200 Raisio Tutustu työnantajaan Tehtävän tiedot Muut tehtävän tiedot Lisätietoja: ICT-palvelukeskuksena toivomme kaikki hakemukset ensisijaisesti rekrytointijärjestelmän kautta. Haethan tehtävää mahdollisimman pian, sillä käsittelemme hakemuksia jo hakuaikana. Tehtävän sijoituspaikka voi olla esim. Helsinki ja Jyväskylä, tai muu Valtorin toimipiste. Tehtävän taso: Asiantuntijataso Etätyö: Mahdollisuus työskennellä etänä Työaikamuoto: Virastotyöaika Koeaika: Tehtävään valitulla on kuuden kuukauden koeaika. Palkkatiedot: Haettavan tehtävän palkkaus määräytyy Valtorin palkkausjärjestelmän vaativuustason 11a mukaisesti. Vaativuustason mukainen tehtäväkohtainen palkanosa on 4586,32 €/kk. Lisäksi maksetaan henkilökohtaiseen työsuoritukseen perustuvaa palkanosaa, joka on enintään 50 % tehtäväkohtaisesta palkanosasta. Henkilökohtainen palkanosa määritetään erikseen työsopimuksen allekirjoituksen yhteydessä. Henkilökohtaista palkanosaa tarkistetaan kuuden kuukauden kuluttua työsuhteen alkamisesta.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}