{
  "job": {
    "id": "ae3e671cff4daaf9",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/karkkainen-haku-on-alkanut-nyt-haemme-henkilostoa-seinajoen-karkkaiselle-sdsuu-19812475",
    "title": "Kärkkäinen laajenee Seinäjoelle - haemme nyt henkilöstöä!",
    "company": "Kärkkäinen Oy",
    "location": "Seinäjoki –",
    "posted_date": "Julkaistu 8.12.",
    "discovered_date": "2025-12-10T15:09:39.504149",
    "description": "🚀 Kärkkäinen Oy laajenee Seinäjoelle keväällä 2026 – haluaisitko sinä olla mukana tärkeänä osana myymälän toimintaa jo heti myymälän alkutaipaleella? Pian avattava tavaratalomme tarjoaa ainutlaatuisen mahdollisuuden sinulle, jolla motivaatio ja asenne ovat kadehdittavan kohdallaan! Etsimmekin nyt motivoituneita, palvelualttiita ja hyvällä asenteella varustettuja tekijöitä mukaan uuden 15 000 m2 tavaratalon toimintaan. Visiomme - Asiakkaan parhaaksi! - näkyy arjen työskentelyssämme joka päivä. Hae mukaan Kärkkäisen tiimiin ja tule kehittämään yhdessä uutta Seinäjoen tavarataloa! 💫 Seinäjoen Kärkkäinen tarjoaa monipuolisesti erikoisliikkeen tasoisia palveluita ja tuotteita valtavassa, Ideaparkin kylkeen kohoavassa 15 000 m2 tavaratalossaan! Myymälän erikoisliikkeiden tasoiset osastot tarjoavat laajan valikoiman merkkituotteita ja asiantuntevaa palvelua, jotta asiakkaat löytävät juuri omiin tarpeisiinsa sopivat ratkaisut - sillä meiltä ne Löytyy! Lisäksi Seinäjoen Kärkkäisen tavaratalo sisältää laadukkaasta mönkijä-, moottoripyörä- ja puutarhakonevalikoimastaan sekä palvelustaan tunnetun Konemyymälän ja Konehuollon, aina tuoreita ja maistuvia kahvilatuotteita tarjoavan Fresh!Coffee -kahvilan sekä Huoltokeskuksen monipuolisine palveluineen. Tarkemmat kuvaukset tehtävistä löydät alla olevista linkeistä, joiden kautta voit jättää hakemuksesi haluamaasi tehtävään! 👇 Haemme henkilöstöä Myymälätyöhön Myymälätyöntekijöitä eri osastoille Hyllyttäjiä Kassatyöntekijöitä Varastotyöntekijöitä Vahtimestareita (näkyvä valvonta ja kameravalvonta tavaratalossa) Konemyyntiin ja Konehuoltoon Konemyyjiä (laitemyyjiä) Koneen myymälätyöntekijöitä (varaosa-/tarvikemyyjiä) Asentajia ja huoltoneuvoja konehuoltoon (mm. mönkijä-, moottorikelkka-, pienkonehuollot) Huoltokeskukseen Palveluvastaavaa (huoltokeskus ja kahvila) Asentajaa (mm. pyörä- ja suksihuollot) Infon/Huoltokeskuksen myyjiä Fresh!Coffee -kahvilaan Kahvilatyöntekijöitä Tarjoamme: 🏢 Täysin uuden ja modernin työympäristön 🔧 Mahdollisuuden olla mukana tavaratalon käynnistymisessä jo alusta lähtien 🧩 Monipuolisen ja vastuullisen tehtävän kasvavassa yhtiössä 🎁 Hyvät ison talon henkilöstöedut, mm. Epassin ja henkilöstöalennuksen Viikkotyöaika tehtävissä on pääsääntöisesti 25-37,5h/viikko, mutta sopimuksen tuntimäärää voidaan mahdollisesti sovitella elämäntilanteesi mukaan. Jos koet olevasi etsimämme henkilö, lähetäthän hakemuksesi ja CV:si mahdollisimman pian, sillä valinnat tehdään heti sopivien tekijöiden löydyttyä! Hakemuksia käsitellään jo hakuaikana. Hakuaika päättyy viimeistään 18.1.2026. Jos sinulla on kysyttävää työtehtävästä, kysymyksiin vastaa Seinäjoen myymäläpäällikkö Kris Niemistö arkisin klo 13-15 välillä: kris.niemisto@karkkainen.com / 050 420 3540.",
    "contact_name": null,
    "contact_email": "kris.niemisto@karkkainen.com",
    "contact_phone": "0504203540",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}