{
  "job": {
    "id": "ba643155310ea191",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/solution-analyst-digitoinnin-palvelut-sospp-19817119",
    "title": "Solution Analyst, Digitoinnin palvelut",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 10.12.",
    "discovered_date": "2025-12-10T15:11:28.068832",
    "description": "Etsimme vakituiseen työsuhteeseen Helsinkiin Solution Analystiä. Kansainvälinen tiimimme kehittää Intelligen Document Processing alustoja, jotka ovat osana Arkistopalveluiden digitointipalveluita. Tehtävästä Solution Analystina tulet toimimaan liiketoiminnan ja ohjelmistokehittäjien rajapinnassa, varmistaen että liiketoiminnan puolelta nousevat kehitystarpeet muuntuvat ohjelmistokehittäjille ymmärrettäviksi vaatimusmäärittelyiksi. Vastaat siis alueesi kehitystarpeiden tunnistamisesta, analysoinnista ja kuvaamisesta yhdessä sidosryhmien ja tiimisi asiantuntijoiden kanssa. Olet mukana miettimässä kehitettävän kokonaisuuden ratkaisua prosessilähtöisesti tietomallitarpeet ja alustan kyvykkyydet huomioiden. Näiden pohjalta luot tarvittavia kuvauksia ja dokumentoit toiminnallisia vaatimuksia. Liiketoiminnan tarpeiden lisäksi pohdit kriittisesti ja ratkaisuhakuisesti mikä on regulaation, teknisen toteutuksen ja liiketoimintaprosessien kannalta järkevin kehittämisen toteutustapa. Keräät ja havainnoit kehitystarpeita käymällä aktiivista keskustelua monien sisäisten sidosryhmien kanssa. Olennainen osa työnkuvaasi on näiden keskusteluiden fasilitoiminen esimerkiksi työpajojen muodossa. Millaista osaamista etsimme? Sinulla on vahvaa aiempaa kokemusta vaatimusmäärittelytyöstä ja olet tehnyt päätoimisesti vaatimusmäärittelyä vähintään kolmen vuoden ajan. Kokemus arkistojen, asiakirjojen hallinnan tai pankkiliiketoiminnan parissa työskentelystä katsotaan eduksi. Kykenet siis itsenäisesti määrittämään, tuottamaan ja kuvaamaan liiketoiminnan tarpeita kehitettäviksi ominaisuuksiksi ja kokonaisuuksiksi. Vaatimusmäärittelykokemuksen lisäksi etsimme osaajia seuraavanlaisella osaamispaletilla: Aiempi liiketoimintakokemus pankkiliiketoiminnan parissa Tekninen osaaminen ja ymmärrys, jonka avulla ymmärrät BoxOffice alustan kehittämistä. Hallitset ketteriä menetelmiä ja työkaluja. Sujuvat kommunikointi- ja viestintätaidot sekä suomeksi että englanniksi. ihmisenä kestät paineiden alla työskentelyä (välillä joitain asioita vaan pitää saada tietyssä ajassa ratkottua), ja turnauskestävyyttäkin sinulta löytyy Me tarjoamme Arkistopalvelut nykymuodossaan on uusi organisaatio, joka kokoaa OP Pohjolan arkistointipalvelut yhteen. Työskentely on joustavaa ja hybridimallista (etänä ja Vallilan toimipisteessä Helsingissä). Päivittäisessä työssä käytetään Microsoft O365-, Jira- ja Confluence-työkaluja.Saat kattavan perehdytyksen tehtäviisi ja Arkistopalveluissa on laaja verkosto asiantuntijoita tukemassa sinua onnistumaan työssäsi. Tekemiselläsi ja timanttisella asenteellasi pystyt vaikuttamaan omaan urapolkuusi meillä, tuemme sinua omassa kehittymisessäsi ja kannustamme rohkeasti eteenpäin! Työllistyt OP Pohjolaan vakituiseen työsuhteeseen. Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme , johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Lisätiedot ja hakuohjeet Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään sunnuntaina 4.1.2026 . Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Lisätietoja tehtävästä ja meillä työskentelystä antaa Product Owner, Ville Solja. Tavoitat hänet parhaiten puhelimitse maanantaina 22.12. klo 13-15 ja maanantaina 29.12. 13-15 (040 513 3927) tai sähköpostitse: ville.solja(a)op.fi. Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat sekä teetetään huumausainetesti. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": "0405133927",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "API",
    "product owner"
  ],
  "category": "Low Priority"
}