{
  "job": {
    "id": "c2ad61d4553c5734",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/fazer-tervetuloa-tutustumaan-fazeriin-monien-mahdollisuuksien-ja-makujen-maailmaan-sdsuu-19808192",
    "title": "Fazerin sesonkityöpaikat julkaistaan pian – tervetuloa tutustumaan monien mahdollisuuksien ja makujen maailmaan",
    "company": "Fazer",
    "location": "Helsinki ja 6 muuta –",
    "posted_date": "Julkaistu 8.12.",
    "discovered_date": "2025-12-10T15:09:39.502528",
    "description": "Haluatko tehdä työtä, jossa yhdistyvät vastuullisuus, innovatiivisuus ja aito ilo ja yhdessä tekeminen? Entä kiinnostavatko monipuoliset työtehtävät, jotka tarjoavat mahdollisuuden kehittyä, oppia uutta ja olla osa yritystä, joka on ollut suomalaisille tärkeä jo yli 130 vuoden ajan? Siinä tapauksessa kannattaa pitää Fazer mielessä. Fazerin sesonkirekrytoinnit käynnistyvät pian, ja tänäkin vuonna tarjolle tulee rooleja moneen makuun niin tuotannon kuin palvelun puolella. Tutustu lisää Fazeriin työnantajana » Fazerilla työskentelemme yhdessä paremman arjen ja makuelämysten puolesta – aina suklaasta leipään ja ravintolaelämyksistä kansainvälisiin elintarvikekonsepteihin. Meillä työskentelee tuhansia ammattilaisia monenlaisissa tehtävissä tuotannosta tuotekehitykseen ja logistiikasta asiakaspalveluun. Jokainen rooli on tärkeä osa kokonaisuutta, joka tekee meistä yhden Pohjoismaiden rakastetuimmista brändeistä. Miksi Fazer? Meille on tärkeää, että työntekijämme viihtyvät ja voivat hyvin. Tarjoamme: Mahdollisuuksia kasvaa ja oppia Merkityksellistä työtä, jossa voit vaikuttaa Innostavan työyhteisön, jossa tekemisen ilo näkyy joka päivä Me fazerilaiset haluamme luoda monimuotoisuuden ja osallisuuden kulttuurin sekä tarjota tasavertaisen työyhteisön, jossa kaikkia työntekijöitä kunnioitetaan ja jossa työympäristö koetaan motivoivaksi ja turvalliseksi. Pidä silmät auki – sesonkirekrytointimme käynnistyy pian! Etsimme vuosittain uusia tekijöitä vahvistamaan tiimejämme sesonkien aikana. Mikäli haluat päästä osaksi Fazerin makumatkaa, kannattaa seurata ilmoittelua – haku alkaa pian. Sillä välin voit tutustua meihin tarkemmin klikkaamalla Hae työpaikkaa -painiketta.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}