{
  "job": {
    "id": "ea47fa9caca4b3b5",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/varastotyontekija-vesileikkaaja-spsol-19815236",
    "title": "Varastotyöntekijä, vesileikkaaja",
    "company": "PolarPro Henkilöstöratkaisut",
    "location": "Nurmijärvi –",
    "posted_date": "Julkaistu 9.12.",
    "discovered_date": "2025-12-10T15:09:39.502809",
    "description": "Etsimme varastotyöntekijää vesileikkauksen pariin vakituiseen työsuhteeseen Nurmijärvelle. Päätehtävänä on metallituotteiden vesileikkaus ja prosessin valvonta, jonka lisäksi tehtäviin kuuluu monipuolisia varastotöitä. Työskentelyssä käytössäsi ovat mm. kattonosturi painavien tuotteiden siirtoon sekä trukki. Aiempi trukinajotaito katsotaan siis eduksi. Työssä tarvitaan tarkkuutta ja hyvää fyysistä kuntoa. Arvostamme lisäksi positiivista asennetta, oma-aloitteisuutta ja halua oppia uutta. Aikaisempi kokemus vesileikkauksesta on edellytys työssä menestymisen kannalta. Töitä tehdään arkisin klo 6-14 (valmius kaksivuorotyöhön). Tarjoamme sinulle: Luotettavan työnantajan, joka pelaa yhteisillä pelisäännöillä. Pitkäaikaisen vakituisen työsuhteen, keskimääräinen työsuhteen pituus meillä PolarProlla on vähän yli 2 vuotta. Nimetyn yhteyshenkilön, joka tukee sinua työurallasi. Lääkärikeskus Aavan kattavat työterveyspalvelut koeajan jälkeen. Helly Hansenin laadukkaat työvaatteet. Lisätietoa palkkauksesta: Palkkaus perustuu teknologiateollisuuden työehtosopimukseen, jossa lähtöpalkka 2300 e/kk kokemuksestasi riippuen. Huom! Tietoturvasyistä emme voi ottaa hakemuksia vastaan sähköpostitse. PolarPro tarjoaa hyviä uramahdollisuuksia logistiikan ja kuljetuksen ammattilaisille. Meille työpaikka edustaa arjen toista kotia ja siksi on tärkeää, että työntekijämme viihtyvät työssään ja sinne on kiva palata. Työntekijäkokemusten mukaan meillä arki sujuu, ja siitä kertovat myös henkilöstömme pitkäaikaiset työsuhteet. Liity tiimiin, jossa arki rullaa! Kysy tehtävästä lisää Jyrkiltä: jyrki.maskonen@polarpro.fi.",
    "contact_name": null,
    "contact_email": "jyrki.maskonen@polarpro.fi",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}