{
  "job": {
    "id": "ec6c9f6be89ddf33",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/product-owner-ai-product-development-helsinki-tampere-sesli-19807832",
    "title": "Product Owner, AI & Product Development (Helsinki, Tampere)",
    "company": "Elisa Oyj",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 5.12.",
    "discovered_date": "2025-12-10T15:11:28.067112",
    "description": "Haluatko olla mukana rakentamassa digitaalisia palveluita, joita sadat tuhannet suomalaiset yritykset käyttävät päivittäin? Haemme kahta Product Owneria Elisan Yritysasiakasliiketoiminnan Connectivity-alueelle. Elisan Yritysasiakasyksikön AI & Product Development -tiimissä varmistamme, että yritysasiakkaillamme on sujuvat ja luotettavat kanavat ostamiseen ja asiointiin - nyt ja tulevaisuudessa. Tähän kaikkeen kaipaamme nyt sinun osaamistasi! Tässä roolissa johdat digitaalista ja IT-kehitystä tiiviissä yhteistyössä liiketoiminnan ja kehitystiimien kanssa. Tavoitteenasi on maksimoida asiakas- ja liiketoiminta-arvo kehittämällä ja lanseeraamalla palveluita, kuten päätelaitteet, yritystietoturva ja monet muut tuotteemme. Mitä arki Product Ownerina pitää sisällään? Johdat kehityskokonaisuutta ja toimit linkkinä liiketoiminnan ja kehityksen välillä. Varmistat, että visiosta päästään tuotantoon asti - oikeita asioita, oikeaan aikaan. Vastaat mm. Uuden OmaElisan, Työntekijän OmaElisan sekä Salesforce-kehityksen etenemisestä taustajärjestelmineen. Ohjaat tiimin päivittäistä työtä, huolehdit tiimin hyvinvoinnista ja teet yhteistyötä kumppaneiden kanssa. Sparrailet muiden Product Ownereiden kanssa ja kehität toimintamalleja yhdessä. Keskeiset tehtäväsi Suunnitella, omistaa ja johtaa kehitysroadmapia ja priorisointia. Varmistaa kehityshankkeiden eteneminen ja reagoida poikkeamiin. Kerätä tarvittavaa tietoa tiimeille ja hyväksyä toteutukset tuotantoon. Kehittää yhteistyötä liiketoiminnan, kehityksen ja sidosryhmien välillä. Osallistua PO-yhteisön kehittämiseen. Mitä odotamme sinulta? Kokemusta online-palveluiden kehittämisestä ja Salesforce-ympäristöstä. Sujuvaa suomen ja englannin kielen taitoa Etsimme henkilöä, joka osaa hahmottaa laajoja kokonaisuuksia ja muuttaa ne selkeiksi kehityskohteiksi. Sinulla on vahvat viestintätaidot ja rohkeus tuoda omat näkemyksesi esiin rakentavasti. Toimit ratkaisukeskeisesti ja proaktiivisesti, innostat ja osallistat muita yhteiseen tekemiseen. Lisäksi arvostamme: Kokemusta laajoista liittymäpäivityksistä ja hinnankorotushankkeista. Projektien vetämistä osana laajoja kehityshankkeita. Tuntemusta ketteristä menetelmistä ja tuotejohtamisesta. Mitä voimme tarjota urallesi? Meillä saat vastuuta ja vapautta ja ennen kaikkea mahdollisuuden olla mukana rakentamassa merkittävää digitaalista muutosta, joka näkyy miljoonille ihmisille. Työskentelet rennossa, mutta asiantuntevassa tiimissä, jossa jokainen tukee toisiaan ja jakaa osaamistaan. Päiväsi eivät ole samanlaisia: monipuolinen tehtäväkenttä haastaa ja innostaa, ja samalla sinulla on tilaa kehittää omaa osaamistasi ja kasvaa urallasi. Tämä on paikka, jossa ideat muuttuvat teoiksi ja sinulla on aito vaikutus siihen, mihin suuntaan kuljemme. Arkeemme kuuluu joustavat työtavat ja hybridityömalli (toimistolla keskimäärin 3 päivää viikossa) sekä kulttuuri, jossa yhdessä tekeminen ja uuden oppiminen ovat keskiössä. Tutustu meihin tarkemmin Elisan urasivuilla. Kuulostaako tämä sinun seuraavalta askeleeltasi? Hienoa - jätä hakemuksesi mahdollisimman pian alla olevan linkin kautta. Voit liittää mukaan myös palkkatoiveesi. Aloitamme haastattelut viimeistään tammikuussa. Lisätietoja tehtävästä antaa Nina Kuhlström (Head of Development), p. 050 363 2597, nina.kuhlstrom(at)elisa.fi",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": "0503632597",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "API",
    "product owner"
  ],
  "category": "Low Priority"
}