{
  "job": {
    "id": "ee9c0849c5fc5f22",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/sato-remonttimestari-finland-sdsuu-19815416",
    "title": "Remonttimestari",
    "company": "SATO",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 9.12.",
    "discovered_date": "2025-12-10T15:09:39.503395",
    "description": "Oletko rakennusalan ammattilainen, joka haluaisi päästä työskentelemään korjausrakentamisen parissa? Haemme SATOon vakituista remonttimestaria. Uudessa tehtävässäsi Remonttimestarin tehtävä pitää sisällään korjausrakentamisen eri tehtäviä. Yleisimpänä tehtävänä ovat asuntokorjaukset sisältäen purku-, maalaus- sekä laminaatin asennustöitä. Tehtäviin kuuluu kuitenkin myös erilaiset kiinteistökorjaukset, kuten rappukäytävämaalaukset, talosaunaremontit yms. Edellytämme remonttimestarilta aikaisempaa työkokemusta vastaavista remonttitöistä. Työt tullaan suorittamaan pääkaupunkiseudulla ja työntekijä saa käyttöönsä SATOn tarjoamat työkalut, työvaatteet sekä pakettiauton. Työaika on 37,5 h viikossa ja työt tehdään arkisin klo 6-18 välisenä aikana. Toivomme sinulta Kokemusta korjausrakentamisesta Rakennusalan perustutkintoa Omatoimisuutta sekä ongelman ratkaisukykyä Hyviä vuorovaikutus- ja yhteistyötaitoja Motivoitunutta asennetta B-ajokorttia Tervetuloa tiimiin \" Meillä on yrityksessä vahva yhteishenki ja matala hierarkia. Saat aina apua haastaviin tilanteisiin ja yhdessä mietitään ratkaisuvaihtoehtoja. Työnantajana SATO on joustava ja työntekijät huomioiva. Tervetuloa tiimiin! \" - Terveisin Joni, tuleva esihenkilösi Kiinnostuitko? Hae paikkaa viimeistään 19.12.2025 . Käsittelemme hakemuksia jo hakuaikana. Tehtävä on toistaiseksi voimassa oleva ja alkaa heti sopivan henkilön löydyttyä. Mikäli haluat kysellä lisää tehtävästä tai työskentelystä SATOlla, olethan yhteydessä Joni Haveriseen, joni.haverinen@sato.fi tai puhelimitse 0201344327. Soittoajat ovat ke 10.12. ja 17.12. ja pe 12.12. klo 14-15. Tarkistamme tehtävään valittavalta henkilöltä luottotiedot ennen työsuhteen alkua. SATO SATOn remonttimestarina sinulla on säännöllinen työaika arkisin. Käytössäsi on näppärä työauto, jolla voit ajaa suoraan töistä kotiin ja takaisin. SATOssa on rento tekemisen meininki ja inhimillinen kulttuurimme näkyy ja tuntuu läpi koko organisaation. Yhteiset arvomme: rima rohkeasti korkealle, ihminen ihmiselle ja yhdessä onnistumisen ilo ovat läsnä arjessamme ja ohjaavat aidosti toimintaamme. SATO on tutkitusti hyvä työpaikka ja Suomen tunnetuin vuokra-asumisen brändi. Työsi tukena on valmentava esihenkilö ja 300 muuta sitoutunutta ja työstään innostunutta satolaista. Satolaisena saat käyttöösi kattavat henkilöstöedut: laajat työterveyspalvelut, vapaa-ajan tapaturmavakuutuksen ja lapsen sairastuessa hoitopalvelun yrityksen maksamana. Saat lisäksi lomailla SATOn mökeissä Himoksella ja Vuokatissa. Työturvallisuus on meille ensiarvoisen tärkeää ja työnantajana SATO pitää sinusta ja varusteistasi huolta. SATO on vastuullinen asuntosijoittaja ja yksi Suomen suurimmista vuokranantajista. Meillä on noin 27 000 vuokra-asuntoa ja 45 000 asukasta pääkaupunkiseudulla, Tampereella ja Turussa. Lue lisää SATOsta: sato.fi Sähköposti: rekrytointi@sato.fi Sijainti: Panuntie 4, 00601 Helsinki",
    "contact_name": null,
    "contact_email": "rekrytointi@sato.fi",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}