{
  "job": {
    "id": "61a8b1d743181183",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/jobgo-international-laatu-ja-tuotetietovastaava-sdsuu-19737507",
    "title": "Laatu- ja Tuotetietovastaava",
    "company": "JobGo International Oy",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 12.11.",
    "discovered_date": "2025-12-01T14:37:32.873231",
    "description": "Jobgo toimii Natrue Line Cutlery Ou:n rekrytointikumppanina tässä haussa.NATURE LINE CUTLERY OY Lisätietoja Nature Line Cutlery: https://natureline.fi/ YLEISTÄ TYÖTEHTÄVÄSTÄ (Toimipisteenä joko Helsinki tai Outokumpu) Laatu- ja tuotetietovastaavan rooli on keskeinen yrityksen toimintajärjestelmän hallinnassa ja kehittämisessä. Työn tarkoituksena on varmistaa, että yrityksen laatujärjestelmä, standardit ja ohjeistukset ovat ajantasaisia ja yrityksen johdon ja henkilöstön jokapäiväisessä käytössä. Lisäksi henkilö vastaa yrityksen tuotetietojen lainmukaisuudesta sekä ajantasaisuudesta eri markkinoiden käyttämissä järjestelmissä (esim. GS1 ja Validoo jne.) ja markkinointimateriaaleissa sekä mm. rinki raportoinnista ja Suomalaisen työn liiton portaalin hallinnasta. Laatu- ja tuotetietovastaava työskentelee tiiviissä yhteistyössä yrityksen eri toimintojen kanssa ja toimii laatujärjestelmän koordinaattorina ja kouluttajana tiimeille. Henkilön työtehtävien voidaan olettaa kehittyvän yrityksen kasvun ja laajentumisen mukana tuomien tarpeiden mukaisesti. Nature Line Cutlery Oy:n Laatu- ja tuotetietovastaavan esimiehenä toimii yrityksen toimitusjohtaja. TYÖN TARKOITUS Laatu- ja tuotetietovastaavan tehtävänä on varmistaa, että yrityksen laatu- ja toimintajärjestelmä tukee liiketoiminnan tavoitteita, vastaa voimassa olevia standardeja ja toimii käytännönläheisenä työkaluna organisaation jokapäiväisessä toiminnassa. Tehtävän tarkoituksena on ylläpitää ja kehittää yrityksen laadunhallinnan prosesseja sekä varmistaa, että kaikki tuotetiedot ovat oikeellisia, lainmukaisia ja ajantasaisia yrityksen sisäisissä järjestelmissä sekä eri markkinoiden tuotetietopankeissa. Rooli on keskeinen linkki laadun, tuotetiedon, tuotekehityksen ja markkinoinnin välillä, ja se tukee yrityksen vastuullisuus- ja kasvutavoitteita. Key responsabilities Ylläpitää, kehittää ja päivittää yrityksen toimintajärjestelmää ja laatuohjeistoja. Suunnittelee ja johtaa sisäisiä ja ulkoisia auditointeja sekä huolehtii auditointien dokumentoinnista ja toimenpiteiden seurannasta. Toimii yrityksen laatujärjestelmän koordinaattorina ja henkilöstön kouluttajana. Osallistuu laadun kehittämishankkeisiin ja prosessien jatkuvaan parantamiseen. Vastaa tuotetietojen oikeellisuudesta, ajantasaisuudesta ja lainmukaisuudesta kaikilla markkina- alueilla. Hallinnoi ja päivittää tuotetietoja sisäisissä järjestelmissä sekä ulkoisissa tuotetietopankeissa (esim. GS1, Suomalaisen Työn Liitto, Validoo). Huolehtii tuotetietojen oikeellisuudesta markkinointimateriaaleissa ja varmistaa, että pakkaus- ja tuoteselosteet täyttävät viranomaisvaatimukset. Vastaa yrityksen tuotteiden testausprosessien koordinoinnista yhteistyökumppaneiden kanssa. Laatii ja ylläpitää tuotetietoihin liittyviä raportteja ja ilmoituksia (mm. EUDR-, Rinki- ja vastuullisuusraportointi). Tekee tiivistä yhteistyötä tuotekehityksen, markkinoinnin, myynnin ja tuotannon kanssa uusien tuotteiden suunnittelun ja lanseerauksen yhteydessä. Osallistuu tuotekehitysprosessin laadunvarmistukseen ja varmistaa uusien tuotteiden lainmukaisuuden ennen markkinoille vientiä. Tukee yrityksen kasvua ja strategisia tavoitteita laadun ja tuotetiedon hallinnan näkökulmasta. Suorittaa muita esimiehen määräämiä tehtäviä yrityksen tarpeiden mukaisesti. Skills and qualifications Soveltuva korkeakoulututkinto (esim. elintarvike-, kemian-, tuotantotalouden, tai prosessitekniikan alalta) tai vastaava työkokemuksen kautta hankittu pätevyys. Kokemusta laatujärjestelmien hallinnasta ja kehittämisestä (esim. ISO 9001 tai vastaavat standardit) Ymmärrystä tuotetiedon hallinnasta, lainsäädännön seuraamisesta ja tuotetietopankeista (GS1, Validoo, Rinki ym.). Hyvät yhteistyö- ja vuorovaikutustaidot sekä kyky toimia eri sidosryhmien kanssa. Erinomainen organisointikyky, tarkkuus ja systemaattinen työote. Hyvä suomen ja englannin kielen taito; ruotsin kielen osaaminen katsotaan eduksi. Kokemus tuotekehitys- tai valmistavan teollisuuden toimintaympäristöstä on etu. What we offer Mahdollisuus vaikuttaa suoraan yrityksen laatu- ja vastuullisuusstrategiaan Työ innovatiivisessa ja kestävää kehitystä arvostavassa yrityksessä Keskeinen strateginen rooli ja suora raportointiyhteys toimitusjohtajaan Työskentely vastuullisten tuotteiden parissa, jotka vähentävät kertakäyttömuovin käyttöä Lisätietoja tehtävästä antaa JobGo rekrytointikonsultti Fredrik Sundell spostilla fredriksundell@jobgo.com tai puh 0405103161.",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "IT"
  ],
  "category": "Low Priority"
}