{
  "job": {
    "id": "cf720d27bb90e2c8",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/ham-helsingin-taidemuseo-kokoelmapaallikko-sdsuu-19754560",
    "title": "Kokoelmapäällikkö",
    "company": "HAM Helsingin taidemuseo",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 28.11.",
    "discovered_date": "2025-12-01T14:35:57.425641",
    "description": "HAM Helsingin taidemuseo on yksi Suomen ja pohjoismaiden merkittävimmistä taidemuseoista, joka katsoo tulevaisuuteen ja joka etsii kaikissa toiminnoissaan tapaa olla merkityksellinen yleisöilleen. HAMilla on laaja kansainvälinen näyttelytoiminta sekä n.11 000 taideteoksen kokoelma, joka pitää sisällään Helsingin kaupungin julkisen taiteen kokoelman. HAM vastaa Helsingin taidekokoelmasta, tilaa uusia julkisia taideteoksia sekä hankkii kotimaista ja kansainvälistä taidetta. HAM vastaa myös nykytaidetapahtuma Helsinki Biennaalin tuotannosta ja Uudenmaan alueen alueellisesta taidemuseotehtävästä. HAMin henkilöstö ja toiminta siirtyivät 1.1.2023 alkaen säätiöön, joka on osa Helsingin kaupunkikonsernia. Haemme HAM Helsingin taidemuseoon KOKOELMAPÄÄLLIKKÖÄ toistaiseksi voimassa olevaan työsuhteeseen 2.2.2026 alkaen tai sopimuksen mukaan. Tehtävänäsi on johtaa ja kehittää HAMin kokoelmatoiminnan kokonaisuutta. HAMin johtoryhmän jäsenenä osallistut koko organisaation strategiseen kehittämiseen, erityisalanasi kokoelmatoiminta ja sen erityispiirteet. Tehtävässäsi vastaat yhdessä taidemuseon johtajan ja kokoelmayksikön asiantuntijoiden kanssa kokoelmiin liittyvien taiteellisten sisältöjen konseptoinnista ja kuratoinnista, taidehankinnoista, kokoelmien talletustoiminnasta, kokoelmien ylläpidosta sekä kokoelmahallinnasta. Edustat HAMia kokoelmiin liittyvissä kansainvälisissä ja kotimaisissa yhteyksissä ja kehität kokoelmiin liittyvää yleisösuhdetta sekä osallistut Helsinki Biennaalin kehittämiseen kokoelmatoiminnan osalta. Johdat kokoelmayksikön asiantuntijoita ja toimit myös aluetaidemuseotoiminnasta ja vastuullisuustyöstä vastaavan erityisasiantuntijan esihenkilönä. Sinulla on: tehtävään soveltuva ylempi korkeakoulututkinto vahvaa asiantuntijuutta ja kokemusta taidemuseon kokoelmatoiminnan kehittämisestä osaamista ja kiinnostusta kehittää taidekokoelmien yleisösuhdetta kehittävä ja kansainvälinen työote kokemusta ja osaamista valmentavasta ja tavoitteellisesta esihenkilötyöstä kokemusta budjetin hallinnasta ja hallinnon prosesseista Sinulla on vahvat vuorovaikutustaidot ja tiedät, kuinka sitouttaa henkilöstö ja sidosryhmät kohti yhteisiä päämääriä. Sinulla on ymmärrystä ja osaamista digitaalisuuden mahdollisuuksista kokoelmatoiminnasta. Talousosaaminen ja projektiosaaminen ovat välttämättömiä ominaisuuksia työn menestyksellisessä hoitamisessa. Viestit erinomaisesti sekä suullisesti että kirjallisesti englannin kielellä, lisäksi sinulla on vähintään tyydyttävä suomen kielen taito. Arvostamme ratkaisukeskeistä otetta työhön, hyviä organisointi- ja yhteistyötaitoja, paineensietokykyä, joustavuutta ja sosiaalista tilannetajua. Tarjoamme sinulle mahdollisuuden työskennellä osaavassa ja innostavassa työyhteisössä. Tehtävässä on mahdollisuus työskennellä joustavien työaikojen puitteissa ja saat käyttöösi ePassin lounas- ja työmatkaedun sekä kulttuuri- ja liikuntaedun. Tehtävästä maksettava peruspalkka on 4746,51 €/kk. Tehtävään valittavan tulee läpäistä perusmuotoinen turvallisuusselvitys. Mikäli kiinnostuit paikasta joukossamme, lähetä hakemuksesi 7.12.2025 mennessä osoitteeseen rekry@hamhelsinki.fi . Liitä mukaan vapaamuotoinen hakemus sekä CV ja otsikoi viestisi: HAKEMUS, kokoelmapäällikkö, oma nimesi. Nimeä myös liitteet siten, että niissä näkyy nimesi. Arvostamme monimuotoista ja yhdenvertaista työyhteisöä ja toivomme saavamme hakemuksia monenlaisilta ja monipuolisista taustoista tulevilta henkilöiltä. Lisätietoja tehtävästä antaa museonjohtaja Arja Miller puh. +358 50 3361980, soittoaika 21.11. klo 14-16:30.",
    "status": "new",
    "notes": ""
  },
  "score": 20.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "IT"
  ],
  "category": "Low Priority"
}