{
  "job": {
    "id": "eb3c0371afcbd73b",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/erp-arkkitehti-sgsof-19277879",
    "title": "ERP-arkkitehti",
    "company": "Gofore",
    "location": "Helsinki ja 2 muuta –",
    "posted_date": "Julkaistu 6.5.",
    "discovered_date": "2025-12-01T14:39:42.917845",
    "description": "Gofore on kansainvälinen digitaalisen muutoksen konsulttiyhtiö. Meillä on lähes 1 800 asiantuntijaa kaikkiaan 23 kaupungissa Suomessa, Saksassa, Itävallassa, Tšekissä, Virossa ja Espanjassa. Teknologian ja liiketoiminnan asiantuntijamme rakentavat toimivaa, turvallista ja yhdenvertaista digitaalista yhteiskuntaa palveluineen sekä kestäviä älykkään teollisuuden ratkaisuja. Monimuotoista osaajajoukkoamme yhdistävät pioneerihenkisyys sekä halu luoda inhimillisempää ja vastuullisempaa digimaailmaa. Toimintaamme ohjaavat vahvat arvomme: olemme jokaiselle hyvä työpaikka, ja elämme asiakkaidemme onnistumisista. Liikevaihtomme vuonna 2024 oli 186,2 miljoonaa euroa. Gofore Oyj:n osake on listattu Nasdaq Helsinki Oy:ssä. Visiomme on olla merkittävin eurooppalainen digitaalisen muutoksen asiantuntijayritys. Lisätietoja Goforesta työnantajana löydät halutessasi liity joukkoon- ja kulttuurisivuiltamme . Haemme kokeneita yritys- ja integraatioarkkitehteja suunnittelemaan ja rakentamaan asiakkaidemme liiketoiminnan ydinprosesseja tukevia järjestelmiä (mm. ERP, CRM, MES, PLM). Asiakkaidemme projektit ovat merkittäviä sekä monipuolisia ja pitkäkestoisia, joissa pääset soveltamaan laaja-alaisesti osaamistasi. Goforen ERP-projekteissa sinulla on merkittävä rooli liiketoimintaprosessien digitalisoinnissa, suunnitellen ja johtaen kehitystyötä, mahdollistaen järjestelmien sujuvan yhteispelin ja vieden eteenpäin strategisia ratkaisuja. Arkkitehdin rooli on keskeinen erityisesti ERP-uudistusten alkuvaiheen selvitysten ja suunnitelmien tekijänä sekä toteutusprojektien integraatiosuunnittelussa. Tehtävästä Goforen ERP-arkkitehtina suunnittelet ja toteutat ERP-järjestelmien kokonaisarkkitehtuuria varmistaen, että liiketoiminnan kokonaisprosessit toimivat saumattomasti ja integraatiot liiketoimintajärjestelmien välillä toimivat tarkoituksenmukaisesti. Lisäksi rakennat järjestelmäkentän kehitysroadmappiä ja muutoksenhallintaa sekä tuet organisaatiota uusien toimintatapojen omaksumisessa. Mitä odotamme sinulta: Vähintään viiden vuoden vahvaa kokemusta ERP-arkkitehtuureista ja niiden toteuttamisesta - olet suunnitellut, rakentanut ja/tai kehittänyt ERP-järjestelmiä kokonaisvaltaisesti, ja ymmärrät, miten ne integroituvat organisaation muihin järjestelmiin ja prosesseihin. Syvällistä näkemystä ERP-teknologioista , kuten SAP tai Microsoft Dynamics - hallitset järjestelmien teknisen rakenteen lisäksi myös liiketoimintasovellukset, konfiguroinnin periaatteet, parhaat käytännöt sekä osaat arvioida, miten järjestelmät palvelevat eri liiketoimintaprosesseja tehokkaasti. Arkkitehtuurikokemuksesi ansiosta sinulla on kyky hahmottaa laajoja ERP-teknologiakokonaisuuksia ja suunnitella sekä ohjata niiden hankintaa ja toteutusta. Olet toiminut keskeisessä roolissa ratkoessasi monimutkaisia teknisiä ja toiminnallisia haasteita monitoimijaympäristössä. Kykyä jäsentää ja haastaa liiketoiminnan kokonaisprosessien kehittämistä - sinulla on kokemusta organisaation prosessien läpikäymisestä yhdessä liiketoimintayksiköiden kanssa ja olet pystynyt tunnistamaan kehityskohteita sekä ohjaamaan teknologisia ratkaisuja tukemaan liiketoiminnan tavoitteita. Näyttöjä muutoksenhallinnasta ja organisaation tukemisesta teknologiamurroksessa - olet ollut mukana järjestelmäuudistuksissa tai ERP-transformaatioissa, joissa olet tukenut organisaation henkilöstöä, viestinyt muutoksesta ja edistänyt sitoutumista uuteen toimintamalliin Kokemusta sekä yleisistä että toimialakohtaisista ERP-prosesseista ja -ratkaisuista , esimerkiksi valmistavassa teollisuudessa, telecomissa tai julkishallinnossa. Ymmärrät, miten prosessit rakentuvat ja missä niiden erityispiirteet korostuvat. Tuntemusta ERP:ien keskeisistä liitännäisjärjestelmistä , kuten CRM, MES tai PLM ja niiden roolista osana laajempaa kokonaisarkkitehtuuria. Erinomaisia vuorovaikutus- ja yhteistyötaitoja - osaat toimia eri sidosryhmien kanssa, viestiä selkeästi teknisistä ja ei-teknisistä asioista sekä johtaa tiimejä ja projekteja tavoitteellisesti. Asiakaslähtöistä asennetta sekä valmiutta joustaa asiakasprojektien tarpeiden mukaisesti myös työnteon paikan ja tavan osalta. Mitä tarjoamme sinulle Hyvinvoivat työntekijät ja sujuvan arjen luominen ovat Goforen ydin. Haluamme olla työyhteisö jossa työn tekeminen on innostavaa, palkitsevaa ja ammatillista osaamista kasvattavaa. Maineemme laadukkaiden palveluiden tuottamisessa asiakkaillemme on yksinomaan huippuasiantuntijoidemme ansiota. Asiakastyytyväisyys on meille tärkeää ja NPS:mme onkin korkea, 62 (2025). Goforelaiset saavatkin erityisen hyvää palautetta asiakaslähtöisestä asenteesta. Työntekijätyytyväisyytemme perustuu tutkitusti osaavaan yhteisöön ja yhdessä tekemiseen. Olemme ylpeitä läpinäkyvästä toimintakulttuuristamme, pioneerihenkisyydestämme sekä siitä että olemassaolollamme on suurempi tarkoitus kuin pelkästään voiton tuottaminen - pyrkimys inhimillisempään, kestävämpään ja eettisempään digimaailmaan ja työelämään. Meillä pääset osaksi yhteisöä jossa olet lähellä oman osaamisalueesi muita osaajia ja samalla läheisesti töitä tehden toisten huippuosaajien kanssa asiakasprojektissa. Olemme organisoituneet asiakaslähtöisesti, mikä mahdollistaa yksilö- ja tiimionnistumisten näkyväksi tekemisen ja oman osaamisen kasvattamisen vaikkapa toimiala edellä. Goforelaisten yhteisöllisyys ulottuu myös työn ulkopuolelle erilaisten aktiviteettien kuten toimistotapahtumien, lautapelien ja perhepäivien muodossa. Jotta työ ja vapaa-aika löytäisivät tarvitsemasi tasapainon, tarjoamme sinulle joustavat työskentelyolosuhteet ja työvälineet, jotka saat valita tarpeidesi mukaan. Edellä mainittujen lisäksi meillä on kattavat etuudet . Goforella on käytössä oma, tekijöidemme näköinen työehtosopimus. Voit tutustua siihen täällä . Palkkakehitys ja rekrytointiprosessimme Meille Goforella on tärkeää, että työstä maksetaan kunnollinen kokonaiskorvaus. Palkkaan vaikuttaa paitsi kokemus ja taidot, myös kaksi arvoamme: aktiiviset toimet sen eteen että Gofore on hyvä työpaikka kaikille sekä asiakasnäkökulman huomioiminen kaikessa tekemisessä. Oman esihenkilön kanssa käytävissä palkkakeskusteluissa keskeistä on saamasi palaute, laskutusaste (olemmehan konsultteja!) sekä oman osaamisen kehittäminen. Arkkitehtina peruskuukausipalkkasi on noin 5000-6000 €, minkä lisäksi saat bonusta kuukausittaiseen laskutusasteeseesi perustuen. Meillä on käytössä myös yrityksen menestykseen liittyviä erillisiä bonuksia, jotka voivat liittyä esimerkiksi rekrytointiin, myyntiin tai Goforen tunnettuuden kasvattamiseen. Lisätietoja Lisätietoja saat Juha Siltaselta (Head of Service Area, ERP) ja tavoitat hänet parhaiten sähköpostilla juha.siltanen@gofore.com Huomioimme mielellämme neurodiversiteetin vaatimukset rekrytointiprosessissa ja tarvittaessa muokkaamme prosessia tarpeidesi mukaisesti. Näin rekrytointi Goforella etenee: https://gofore.com/rekrytointi-goforella/",
    "status": "new",
    "notes": ""
  },
  "score": 20.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "IT"
  ],
  "category": "Low Priority"
}