{
  "job": {
    "id": "30203e27cbaa2295",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/solution-analyst-vakuutuksen-korvausjarjestelma-gw-claims-center-sospp-19761782",
    "title": "Solution Analyst, vakuutuksen korvausjärjestelmä (GW Claims Center)",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 18.11.",
    "discovered_date": "2025-12-01T14:35:57.425351",
    "description": "Etsimme vakituiseen työsuhteeseen Helsinkiin tai Ouluun Solution Analystiä. Kansainvälinen tiimimme kehittää yhdessä useamman tiimin kanssa Guidewire Claim Centeriä, eli vakuutuksen korvausjärjestelmää. Tiimimme vastaa korvausjärjestelmän kehittämisestä. Toivomme uudelta Solution Analystiltämme ymmärrystä korvauskäsittelystä ja korvauskäsittelyn prosesseista sekä kokemusta Guidewiren ClaimCenterin vaatimusmäärittelystä. Tehtävästä Solution Analystina tulet toimimaan liiketoiminnan ja ohjelmistokehittäjien rajapinnassa, varmistaen että liiketoiminnan puolelta nousevat kehitystarpeet muuntuvat ohjelmistokehittäjille ymmärrettäviksi vaatimusmäärittelyiksi. Vastaat siis alueesi kehitystarpeiden tunnistamisesta, analysoinnista ja kuvaamisesta yhdessä sidosryhmien ja tiimisi asiantuntijoiden kanssa. Olet mukana miettimässä kehitettävän kokonaisuuden ratkaisua prosessilähtöisesti tietomallitarpeet ja ClaimCenterin toiminnallisuudet huomioiden. Näiden pohjalta luot tarvittavia kuvauksia ja dokumentoit toiminnallisia vaatimuksia. Liiketoiminnan tarpeiden lisäksi pohdit kriittisesti ja ratkaisuhakuisesti mikä on regulaation, teknisen toteutuksen ja liiketoimintaprosessien kannalta järkevin kehittämisen toteutustapa. Keräät ja havainnoit kehitystarpeita käymällä aktiivista keskustelua monien sisäisten sidosryhmien kanssa. Olennainen osa työnkuvaasi on näiden keskusteluiden fasilitoiminen esimerkiksi työpajojen muodossa. Millaista osaamista etsimme? Sinulla on vahvaa aiempaa kokemusta vaatimusmäärittelytyöstä ja olet tehnyt päätoimisesti vaatimusmäärittelyä vähintään kolmen vuoden ajan. Kokemus Guidewiren ClaimCenterin parissa työskentelystä katsotaan eduksi. Kykenet siis itsenäisesti määrittämään, tuottamaan ja kuvaamaan liiketoiminnan tarpeita kehitettäviksi ominaisuuksiksi ja kokonaisuuksiksi Guidewiren standarditoiminnallisuudet huomioiden. Vaatimusmäärittelykokemuksen lisäksi etsimme osaajia seuraavanlaisella osaamispaletilla: aiempi liiketoimintakokemus vakuutuksen korvausjärjestelmien parissa työskentelystä. tekninen osaaminen ja ymmärrys, jonka avulla ymmärrät Guidewire-teknologian kehittämistä. hallitset ketteriä menetelmiä ja työkaluja. sujuvat kommunikointi- ja viestintätaidot sekä suomeksi että englanniksi. ihmisenä kestät paineiden alla työskentelyä (välillä joitain asioita vaan pitää saada tietyssä ajassa ratkottua), ja turnauskestävyyttäkin sinulta löytyy (näin suurissa uudistuksissa kun harva iso kokonaisuus ratkeaa viikossa tai kahdessa). merkittäväksi eduksi katsomme, jos sinulla on vaatimusmäärittelykokemusta Guidewiren Claim Centerin osalta. Me tarjoamme Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme, johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Sinulla on mahdollisuus kehittää osaamistasi suorittamalla esimerkiksi Guidewire ACE tai Professional BA ClaimCenter sertifikaatit. Lisätiedot ja hakuohjeet Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään perjantaina 05.12 mennessä. Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Lisätietoja tehtävästä ja meillä työskentelystä antaa tarvittaessa Product Owner, Linda Valenius p. 040 746 6132 tai Product Owner Maarit Rinta-Keturi p. 044 307 1527 Soittoajat: Maarit Keskiviikkona 19.11 klo 14-15, Torstai 27.11 klo 14-15 Linda Perjantai 21.11 ja 28.11 klo 12-13 Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat, teetetään huumausainetesti sekä Suojelupoliisin teettämä perusmuotoinen turvallisuusselvitys. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "API",
    "IT"
  ],
  "category": "Review"
}