{
  "job": {
    "id": "862770183856694a",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/senior-product-owner-vahinkovakuutuksen-yritysasiakkaiden-jarjestelmakehitys-sospp-19778246",
    "title": "Senior Product Owner, Vahinkovakuutuksen yritysasiakkaiden järjestelmäkehitys",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 24.11.",
    "discovered_date": "2025-12-01T14:37:32.871751",
    "description": "Haemme Senior Product Owneria Pohjola vakuutuksen vahinkovakuutuksen yritysasiakkaiden liiketoiminnan käytössä olevien vakuutusjärjestelmien kehittämiseen (policy center). Pohjola vakuutuksessa on käynnissä muutosmatka uudelle järjestelmäalustalle eri palvelukanavissamme. Tehtävä sijaitsee Helsingissä tai Oulussa. Arjessa yhdistämme joustavasti lähi- ja etätyöskentelyä OP Pohjolan periaatteiden mukaisesti. Tehtävästä Tässä tehtävässä vastuullasi on nykyisten vakuutusjärjestelmien kehityksen ohjaus, priorisointi ja elinkaaren hallinta omaisuuden- ja henkilövakuuttamisen alueella. Lisäksi toimit tärkeänä linkkinä vakuutuksen muutoksessa tapahtuvissa konversioissa, jossa siirrymme määrätietoisesti uudelle keskitetylle järjestelmäalustalle. Product Ownerina kehität toimintatapoja sekä maksimoit tiimisi tuottaman asiakasarvon priorisoiden kehittämisen sisältöä. Roolissa ohjaat tiimin prioriteetteja lyhyellä ja keskipitkällä aikavälillä liittyen sekä kehitykseen että tiimin operatiiviseen toimintaan, ottaen huomioon kaupalliset-, tekniset- ja regulatoriset vaatimukset. Päivittäisenä apunasi on tiimin lisäksi muita teknisiä rooleja kuten Tech Lead teknologia-arkkitehtuurissa ja Service Product Owner tuotannon koordinoinnissa. Toimit tärkeänä linkkinä liiketoiminnan tiimien ja kehitystiimien välillä. Millaista osaamista etsimme? Etsimme kokenutta Product Owneria seuraavin edellytyksin: Vahinkovakuutuksen liiketoiminta on sinulle tuttua Sinulla on vankkaa aiempaa kokemusta Product Owner tyylisestä kehittävästä roolista, ja erilaiset ohjelmistotuotannon prosessit ja menetelmät ovat sinulle tuttuja Sinulla on kokemusta toimivan monikansallisen tiimin toiminnasta ja arjen pyörittämisestä, jossa jokainen jäsen viihtyy ja kokee saavansa arvostusta. Omaat kokemusta isokone-pohjaisten (mainframe) järjestelmien kehittämisestä Koet olevasi parhaimmillasi liiketoiminnan ja teknologiakehityksen välimaastossa osaten priorisoida tekemisiä, niin kaupallisten tavoitteiden kuin sidosryhmävaatimusten suhteen. Ymmärrät ja osaat suunnitella selkeitä usean eri sidosryhmän liiketoimintalähtöisiä järjestelmäkehittämisen suunnitelmia (roadmappeja). Viestit luontevasti suomeksi ja englanniksi, niin suullisesti kuin kirjallisestikin. Me tarjoamme Olemme yksi Suomen suurimpia ohjelmistotaloja. Liittymällä joukkoomme pääset osaksi ryhmän Kehittäminen ja teknologiat -organisaatiota. Organisaatiomme kehittää digitaalisia palveluita ja järjestelmiä asiakkailleen sekä omalle henkilöstölleen. Olemme vastuussa OP Pohjolan ICT-strategiasta, teknologialinjauksista, arkkitehtuurista, yhteisistä alustoista, infrastruktuurista, jatkuvuudenhallinnasta sekä koko ryhmän kyberturvallisuudesta. Alueella työskentelee yhteensä 5000 omaa ja kumppaneidemme IT-ammattilaista. Meille on tärkeää, että jokaisen on mahdollista kehittyä työn kautta, ja tässä sinua tukevat sekä kollegasi että esihenkilösi - et tule jäämään yksin. Tekemiselläsi ja asenteellasi pystyt vaikuttamaan omaan urapolkuusi meillä, tuemme sinua kehittymisessäsi ja kannustamme rohkeasti eteenpäin. Meillä on paljon erilaisia uramahdollisuuksia, halusit sitten edetä urallasi vertikaalisesti tai horisontaalisesti.  Meillä on käytössä ns. 70-20-10 -periaate, mikä tarkoittaa, että käytät 70 % ajastasi päivittäisiin tehtäviin, 20 % työskentelytapojen hiomiseen ja viimeiset 10 % vapaasti uusien taitojen oppimiseen. Tämän osuuden voit käyttää esimerkiksi meidän omassa OP Tech Academyssa, jossa voit laajentaa osaamistasi monella eri osa-alueella. Kyllä, voit siis laajentaa osaamistasi työajalla! Elämä on kuitenkin paljon muutakin kuin työtä. Meille on tärkeää, että työ ja vapaa-aika kulkevat rinnakkain ja työnantajana olemme valmiita joustamaan elämän eri tilanteissa. Saat käyttöösi monipuoliset henkilöstöetumme, johon kuuluvat henkilöstörahasto sekä henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Lisätiedot ja hakuohjeet Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään 4.1.2026 .Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Lisätietoja tehtävästä ja meillä työskentelystä antaa Competence Lead Tiina Mäntykangas +358 443264397 8.12. klo 12-13 ja 15.12. klo 10-11. Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat, teetetään huumausainetesti sekä Suojelupoliisin teettämä perusmuotoinen turvallisuusselvitys. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "status": "new",
    "notes": ""
  },
  "score": 65.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "senior",
    "lead",
    "IT"
  ],
  "category": "Review"
}