{
  "job": {
    "id": "0f3b82e0746c2180",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/project-manager-new-product-introduction-scsom-19759445",
    "title": "Project Manager, New Product Introduction",
    "company": "GE HealthCare",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 17.11.",
    "discovered_date": "2025-12-01T14:38:30.080185",
    "description": "Job Description Summary GE Healthcare, a leading global health technology provider, has strong presence in Helsinki. In the Vallila district, we are 700+ people from 32 countries, helping healthcare providers improve patient care. We are looking for a passionate Project Manager with good experience and passion of leading product development projects from design to manufacturing. You will lead and support cross-functional teams in developing and releasing our next generation patient monitoring products and systems. Job Description Roles and Responsibilities Lead a cross-functional product development team from design phase to product manufacturing, ensuring that the program meets quality, regulatory, customer and business needs, in close collaboration with Program Manager and other stakeholders. Manage cross-functional dependencies to maximize team's efficiency and avoid gaps/delays in execution. Support, motivate and lead the team through various challenges. Facilitate team activities in finding efficient ways of mitigating program risks. Create and maintain program development plans/schedules and represent the team to the upper management with program metrics and reports. Interact seamlessly and efficiently in a cross-functional, multi-cultural, global environment. Required Qualifications Bachelor's Degree in Computer Science, Engineering or Technology. Experience in project management of developing complex engineering products including software and hardware through the whole product development life cycle. Solid technical know-how to work with patient monitor technologies (electronics, mechanics, embedded SW, wireless, cybersecurity, materials, standards, testing, manufacturing). Self-starter, quick learner with demonstrated engineering curiosity and problem-solving skills. Ability to produce good, concise technical documentation and detailed project plans. Strong communication skills. Fluent in English, both written and oral. Legally authorized to work in Finland and willing to work in our Helsinki office full-time. Desired Characteristics Master's Degree in Computer Science, Engineering or Technology. Leading product development experience in highly regulated businesses (like medical). Experience with HW development, manufacturing and suppliers management, Agile SW development, standards requirements and compliance testing, regulatory submissions. Experience in leading teams and projects, facilitating teams' activities and driving to decisions and conclusions. Experience in starting and leading change improvements initiatives. What We Offer Work for a great purpose - your work will save people's lives! Great opportunity to learn and develop leading edge technologies. Pair work with and learn from world's best experts in the industry. Grow your technical know-how, skills, and abilities to support future roles in the organization. Work in a diverse multicultural environment. Flexible working hours scheme in a hybrid mode (remote and in the office). Office near Pasila railway station in central Helsinki with own on-site parking, gym, great café, and lunch restaurant. Competitive compensation package. Inclusion and Diversity GE HealthCare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Behaviours We expect all employees to live and breathe our behaviors: to act with humility and build trust; lead with transparency; deliver with focus, and drive ownership - always with unyielding integrity. Total Rewards Our total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you'd expect from an organization with global strength and scale, and you'll be surrounded by career opportunities in a culture that fosters care, collaboration, and support. #LI-KP3 Additional Information Relocation Assistance Provided: No",
    "status": "new",
    "notes": ""
  },
  "score": 90.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "project manager",
    "documentation",
    "agile",
    "project management",
    "lead",
    "manager",
    "software",
    "IT"
  ],
  "category": "High Priority"
}