{
  "job": {
    "id": "12aa7487c2623dff",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/technical-architect-finland-sdsuu-19784396",
    "title": "Technical Architect (Finland)",
    "company": "IONA",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 26.11.",
    "discovered_date": "2025-12-01T14:36:16.758846",
    "description": "We are IONA, an award-winning ecommerce consultancy with headquarters in Helsinki, Finland. Our team operates across Finland, the UK and the Philippines. When you join IONA, you’ll become part of a global team of 50+ professionals delivering next-generation composable commerce solutions for clients like Marimekko, Harvia, Lappset, Vaisala and Berner. We work with modern, API-first and microservices-based solutions and are proud to be a MACH-certified partner. In August, IONA was once again named one of Finland’s fastest-growing companies (Witted Insights). Growth is in our DNA – and we need you to help us take the next leap! What is this role like? This full-time position is central to our project delivery and client success. As our Technical Architect (Commerce Solutions), you’ll help turn big ideas into real, scalable results. You will work closely with our clients, taking the lead in understanding their goals and turning those goals into practical, reliable systems that support their business. You will shape technology choices and collaborate with the sales team to design solutions that meet real client needs. You will also mentor our globally distributed developers, leading their work on client projects. We're looking for someone with a strong technical background and excellent communication skills – someone who can clearly present complex concepts to both technical and non-technical audiences. The ideal candidate combines a business-oriented mindset with a passion for hands-on coding. Our office is based in Helsinki and we offer hybrid work arrangements. Your key responsibilities include: Architectural leadership: Leading architectural decisions for large-scale, public-facing ecommerce solutions. Strategy and definition: Defining and refining software architecture in line with business needs and technical implementation, while supporting sales efforts. Cloud and DevOps: Driving cloud architecture strategies and ensuring optimal use of AWS, Azure, Vercel and other platforms for scalability, resilience and security. Quality and mentoring: Championing best practices in automated testing, CI/CD and security. Advisory role: Acting as a trusted technical advisor for stakeholders – effectively communicating and \"selling\" technical solutions. Presales support: present complex architectural solutions clearly and persuasively to clients. What would make you a great fit? To thrive in this position, you should have: Experience as a solutions architect for enterprise-scale, public-facing projects. Expertise in microservices, headless frontend/backend architecture, performance optimisation and security. Hands-on understanding of data engineering and modeling within e-commerce. Proven technical leadership and pre-sales experience. A track record of effective client and stakeholder engagement. Strong communication and collaboration skills in both Finnish and English. Bonus points if you have: Experience with specific ecommerce platforms like commercetools. Familiarity with PIM systems (e.g. Bluestone PIM), headless CMS platforms like Sanity or Contentful and ERP integrations. A background in mentoring and guiding technical teams toward architectural excellence. What's in it for you? At IONA, we value continuous improvement and acting with integrity and professionalism in everything we do. Our supportive environment emphasises teamwork and looking out for one another as we tackle challenges and celebrate milestones together. Step into one of the fastest-growing areas in digital commerce – composable commerce is transforming how leading brands build digital experiences! We offer: The monthly salary from 6500 € to 7500 €, depending on your expertise. A chance to join a Finnish consultancy on an international growth journey Professional growth and support – we welcome ambitious people who want to take responsibility, keep learning and succeed together with the team Comprehensive health benefits to keep you in top shape, including dental benefit Regular company breakfasts, afterworks and snacks to keep you energised Apply below by sending your CV and motivation letter with your salary request by Dec 14th. The first interview is with Talent Partner Emmi Vahvelainen, followed by a home assignment that you’ll present to our team. The final discussion is with our Head of Delivery Perttu Tiainen.",
    "status": "new",
    "notes": ""
  },
  "score": 90.0,
  "score_breakdown": {
    "positive_keywords": 100.0,
    "negative_keywords": -20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "software architect",
    "technical lead",
    "API",
    "backend",
    "frontend",
    "lead",
    "architect",
    "developer",
    "software",
    "IT"
  ],
  "category": "High Priority"
}