{
  "job": {
    "id": "19a57366efb587db",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/competence-lead-afc-development-sospp-19784071",
    "title": "Competence Lead, AFC Development",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 26.11.",
    "discovered_date": "2025-12-01T14:37:32.871514",
    "description": "Etsimme Competence Leadia OP Pohjolan Talousrikollisuuden torjunnan (TRT) heimoon AFC Developmentiin. Tehtävässä tulet olemaan avainroolissa TRT heimon kehitystehtävissä työskentelevän henkilöstön kehittämisessä. Tehtävä sijaitsee Helsingissä, mutta kuten muuallakin OP Pohjolassa yhdistämme arjessamme joustavasti lähi- ja etätyöskentelyä. Tehtävästä Competence Leadina toimit henkilövastuullisena esihenkilönä AFC Developmentissa työskenteleville asiantuntijoille, jotka työskentelevät mm. Business Developer, Business Analyst, Data Analyst sekä AFC alueen erityisissä asiantuntijarooleissa. Vastaat linjaesihenkilönä HR-vastuista ja suorituksen johtamisesta, jonka lisäksi huolehdit erinomaisesta työntekijäkokemuksesta, työhyvinvoinnista ja ammatillisen osaamisen kehittämisestä. Autat ihmisiä onnistumaan ja kehittymään urallaan sparraten ja tukien heitä. Osallistut koko AFC Developmentin osaamisen kehittämisen ja henkilöstösuunnittelun hankkeisiin ja tekemiseen. Competence Leadina raportoit AFC Developmentin Competence Area Leadille. Esihenkilöroolin lisäksi vastaat oman vastuualueesi rekrytoinneista yhteisen henkilöstösuunnitelman mukaisesti. Luot toimivan sisäisen ja ulkoisen verkoston, jolla varmistat oikean osaamisen hankinnan alueen toiminnallisien tiimien tarpeiden mukaisesti. Alueesi asiantuntijat työskentelevät AFC alueen järjestelmien ja prosessien kehittämisen parissa erilaisissa tehtävissä ja tiimeissä. Huolehdit, että vastuualueesi henkilöiden osaaminen kohtaa näiden alueiden tarpeet liiketoimintatavoitteiden saavuttamiseksi. Olet mukana työstämässä alueesi toimintatapoja ja toimit aktiivisesti muiden sidosryhmien kanssa. Kehität alueesi osaamista proaktiivisesti ja luot edellytyksiä parhaiden toimintatapojen systemaattiselle hyödyntämiselle sekä kehittämisen kulttuurin maturiteetin kasvattamiselle. Lisäksi vastaat osaltasi ketterän toimintamallin kehittämisestä ja muutosjohtamisesta. Alueesi asiantuntijoiden ja johdon lisäksi keskeisiä työkavereitasi ovat esimerkiksi alueen toinen Competence Lead, alueen Product Ownerit sekä AFC Services puolen Ops Leadit. Mitä edellytämme sinulta? Sinulla on kokemusta senior-tason liiketoiminta- ja teknisten asiantuntijatiimien johtamisesta sekä ihmisten motivoinnista. Olet ollut mukana toteuttamassa merkittäviä uudistuksia ja uskallat haastaa rakentavasti niin omaa tiimiäsi kuin sidosryhmiäsi. Olet helposti lähestyttävä ja valmentava esihenkilö. Hallitset ketterät kehittämismallit ja niitä tukevat tekniset menetelmät. Osaat johtaa ja verkostoitua monipuolisesti, ja sinulla on rekrytointikokemusta sekä riittävä liiketoiminnallinen ja tekninen ymmärrys. Roolin ydin on tavoitteiden selkeyttäminen ja suunnan näyttäminen. Sinulla on aito motivaatio asiantuntijaorganisaation valmentamiseen ja työntekijöiden kehittämiseen. Vuorovaikutustaitosi ovat vahvat; olet empaattinen, kannustava ja innostava. Kommunikoit sujuvasti suomeksi ja englanniksi. Me tarjoamme Pääset mukaan työyhteisöön, jossa ammattimainen toiminta, osaamisen kehittäminen, modernit työkalut ja aloitteellisuus ovat keskiössä. Toimit osaavan ja kannustavan tiimin tukemana ja saat arvokasta kokemusta muutosjohtamisesta sekä ammattilaisten osaamisen, työkalujen ja tiimiytymisen kehittämisestä. Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme , johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Kuulostaako sinun tulevalta rooliltasi? Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään 10.12.2025. Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Haethan mahdollisimman pian, sillä aloitamme hakemusten käsittelyn jo hakuaikana. Competence Area Lead Elina Tamminen antaa tehtävästä mielellään lisätietoja. Voit laittaa Elinalle sähköpostia elina.tamminen(a)op.fi tai soittaa numeroon 050 401 8884. Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat, teetetään huumausainetesti, Suojelupoliisin teettämä perusmuotoinen turvallisuusselvitys sekä ulkomaansidonnaisuuksien selvitys. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "status": "new",
    "notes": ""
  },
  "score": 85.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "business analyst",
    "product owner",
    "senior",
    "lead",
    "developer",
    "IT"
  ],
  "category": "High Priority"
}