{
  "job": {
    "id": "7c8ebfdf42a41902",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/director-consulting-expert-digital-channels-and-mobile-development-architecture-scsgi-19790601",
    "title": "Director Consulting Expert, Digital Channels, Mobile & Architecture",
    "company": "CGI Suomi",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 28.11.",
    "discovered_date": "2025-12-01T14:36:16.757028",
    "description": "Position Description: CGI on yksi suurimmista IT- ja liiketoimintakonsultoinnin yrityksistä Suomessa ja maailmalla. Vahva kokemuksemme eri toimialoilta auttaa julkisen ja yksityisen sektorin asiakkaitamme onnistumaan digitaalisessa muutoksessa ja saavuttamaan tavoitteitaan entistä tehokkaammin. Director Consulting Expert, Digital Channels, Mobile & Architecture Haluatko johtaa seuraavan sukupolven digitaalisten kanavien, erityisesti mobiiliratkaisujen, kehittämistä Suomen johtaville finanssialan toimijoille? Etsimme Director Consulting Expert -tason asiantuntijaa, jolla on vahva osaaminen mobiilikehityksestä, ohjelmistoarkkitehtuurista ja toimitusten johtamisesta. Tässä roolissa painopiste on toimitusten laadussa, moderneissa ohjelmistokehityskäytännöissä sekä kulttuurin rakentamisessa, jossa tiimit hyödyntävät AI-työkaluja koko kehityselinkaaren ajan suunnittelusta ja koodauksesta testaukseen, dokumentointiin ja julkaisuun. Vastuualueesi Johdat digikanavakehityksen toimituksia kokonaisvaltaisesti alusta loppuun ja varmistat, että ne toteutuvat laadukkaasti ja tehokkaasti. Huolehdit teknisestä laadusta, arkkitehtuurin johdonmukaisuudesta ja ratkaisujen skaalautuvuudesta. Ohjaat projektien ja jatkuvien palveluiden onnistunutta toteutusta sekä ylläpidät selkeää ja aktiivista viestintää asiakkaiden suuntaan, vastaten samalla toimitusodotusten hallinnasta ja asiakastyytyväisyydestä. Edistät AI-avusteisten työkalujen ja käytäntöjen hyödyntämistä kehityksessä, testauksessa ja laadunvarmistuksessa, ja tuet tiimejä niiden käyttöönotossa. Rakennat ja kehität korkeatasoista mobiilikehitystiimiä, valmennat ja mentoroit osaajia sekä huolehdit toimitusten ennustettavuudesta, kannattavuudesta ja toimintamallien jatkuvasta kehittämisestä. Tämän tehtävän sijaintipaikka on Helsinki. Johtajana olet läsnä tiimillesi ja asiakkaillesi arjen yhteistyössä. Tässä roolissa odotammekin päivittäistä työskentelyä asiakkaan tai CGI:n toimitiloissa. Edellytämme sinulta Vahvaa taustaa modernissa mobiilikehityksessä ja arkkitehtuurissa Olet kokenut iOS- ja Android-kehittäjä tai arkkitehti ja hallitset myös cross-platform-ratkaisuja, kuten Kotlin Multiplatformia, Flutteria tai React Nativea. Sinulla on vankka ymmärrys ohjelmistoarkkitehtuurista, pilvipohjaisista palveluista ja moderneista backend-ratkaisumalleista. Tunnistat DevOpsin, CI/CD:n, testiautomaation ja turvallisen ohjelmistokehityksen toimintaperiaatteet, ja osaat ohjata tiimejä tekemään skaalautuvia ja ylläpidettäviä teknisiä ratkaisuja. Johtamis- ja toimituskokemusta Sinulla on kokemusta ohjelmistokehitystiimien johtamisesta sekä moderneista kehityskäytännöistä. Osaat johtaa toimituksia vaativissa, monitoimittajaympäristöissä tai säädellyillä toimialoilla. Hallitset kokonaisuuksien jäsentämisen, prosessien kehittämisen ja toimitusten jatkuvuuden varmistamisen. Toimit luontevasti asiakkaiden kanssa ja hallitset haastavatkin toimitustilanteet. AI-lähtöinen ajattelutapa Lähestyt ohjelmistokehitystä AI-avusteisesti ja suhtaudut AI-työkalujen hyödyntämiseen proaktiivisesti. Sinulla on kokemusta tai vahva kiinnostus AI-ratkaisujen käyttämisestä koodauksessa, suunnittelussa, testauksessa, dokumentaatiossa ja laadunvarmistuksessa. Autat tiimejä omaksumaan AI-avusteisia toimintamalleja ja parantamaan tuottavuuttaan. Toimialaymmärrystä Finanssialan, fintechin tai laajojen digitaalisten palveluympäristöjen kokemus on hyödyksi, mutta ei välttämätöntä. Ymmärrys modernisointiohjelmista ja asiakasrajapinnan digitaalisista palveluista katsotaan eduksi. Tarjoamme sinulle Tiedämme, että onnistuminen perustuu ihmisiin ja kulttuuriin, toimivia työkaluja ja teknologiaa unohtamatta. CGI:llä saat luoda juuri sinulle sopivaa urapolkua mielenkiintoisten tehtävien sekä sisäisen urakierron kautta. Voit myös jatkuvasti kehittää taitojasi ja syventää osaamistasi mm. CGI Academian avulla. Tarjoamme sinulle työn, jossa voit kehittyä haluamaasi suuntaan sekä mahdollisuuden omistaa yhtiön osakkeita ainutlaatuisen osakesäästöohjelmamme avulla. Henkilöstöstämme 85 % on osakkeenomistajia ja siksi olemmekin CGI Partnereita. Meillä työ joustaa, kun elämäntilanteesi sitä vaatii. Pidämme huolta sinusta ja hyvinvoinnistasi monipuolisin henkilöstöeduin ja tarjoamme mm. kattavan työterveyshuollon, vapaa-ajan vakuutuksen, sairaan lapsen hoitopalvelun sekä mahdollisuuden työsuhdepolkupyörään. Osallistumalla CGI:n hyvinvointiyhteisöjen toimintaan pääset myös tutustumaan työkavereihin eri puolilta taloa yhteisten harrastusten parissa. Tutustu meihin lisää yrityskohtaisesta työehtosopimuksestamme! Tule rakentamaan omaa urapolkuasi meille! Mikäli tämä tehtävä voisi olla seuraava askel urallasi, haethan tehtävää 31.12.2025 mennessä. Etenemme rekrytointiprosessissa heti sopivan kandidaatin löydyttyä. Lisätietoja tehtävästä antaa Niko Halonen, numerosta +358 40 833 2083. Finanssialan asiakkaiden kanssa työskennellessä luottamus ja vastuullisuus ovat toimintamme edellytys, minkä vuoksi tehtävään valittavalle henkilölle tullaan tekemään perusmuotoinen turvallisuusselvitys sekä luottotietojen tarkastus. Tutustu meihin lisää: CGI Ura Facebook , Instagram , LinkedIn , YouTube #LI-MP5 Skills: Delivery Management English Finnish Software Architecture Artificial Intelligence What you can expect from us: Together, as owners, let's turn meaningful insights into action. Life at CGI is rooted in ownership, teamwork, respect and belonging. Here, you'll reach your full potential because... You are invited to be an owner from day 1 as we work together to bring our Dream to life. That's why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our company's strategy and direction. Your work creates value. You'll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise. You'll shape your career by joining a company built to grow and last. You'll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons. Come join our team-one of the largest IT and business consulting services firms in the world.",
    "status": "new",
    "notes": ""
  },
  "score": 95.0,
  "score_breakdown": {
    "positive_keywords": 70.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "software architect",
    "API",
    "backend",
    "lead",
    "architect",
    "software",
    "IT"
  ],
  "category": "High Priority"
}