{
  "job": {
    "id": "83c49366b6e39811",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/business-analyst-k-ryhmaan-skses-19784431",
    "title": "Business Analyst päivittäistavarakaupan liiketoiminnan kehitykseen K-ryhmään",
    "company": "Kesko",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 26.11.",
    "discovered_date": "2025-12-01T14:37:12.043064",
    "description": "Meitä on yli 1000 kauppiasta ja 39 000 koolaista, joilla on loputon usko paremman kaupan rakentamiseen yhä uudestaan ja uudestaan. Uskomme kauppaan ja kauppiuuden vahvaan henkeen yritteliään ja hyvinvoivan yhteiskunnan kivijalkana. Oli juttusi autot, rakentaminen, asiakaspalvelu tai teknologia, meillä on jatkuvasti uusia paikkoja paremman kaupan tekijöille. Meillä kädenjälkesi näkyy suomalaisten arjessa - miten liikumme, syömme tai rakennamme. Tämä talo ei pysähdy ja pystytkin rakentamaan omanlaista uraasi toimialoista ja yhtiöistä toiseen. Olemme tekijöiden talo ja meitä yhdistää ehta tekemisen meininki. Yhdessä tuumin ja asiakas mielessä me teemme parempaa kauppaa, ihan joka päivä. Joten eiköhän kääritä hihat ja laiteta taas tuulemaan - LET'S K! Päivittäistavaratoimialan liiketoiminnan kehitys / K-ryhmä Haluatko auttaa liiketoimintaa tekemään parempia päätöksiä datan avulla, ja samalla ymmärtää, miten päätöksiä syntyy? Tässä tehtävässä pääset liiketoiminnan ytimeen edistämään päätöksentekoa datalla. Työskentelet analyytikkotiimissä, joka tukee päivittäistavaratoimialan myynti- ja hankintaorganisaatiota datalähtöisessä päätöksenteossa. Tiimin vastuisiin kuuluvat mm. data-analyysit, datatyövälineiden kehitys, sidosryhmien datakyvykkyyksien kasvattaminen sekä datan kehittäminen. Osallistumme myös toimialan strategisten hankkeiden suunnitteluun ja toteutukseen. Analyytikkona keskityt erityisesti tavarantoimittajien ja K-ryhmän välisen yhteistyön kehittämiseen datan avulla. Analysoit tavarantoimittajien kokonaisuuksia eri näkökulmista, hyödyntäen monipuolisia datalähteitä ja liiketoiminnan asiantuntemusta. Tehtävässäsi ei ole kyse vain analyysien tuottamisesta, vaan myös siitä, että datasta johdetut näkemykset vaikuttavat aidosti liiketoiminnan päätöksiin. Odotamme sinulta: Kokemusta      erilaisten data-analyysien ja -ratkaisujen tuottamisesta Kykyä reagoida nopeasti muuttuviin liiketoiminnan      tarpeisiin Hyviä datan visualisointitaitoja Vahvoja esiintymistaitoja Modernien analytiikkatyökalujen (esim. Qlik      Sense, Power BI, Snowflake) tuntemusta sekä kykyä käsitellä isoja      datamääriä esimerkiksi SQL:n,      Pythonin tai R:n avulla Sujuvaa      Excelin ja PowerPointin käyttöä Kiinnostusta Gen AI:n hyödyntämiseen analytiikassa ja työn      tehostamisessa Sujuvaa suomen kielen taitoa Kokemus tavararyhmähallinnan prosesseista ja niiden      päätöksentekopisteistä (hankinta, valikoima, hinnoittelu, tilasuunnittelu)      katsotaan eduksi Soveltuvaa korkeakoulututkintoa (DI / KTM / FM) Tarjoamme sinulle: Mahdollisuuden kehittyä liiketoimintaa ja dataa      ymmärtäväksi tulevaisuuden tekijäksi Paikan,      jossa datatuotoksillasi on suora vaikutus liiketoimintaan ja pääset      haastamaan itseäsi datan analysoinnissa Motivoivan      ja kannustavan tiimin sekä työyhteisön, joka tukee kehittymistäsi niin      analytiikan kuin liiketoimintaosaamisenkin saralla Moniulotteisen      datan ja nykyaikaiset IT-työkalut Lukuisia mahdollisuuksia itsensä kehittämiseen sisäisten koulutusten ja eLearning -kurssitarjonnan parissa sekä monipuoliset uramahdollisuudet Kattavat henkilöstöedut, joihin kuuluu muun muassa matkapuhelinetu, Epassi Flex, henkilöstöalennukset K-ryhmän liikkeistä, oma työterveyshuolto ja vapaa-ajan tapaturmavakuutus. Sinulla on myös mahdollisuus työsuhdeautoon autopolitiikkamme mukaisesti. Lisäksi yhteistyökumppanimme tarjoavat monipuolisia etuja mm. matkustamisen ja optikkopalveluiden parista. Hienot työtilat Helsingin Kalasatamassa sijaitsevalla K-Kampuksella, jossa työskentelemme hybridimallimme mukaisesti vähintään kolmena päivänä viikossa. Kampukseltamme löytyy mm. viihtyisät yhteistyö- ja taukotilat, oma kuntosali ja työterveyspalvelut, kahvila ja henkilöstöravintola. Työskentelemme edistääksemme K-ryhmän päivittäistavarakaupan kasvustrategiaa. Lue lisää strategiasta: https://kesko.fi/sijoittaja/strategia/toimialojen-strategiat/paivittaistavarakaupan-strategia/ Lisätietoja tehtävästä antaa 2.12.2025 klo 9-11, 3.12.2025 klo 12-14 ja 8.12.2025 klo 12-14 Business Analytics Manager, Team Lead Siiri Tuominen, +358 503724496. Lähetä hakemuksesi 14.12. mennessä - paikka täytetään sopivan kandidaatin löydyttyä. Suoritamme huumausainetestauksen koeajan aikana. Me K-ryhmässä arvostamme monimuotoisuutta ja uskomme, että erilaiset taustat ja näkökulmat ovat avain menestykseen. Pyrimme luomaan työympäristön, jossa jokaisella on mahdollisuus kehittyä. Yhdenvertaisuus, syrjimättömyys ja oikeudenmukaisuus ovat keskeisiä periaatteitamme rekrytoinnissa, palkitsemisessa ja urakehityksessä.",
    "status": "new",
    "notes": ""
  },
  "score": 75.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "business analyst",
    "python",
    "lead",
    "manager",
    "IT"
  ],
  "category": "High Priority"
}