{
  "job": {
    "id": "af7d5cc6b82cd7f1",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/koodaava-arkkitehti-scsgi-19778788",
    "title": "Koodaava arkkitehti",
    "company": "CGI Suomi",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 24.11.",
    "discovered_date": "2025-12-01T14:36:16.757266",
    "description": "Position Description: CGI on yksi suurimmista IT- ja liiketoimintakonsultoinnin yrityksistä Suomessa ja maailmalla. Vahva kokemuksemme eri toimialoilta auttaa julkisen ja yksityisen sektorin asiakkaitamme onnistumaan digitaalisessa muutoksessa ja saavuttamaan tavoitteitaan entistä tehokkaammin. Koodaava arkkitehti Etsimme Central Governmentin Education & Economy-yksikköön kokenutta ja teknisesti taitavaa koodaavaa arkkitehtia, jolla on vahvaa näyttöä pilvipohjaisten sovellusten suunnittelusta ja toteutuksesta. Vastuualueesi: - Osallistut asiakasprojekteihin johtavan kehittäjän roolissa - koodaat, testaat ja viet ratkaisuja tuotantoon hyödyntäen moderneja periaatteita ja työkaluja - Rakennat ja esittelet arkkitehtuuriratkaisuja, jotka hyödyntävät tekoälyä sekä moderneja pilviteknologioita (AWS, Azure, Google Cloud) - Seuraat teknologian kehitystä ja tuot uusia ideoita asiakasratkaisuihin - Osallistut teknisenä asiantuntijana myyntiin Tuleva tiimisi Tässä tehtävässä pääset osaksi kasvavaa tiimiä, joka on osa valtionhallinnon asiakkuuksien parissa työskentelevää Education & Economy yksikköä. Tiimimme vastuulla on useita merkittäviä valtionhallinnon asiakkuuksia. Tämän tehtävän sijaintipaikka on Helsinki, mutta toimimme CGI:llä joustavasti hybridimallilla, yhdistäen etä- ja lähityöskentelyä. Edellytämme sinulta Edellytämme sinulta useamman vuoden kokemusta vaativasta roolista sovelluskehityksen asiantuntijana. Lisäksi edellytämme sinulta: • Vankkaa kokemusta pilvipohjaisten sovellusten suunnittelusta ja toteutuksesta (AWS, Azure, Google Cloud) • Vähintään associate-tason AWS sertifikaattia • Kykyä kommunikoida sujuvasti sekä teknisten että liiketoiminnallisten sidosryhmien kanssa • Sujuvaa suomen ja englannin kielen taitoa Tarjoamme sinulle Tiedämme, että onnistuminen perustuu ihmisiin ja kulttuuriin, toimivia työkaluja ja teknologiaa unohtamatta. CGI:llä saat luoda juuri sinulle sopivaa urapolkua mielenkiintoisten tehtävien sekä sisäisen urakierron kautta. Voit myös jatkuvasti kehittää taitojasi ja syventää osaamistasi mm. CGI Academian avulla. Tarjoamme sinulle työn, jossa voit kehittyä haluamaasi suuntaan sekä mahdollisuuden omistaa yhtiön osakkeita ainutlaatuisen osakesäästöohjelmamme avulla. Henkilöstöstämme 85 % on osakkeenomistajia ja siksi olemmekin CGI Partnereita. Meillä työ joustaa, kun elämäntilanteesi sitä vaatii. Pidämme huolta sinusta ja hyvinvoinnistasi monipuolisin henkilöstöeduin ja tarjoamme mm. kattavan työterveyshuollon, vapaa-ajan vakuutuksen, sairaan lapsen hoitopalvelun sekä mahdollisuuden työsuhdepolkupyörään. Osallistumalla CGI:n hyvinvointiyhteisöjen toimintaan pääset myös tutustumaan työkavereihin eri puolilta taloa yhteisten harrastusten parissa. Tutustu meihin lisää yrityskohtaisesta työehtosopimuksestamme! Tule rakentamaan omaa urapolkuasi meille! Mikäli tämä tehtävä voisi olla seuraava askel urallasi, haethan tehtävää 12.12.2025 mennessä. Etenemme rekrytointiprosessissa heti sopivan kandidaatin löydyttyä. Lisätietoja tehtävästä antaa Antti Peltola, numerosta +358 45 118 1412. Parhaiten Antin tavoitat 5.12 klo 12-14 ja 10.12 klo 14-16. Perusmuotoinen turvallisuusselvitys tullaan tekemään tehtävän niin vaatiessa. Tutustu meihin lisää: Ura Facebook , Instagram , LinkedIn , YouTube #LI-EL2 Skills: Cloud Native Development DevOps English Finnish Software Architecture Solutions Architecture Artificial Intelligence What you can expect from us: Together, as owners, let's turn meaningful insights into action. Life at CGI is rooted in ownership, teamwork, respect and belonging. Here, you'll reach your full potential because... You are invited to be an owner from day 1 as we work together to bring our Dream to life. That's why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our company's strategy and direction. Your work creates value. You'll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise. You'll shape your career by joining a company built to grow and last. You'll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons. Come join our team-one of the largest IT and business consulting services firms in the world.",
    "status": "new",
    "notes": ""
  },
  "score": 75.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "software architect",
    "lead",
    "architect",
    "software",
    "IT"
  ],
  "category": "High Priority"
}