{
  "job": {
    "id": "1479934",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1479934",
    "title": "Senior Full Stack Software Engineer",
    "company": "Kühne + Nagel ",
    "location": "Unknown",
    "posted_date": "2025-12-09T12:31:16.605+00:00",
    "discovered_date": "2025-12-10T15:09:25.280254",
    "description": "Requirements for candidates:\nYour Skills and Experiences\nDegree in computer science or a related field.\nProficiency in development tools like Eclipse/IntelliJ, Maven, Git, and Jenkins.\nStrong expertise in Java and JUnit, with additional knowledge in Spring, JPA/Hibernate, and SQL being a plus.\nExperience in frontend development, with Angular as a must-have skill.\nAbility to find pragmatic and innovative solutions that maximize business value.\nStrong problem-solving skills with a creative and innovative approach.\nHighly self-motivated, detail-oriented, and result-driven, with excellent teamwork and collaboration abilities.\nExcellent communication skills in English, both written and spoken.\n\nJob description:\nYour Responsibilities\nFocus on developing the new Air Logistics System by implementing functional and technical components in a modern continuous delivery environment.\nEnsure quality and long-term maintainability of the software.\nContribute to migrating from a Java Swing application to a new Angular app while troubleshooting and optimizing existing code.\nConduct development tests, code reviews, and create unit tests to maintain high code quality.\nParticipate in the entire development lifecycle, from requirements gathering to product delivery.\nCollaborate regularly with the Air Logistics Team to find the best technical and functional solutions for new features and improvements.\nGain expertise in the air logistics business domain and work with continuously online production systems.\nSupport system maintenance, application rollouts, and operations as part of the development support team.\n\nWhat we offer:\nGood Reasons to Join\nJoin Kuehne+Nagels IT Hub in Tallinn, where your work will have a meaningful impact on the logistics industry. Here, youll find a hybrid work model, extensive health benefits, and a culture of continuous learning that ensures your career growth. Youll be surrounded by extraordinary and committed people, all dedicated to shaping the future of logistics. Even if you dont tick every box, we encourage you to apply your unique perspective and experience could be exactly what we need. Be part of a team that values work-life balance, supports your personal well-being, and empowers you to contribute to something truly impactful.\n\nYour Role\nAs a Software Engineer, you will be part of a cross-functional product team working on our mission-critical AirLOG application, which supports our Air Forwarding operations around the world. As part of a global team of engineers and analysts, you will build products to deliver innovative solutions that delight our Air Logistics stakeholders. Following the principles of agile software development, you will be involved throughout the entire development lifecycle. You'll work closely with diverse teams, brainstorming, designing, coding and refining to develop reliable and customer-focused solutions to support and enhance our Air Logistics services.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 40.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "title_match": 15.0,
    "required_missing": -50.0,
    "preferred_company": 15.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "java",
    "angular",
    "senior",
    "API",
    "agile"
  ],
  "category": "Review"
}