{
  "job": {
    "id": "1466783",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1466783",
    "title": "Director of Partner Ecosystem - Strategic Alliances & Marketplace",
    "company": "Wrike",
    "location": "Unknown",
    "posted_date": "2025-11-26T12:02:40.415+00:00",
    "discovered_date": "2025-12-03T03:03:56.910769",
    "description": "Wrike is the most powerful work management platform. Built for teams and organizations looking to collaborate, create, and exceed every day, Wrike brings everyone and all work into a single place to remove complexity, increase productivity, and free people up to focus on their most purposeful work.\nOur vision:\nA world where everyone is free to focus on their most purposeful work, together.\nAbout the Role:\nAs the strategic leader of Wrike's partner ecosystems consisting of - system integrators (SIs), ISV integration partners, channel resellers, and cloud marketplace partners, you'll spearhead the evolution of our 400+ partner network into a powerful growth engine. This role sits at the intersection of strategy and executionwhere you'll architect the future of Wrike's partner ecosystem while delivering measurable business impact through strategic partnerships.\nYou will thrive in this role if you're a visionary who can translate complex partner relationships into scalable business frameworks, while maintaining a laser focus on customer outcomes. You possess exceptional business acumen, can navigate enterprise GTM partnerships, and have a proven track record of building programs that drive joint revenue growth and customer success.\nYour Impact:\nDrive ecosystem strategy:\nDevelop and execute a comprehensive partner strategy that aligns with Wrike's business objectives, collaborating with key stakeholders to secure buy-in and resources\nArchitect partner success models:\nCreate scalable, repeatable frameworks for partner enablement, co-selling, and joint GTM activities that drive mutual success\nLead joint value creation:\nDevelop compelling business cases for integrations and partnerships, establishing clear ROI metrics and mutual commitments around sales, marketing, and product initiatives\nOrchestrate Go-To-Market excellence:\nCoordinate cross-functional resources to support partner GTM activities, ensuring seamless execution and alignment with Wrike's sales organization\nScale field enablement:\nBuild programs that empower sales teams to effectively position partner solutions, working closely with sales leadership, enablement, and customer success\nChampion customer success:\nCreate joint customer references and success stories that showcase the powerful synergy between Wrike and partners\nDrive innovation:\nIdentify emerging partnership opportunities and develop new use cases based on customer and partner feedback to solve complex workflow challenges\nYour Qualifications:\n8–10+ years of experience in SaaS partnerships, strategic alliances, or business development roles with demonstrated success\nProven track record building and scaling partner programs in a global, cross-functional capacity\nExperience developing and executing partner GTM strategies that drive measurable business outcomes\nStrong analytical skills with the ability to translate partner data into actionable insights\nExceptional relationship-building capabilities across all organizational levels\nStandout Qualities:\nBS/BA degree, MBA preferred\nExperience in work management, productivity, or collaboration software markets\nDemonstrated success building marketplace strategies for SaaS products\nExperience building joint GTM models and growth through system integrators value added resellers\nExpertise in scaling growth through cloud marketplace hyperscalers like Google Cloud Platform, Amazon Web Services and Azure\nTrack record of independently leading strategic initiatives that delivered significant business impact\nExceptional communication skills with the ability to influence and align diverse stakeholders\nExperience in both high-growth and enterprise software environments\nTeam Dynamics:\nWe operate in a fast-paced, collaborative environment where strategic thinking meets execution excellence. Our partnership approach is data-driven, customer-centric, and focused on mutual growth. You'll have the autonomy to drive initiatives while collaborating with cross-functional teams to ensure alignment and impact.\nAt Wrike, we're building the future of collaborative work management, and our partner ecosystem is central to that vision. Join us in creating powerful connections that deliver exceptional value to our customers worldwide.\nWhy Join Wrike?\n28 calendar days of paid vacation\nSick leave compensation\nLife insurance plan\nHealth insurance plan\nFitness plan (800 EUR/year)\nParental leave\n2 volunteer days\nFull-remote & On-demand access to Co-working space\nUtility allowance (30 EUR/month, subject to taxation)\nYour recruitment buddy will be Veronika Repková, Talent Sourcing Team Lead\n#LI-VR3\nWho Is Wrike and Our Culture\nWere a team of innovators and creators who solve the complex work problems of today and tomorrow.\nHybrid work mode\nWrike promotes a hybrid model for team members near our office hubs in San Diego, Prague, Dublin, Nicosia, and Tallinn, with 2–3 in-office days per week to foster collaboration and teamwork. This work mode supports our culture of collaboration and solving problems fast to deliver business outcomes and win together.\nOur persona\n💡  Smart:\nWe love what we do, and were great at it because this is our domain. Our combined knowledge in this space is unmatched.\n💚  Dedicated:\nWe get up every day focused on helping our customers win. Were committed to helping our teammates win, too!\n🤗  Approachable:\nWe're friendly, easy to get along with, considerate, and helpful.\nOur culture and Values\n🤩 Customer-Focused\nWe care about our customers.\nWe understand the customer journey, experience, and value derived from Wrike. Decision-making and action-taking are done with the customer in mind.\n🤝 Collaborative\nWe work as one and win together,\neach bringing unique strengths that contribute to diversity of thought for better outcomes. Leveraging our own work management platform, we foster an environment of creative collaboration and shared achievement.\n🎨 Creative\nWe strive to succeed through continuous innovation.\nIts our pursuit of novel concepts that helped us create a market category. We continue to cultivate a workplace that fosters creative thinking as a means of transcending conventional boundaries and empowers us to break new ground to deliver extraordinary work management solutions.\n💪 Committed\nWe believe in ownership at all levels of the organization,\nby owning workflows from start to finish. Each member of our team is an integral part of this commitment, establishing work as a platform for personal growth and transformation, as well as collective success and growth.\nCheck out our LinkedIn Life Page, Company culture page, Instagram, Wrike Engineering Team, Medium, Meetup.com, Youtube for a feel for what life is like at Wrike.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 40.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "architect",
    "azure",
    "team lead"
  ],
  "category": "Review"
}