{
  "job": {
    "id": "0afe28ed193f2839",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/toiminnallinen-arkkitehti-maarittelija-designer-svsal-19784310",
    "title": "Toiminnallinen arkkitehti (määrittelijä, designer)",
    "company": "Maahanmuuttovirasto",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 25.11.",
    "discovered_date": "2025-12-01T14:39:42.917318",
    "description": "Maahanmuuttoviraston digitaalisten palveluiden arkkitehtuuri- ja teknologiapalveluihin etsitään kokenutta järjestelmäkehityksen asiantuntijaa toiminnallisen arkkitehdin tehtävään ajalle 1.3.2026 - 31.12.2026 (tai aloitus sopimuksen mukaan). Tehtävässä pääset kehittämään viraston toiminnan kannalta keskeistä järjestelmäkokonaisuutta - ulkomaalaisasioiden asiankäsittelyjärjestelmä UMAa ja asiointipalvelu EnterFinlandia. Järjestelmää käyttävät Maahanmuuttoviraston lisäksi myös muut viranomaiset kuten poliisi, Rajavartiolaitos ja Suomen edustustot. Järjestelmä tukee sujuvaa ja hallittua maahantuloa sekä edistää osaltaan Suomen sisäistä turvallisuutta, ja kehitystyö palvelee siten viraston strategisten tavoitteiden toteutumista. Toiminnallinen arkkitehti työskentelee laaja-alaisesti järjestelmäkehityksen suunnittelutehtävissä ja varmistaa, että liiketoiminnan tarpeisiin suunniteltavat ratkaisut vastaavat yhteisiä linjauksia, suuntaa ja viraston tavoitteita. Tehtäviin voi kuulua mm. - käyttäjätutkimukset, vaatimusten ja tiedonkeruu, käyttäjäpolkujen ja palvelukuvausten suunnittelu - toimintoarkkitehtuuri ja määrittely, sisältäen järjestelmien perustoimintojen, moduulien ja konfigurointityökalujen suunnittelua (functional design) - järjestelmien välisten liittymien ja tiedonjaon suunnittelu, tiedonhallinta ja tietomallit - toiminnallisten ja ei-toiminnallisten vaatimusten huomiointi suunnittelussa varmistaen, että käyttöliittymäsuunnitelmat, käytettävyys ja taustalogiikka toimivat sujuvasti yhteen Toiminnallinen arkkitehti työskentelee tiiviissä yhteistyössä tuoteomistajien, prosessiasiantuntijoiden ja muiden arkkitehtien kanssa. Tehtäviin sisältyy myös sidosryhmäyhteistyötä. Arkkitehti vastaa analyysi- ja suunnittelutehtävistä, mallinnuksesta ja vaatimustenhallinnasta oman asiantuntija-alueensa osalta. Hakija voi esittää toiveita tehtävän painotuksista. Toiminnallisen arkkitehdin tärkeimpiä tehtäviä ovat - kehityskohteiden suunnittelu-, analyysi- ja mallinnustyöt yhdessä muun kehitystiimin ja asiantuntijoiden kanssa - suunnittelutyön ja työpajojen fasilitointi - uusien konseptien suunnittelu ja käytössä olevien toimintojen jatkokehitys - toimintojen välisten riippuvuuksien tunnistaminen, yhteensovittaminen ja muutosten aiheuttamien vaikutusten arviointi - kehitystiimien tukeminen ja toimittajaohjaus oman vastuualueen suunnittelu- ja arkkitehtuurikysymyksissä, vaatimustenhallinnassa ja priorisoinnissa - ohjeistusten, kehitysprosessien, linjausten, käytäntöjen ja laatukriteerien suunnittelu oman erikoistumisalueen suunnittelutyöhön liittyen Käytämme ja kehitämme skaalatun ketterän kehityksen toimintamalleja (SAFe). Työkielinä ovat suomi ja englanti. Tehtävän virkapaikka on Helsinki. Samasta hausta voidaan tarvittaessa täyttää myös muita mahdollisesti vapautuvia vastaavia tehtäviä. Lisätietoja https://migri.fi Hakijalta odotamme Parhaimmat valmiudet tehtävän hoitamiselle antaa tehtävään soveltuva koulutus (korkeakoulututkinto tai muu soveltuva koulutus esimerkiksi tekniseltä, kaupalliselta tai muotoilun alalta) tai laaja-alainen käytännön työssä rakennettu osaaminen ja kokemus järjestelmäkehityksen tehtävistä. Lisäksi hakijalta odotetaan - aiempaa käytännön työkokemusta ja osaamista tehtävänkuvan mukaisista järjestelmien suunnittelutehtävistä - luovaa ongelmanratkaisukykyä sekä vahvaa analyyttistä ja aktiivista kehittämisotetta - erittäin hyviä vuorovaikutus-, fasilitointi- ja yhteistyötaitoja sekä selkeää suullista ja kirjallista ilmaisukykyä - kykyä määritellä, jäsennellä ja mallintaa laajoja, monimutkaisia kokonaisuuksia - kokemusta laajojen kokonaisuuksien hallinnasta, priorisoinnista ja organisoinnista Hakijan eduksi katsotaan - kokemus toimittajaohjauksesta tai kehitystiimien ohjauksesta järjestelmäkehityksessä - kokemus muista järjestelmäkehityksen tehtävistä, kuten ohjelmoinnista, testauksesta tai analytiikasta - muu syventävä kokemus suunnittelutehtävistä, kuten käyttöliittymäsuunnittelusta, käytettävyydestä, käyttäjäkokemuksesta tai kokonaisarkkitehtuurista ja tiedonhallintamallista - säännellyn toimintaympäristön tuntemus - kokemus ketteristä järjestelmäkehityksen menetelmistä - kokemus tietoturvan ja tietosuojan vaatimuksista osana järjestelmäkehitystä Kaikkia eduksi luettavia asioita ei hakijan tarvitse täyttää. Tehtävässä tarvittava kielitaito Englanti Suullinen osaaminen: Erinomainen Kirjallinen osaaminen: Erinomainen Ymmärtäminen: Erinomainen Ruotsi Suullinen osaaminen: Tyydyttävä Kirjallinen osaaminen: Tyydyttävä Ymmärtäminen: Tyydyttävä Suomi Suullinen osaaminen: Erinomainen Kirjallinen osaaminen: Erinomainen Ymmärtäminen: Erinomainen Tarjoamme sinulle Tarjoamme migriläisille monenlaisia palvelussuhde-etuja, joita ovat mm. - tuettu lounas - liikunta- ja kulttuurietu tukemaan työhyvinvointia ja jaksamista - kattava työterveyshuolto - liukuva työaika ja joustava etätyömahdollisuus - viraston sijainti hyvien kulkuyhteyksien päässä - virastokeskuksen kuntosali maksutta kaikkien migriläisten käytettävissä. Selvitykset Virkaan tai tehtävään valittavasta henkilöstä voidaan tehdä hakijan suostumuksella perusmuotoinen henkilöturvallisuusselvitys (turvallisuusselvityslaki 726/2014). Menettelystä ja selvityksen kohteen oikeuksista löytyy tarkempia tietoja osoitteessa www.supo.fi. Turvallisuusselvitys sisältää myös ulkomaansidonnaisuuksien selvittämisen. Yhteystietomme Sam Hedberg Ryhmäpäällikkö sam.hedberg@migri.fi Yhteydenottopyynnöt sähköpostin kautta. Liisa Harilainen Johtava asiantuntija liisa.harilainen@migri.fi Yhteydenottopyynnöt sähköpostin kautta. Hakemuksen lähettäminen Toivomme hakemukset ensisijaisesti sähköisinä Valtiolle.fi-palvelun kautta. Voit kuitenkin hakea tätä työpaikkaa myös toimittamalla hakemuksesi kirjaamon postiosoitteeseen. Sekä hakemuksessa että kirjekuoressa tulee mainita haettavan tehtävän ID-numero. Kirjeen tulee olla perillä hakuajan päättymiseen mennessä. Maahanmuuttoviraston kirjaamo PL 10 00086 Helsinki Työnantaja Meillä Maahanmuuttovirastossa pääset työskentelemään monipuolisesti maahanmuuttoon liittyvissä tehtävissä kansainvälisten ja yhteiskunnallisesti tärkeiden asioiden parissa. Teemme päätökset maahanmuutto-, turvapaikka-, pakolaisuus- ja kansalaisuusasioihin sekä ylläpidämme Suomen vastaanottojärjestelmää. Työmme on vaikuttavaa ja merkityksellistä: edistämme suomalaisen yhteiskunnan toimivuutta, kilpailukykyä ja turvallisuutta. Ennakoimme tulevaa ja uudistamme toimintaamme rohkeasti. Meitä on noin 1 300 ja työskentelemme Helsingissä, Kuhmossa, Kuopiossa, Lahdessa, Lappeenrannassa, Oulussa, Raisiossa, Rovaniemellä, Tampereella ja Vaasassa. Sijainti Opastinsilta 12 A, 00520 Helsinki Voit tehdä työtä jossain seuraavista toimipisteistämme Helsinki, Opastinsilta Opastinsilta 12 A 00520 Helsinki Tutustu työnantajaan Tehtävän tiedot Muut tehtävän tiedot Lisätietoja: Toivomme hakijoiksi eri ikäisiä ja eri sukupuolia olevia henkilöitä sekä kieli-, kulttuuri- tai muihin vähemmistöihin kuuluvia henkilöitä. Tehtävän taso: Asiantuntijataso Etätyö: Mahdollisuus työskennellä etänä Etätyön kuvaus: Tehtävää voi hoitaa osittain etänä. Virka perustettu: Virka on viraston yhteinen. Määräaikaisuuden peruste: Työn luonne Määräaikaisuuden lisätietoja: Tilapäinen lisätyövoiman tarve Työaikamuoto: Virastotyöaika Lisätietoja työajoista: Liukuva virastotyöaika Koeaika: Tehtävässä voidaan noudattaa virkamieslain 10 •:n mukaista koeaikaa. Palkkatiedot: Tehtävän palkkaus määräytyy viraston palkkausjärjestelmän vaativuustason 10 mukaisesti, jolloin tehtäväkohtainen palkanosa on 3 675,50 euroa kuukaudessa ja henkilökohtaiseen työsuoritukseen perustuva palkanosa enintään 50 % tehtäväkohtaisesta palkanosasta. Uuden työntekijän henkilökohtainen palkanosa on 10-20 % kokemuksesta ja osaamisesta riippuen. Ensimmäisen kuuden kuukauden ajan palkka on 4 043,05-4 410,60 euroa kuukaudessa.",
    "status": "new",
    "notes": ""
  },
  "score": 30.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "java",
    "IT"
  ],
  "category": "Low Priority"
}