{
  "job": {
    "id": "0ddde1ffa52689ec",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/verisure-myyja-kodinturva-alalle-helsinki-sdsuu-19725351",
    "title": "Myyjä kodinturva-alalle",
    "company": "Verisure Oy",
    "location": "Helsinki ja 7 muuta –",
    "posted_date": "Julkaistu 7.11.",
    "discovered_date": "2025-12-01T14:35:57.426476",
    "description": "Kun kyse on työpaikasta, melko hyvä ei riitä. Parasta olla Verisure. Myyjänämme pääset työskentelemään Great Place to Work -sertifioidussa organisaatiossa, ja myymään Suomen suosituinta kodinturva-alan hälytysjärjestelmää. Mikäli tämä kuulostaa sinulle sopivalta työpaikalta, jatka lukemista alta ! Miltä arkesi näyttää meillä? Myyjänämme liikut Verisuren tarjoamalla käyttöetuautolla, ja toimit turvapalveluidemme asiantuntijana tehden turvakartoituksia asiakaskohteissa. Tavoitteenasi on luoda ratkaisuehdotus asiakkaan tarpeiden pohjalta, ja turvata hänen kotinsa tai yritystilat neuvottelemalla kaupat maaliin asti. Viikkokalenterisi koostuu sinulle valmiiksi sovituista tapaamisista sekä sinun itsesi hankkimistasi tapaamisista – koulutuksia ja tiimipalavereja unohtamatta. Palvelemme niin koti- kuin yrityskohteita, minkä myötä saat mahdollisuuden toimia myös yritysmyynnin parissa. Kun myynti alkaa sujumaan, koulutamme sinut asentamaan kaupatut hälytysjärjestelmät asiakkaidesi kohteisiin. Työpäiväsi ovat liikkuvia ja vaihtelevia, ja työtä tehdään arkipäivisin lähtökohtaisesti klo 12:00–20:00. Työhön perehtymisen myötä työaika muuttuu hieman joustavammaksi, koska pääset itse vaikuttamaan siihen, miten aikataulutat asiakastapaamisiasi. Kelle tämä työ sopii? Mikäli koet syttyväsi tavoitteiden saavuttamisesta ja konkreettisista onnistumisista, löytyy sinulta hyvät eväät työssä menestymiseen. Myös tietty pilke silmäkulmassa kilpailullisuuden suhteen antaa hyvää lisäpotkua tekemiseen. Arvostamme aiempaa kokemusta suoramyynnin parista, mutta se ei ole välttämätöntä - tarjoamme sinulle kattavan koulutuksen sekä kokeneiden esihenkilöiden päivittäisen tuen. Voit olla esimerkiksi tavoitteellinen myyntityötä etsivä alanvaihtaja, joka etsii uusia haasteita uralleen. Mitä edellytämme: B-luokan ajokorttia (manuaali) Sujuvia vuorovaikutustaitoja suomen kielellä Motivaatiota oppia palvelumme ja tuotteemme Tavoitteellisuutta ja innokkuutta suoramyyntiä kohtaan Lisäksi työhön vaaditaan turvasuojaajakorttia, jonka saanti edellyttää puhdasta rikosrekisteriä. Neuvomme kortin hankinnassa aina työsuhteen alkaessa. Tarjoamme sinulle: Kannustavan palkkamallin, joka muodostuu 500 €/kk pohjapalkasta + noin 300 €/kauppa provisioista. Keskimäärin myyjämme tienaavat noin 3 000-5 000 €/kk, ja parhaiten tienaavat yltävät 10 000 €/kk tai sen yli. Takuupalkan 2 000 €/kk työsuhteen kolmena ensimmäisenä kuukautena, joka koostuu 500 € pohjapalkasta ja 1 500 €/kk takuuprovisiosta. Käyttöetuauton , jolla pääset liikkumaan sekä työ- että vapaa-ajalla. Kattavan perehdytyksen ja tuen koko työsuhteesi aikana. Aloitat työsi neljän päivän koulutuskurssilla toimistolla, jonka jälkeen perehdytys jatkuu kentällä yhdessä kouluttajien sekä esihenkilösi kanssa. Katso videolta kouluttajamme Peterin esittely siitä, miten koulutamme sinut tehtävään. Miellyttävän ja välittävän työyhteisön . Olemme myös tutkitusti hyvä työnantaja. Meille on myönnetty Great Place to Work -sertifikaatti™. Yhteistä tekemistä ja paljon erilaisia tapahtumia . Pääset esimerkiksi tutustumaan sekä näkemään eri kaupungeissa työskenteleviä myyjiä myyntikokousten yhteydessä, tai nauttimaan koko organisaatiolle järjestettävässä Inspiration Day –kesätapahtumassa. Myyntikilpailuja , joista voit voittaa mm. Ulkomaanmatkoja. Katso tästä Instagram tililtämme video myyjiemme palkintomatkasta Saksaan! Mahdollisuuden edetä urallasi – tällä hetkellä lähes jokainen kenttämyynnin esihenkilö on edennyt tehtäväänsä talon sisältä. Uratarinoitamme löydät lisää sosiaalisen median sivuiltamme. Kattavat henkilöstöedut , kuten käyttöetuauto, kattava työterveyshuolto Mehiläisellä, hammaslääkärietu, lounasetu, liikunta-, kulttuuri- ja hyvinvointiedut. Pääset tutustumaan meihin sekä Verisuren myyntityöhön tarkemmin sosiaalisen median tiliemme kautta TikTokissa ja Instagramissa ! Merkityksellinen myyntityö ei ole itsestään selvää - me mahdollistamme sen. Jos haluat tehdä tavoitteellista työtä, ja turvata samalla ihmisten arjen suomen suosituimmalla kodinturva-alan palvelulla, lähetä hakemus tehtävään sivulla olevasta linkistä. Käsittelemme hakemuksia hakuaikana, ja paikat täytetään aina sopivien henkilöiden löytyessä. Lisätietoja tehtävästä voit tarvittaessa tiedustella rekrytiimiltä sähköpostitse osoitteesta rekry@verisure.fi .",
    "status": "new",
    "notes": ""
  },
  "score": 20.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "IT"
  ],
  "category": "Low Priority"
}