{
  "job": {
    "id": "1ce13ff0bb82c914",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/bilar99e-automyyjaksi-bilarille-vantaa-sdsuu-19734955",
    "title": "Automyyjäksi Bilarille",
    "company": "Bilar99",
    "location": "Vantaa –",
    "posted_date": "Julkaistu 11.11.",
    "discovered_date": "2025-12-01T14:35:57.427301",
    "description": "Haluaisitko laittaa persoonasi peliin tavoitteellisessa myyntityössä? Viihdytkö työporukassa, jossa on kannustava ja välitön meininki? Onko kiikarissa työ, jossa pääset itse vaikuttamaan ansaintaan? Kuulostaa ihan siltä, että voisit olla uusi työkaverimme - etsimme nimittäin Bilarille tammikuussa avattavaan Vantaan myymälään kymmentä uutta automyyjää! Mikä on Bilar99? Olemme käytettyihin autoihin erikoistunut autoliikeketju, joka haluaa tehdä asioita uudella, raikkaalla tavalla. Keskitymme pääosin ekologisiin, uudehkoihin autoihin. Vaihtoautovarastomme kattaa nykyisin yli 1 000 myytävää autoa, joista suuri osa on sähkö- ja hybridiautoja. Olemme kasvaneet nopeasti yhden liikkeen autokaupasta valtakunnalliseksi ketjuksi. Kasvu jatkuu yhä, ja mukanamme pääset kasvamaan itsekin! Yhteinen päämäärämme on ylittää asiakkaan odotukset autokaupoilla ja rakentaa kumppanuuksia, joiden myötä auto vaihtuu meillä myös tulevissa elämän käänteissä. Tavoitteenamme on tarjota autokaupan paras asiakaskokemus, ja yhtä lailla tähtäämme myös parhaaseen työntekijäkokemukseen. Arvojamme ovat rehellisyys, avoimuus ja ihmisten kunnioitus ja halu oppia ja menestyä. Niitä haluamme vaalia kaikissa asiakas-, työ- ja yhteistyösuhteissa. Millaisesta myynti työstä on kysymys? Meillä Bilar99:llä teet käytettyjen autojen myyntiä monikanavaisesti myymälässä, chatissa, sähköpostilla, WhatsApissa ja puhelimitse. Tyypilliseen työpäivään kuuluu lisäksi esimerkiksi vaihdossa tulevien autojen tarkastusta, vaihtoautojen hinnoittelua sekä yhteydenpitoa eri yhteistyökumppaneiden, kuten korjaamoiden kanssa. Ympärilläsi työskentelee avulias ja avoin työporukka myymälässä, jossa on lisäksesi muita myyjiä, myyntiavustaja sekä myyntipäällikkö, joka toimii esihenkilönäsi. Työ on monipuolista ja vastuullista, yhdessä jaamme onnistumisia ja ideoita sekä ratkomme ongelmatilanteita. Työaikasi on 37,5 tuntia viikossa ja työaika ajoittuu myymälän aukioloaikojen mukaan. Myymälämme ovat auki arkisin kello 10-18 ja lauantaisin kello 10-16. Joskus kaupan saaminen edellyttää, että olet valmis joustamaan hieman aukioloaikojen ulkopuolelle. Sinulla on työssäsi selkeät myyntitavoitteet, joiden edistymistä seuraat säännöllisesti esihenkilösi kanssa. Alussa tavoitteesi ovat luonnollisesti matalammalla ja niitä nostetaan sitä mukaa, kun kehityt myyntityössäsi. Aiempi kokemus myynnistä ei ole välttämätön, mutta aikaisempi menestyksekäs myyntityö katsotaan eduksesi. Mutta kuitenkin palvelualttiilla ja periksiantamattomalla asenteella pääsee jo pitkälle. Meillä kaupan mahdollisuuksia on tunnetusti paljon - ei kun tarttumaan niihin! Miksi minun kannattaisi hakea töihin juuri Bilar99:lle? ❤️ Pääset töihin tavoitteelliseen ja kunnianhimoiseen porukkaan, jossa jokainen pyrkii parhaisiin mahdollisiin tuloksiin yhdessä. Välillämme on sisäistä leikkimielistä kilpailua, joka synnyttää hyviä tuloksia myyntityössä. 🏆 Olemme Great Place to Work -sertifiotu™ työpaikka! Peräti 90 % työntekijöistämme pitää meitä loistavana työpaikkana ja suosittelevat meitä. Tämä arvostettu tunnustus perustuu henkilöstötutkimukseen, jossa korostuvat tiimihenki, avoimuus ja mahdollisuudet kehittyä. 🤝 Meillä on matala hierarkia ja avoin ilmapiiri, jossa jaetaan tietoa ja tuetaan toisiaan. Työkaverit ovat helposti lähestyttäviä ja yhteistyö sujuu mutkattomasti. Hyväksymme myös sen, että joskus sattuu virheitä - yhdessä korjataan ja mietitään, mitä niistä opitaan. 🚀 Haluamme, että meillä jokainen työntekijä pääsee kasvamaan ammattilaisena. Tarjoamme aina työsuhteen alkuun perusteellisen myyntikoulutuksen sekä yksilöllistä koulutusta aina silloin, kun sitä tarvitset. Kun kokemuksesi karttuu ja tahtotilaa riittää, edessäsi on kiinnostava urapolku myymälävastaavaksi, myyntipäälliköksi ja edelleen vaikkapa aluepäälliköksi, ostajaksi tai koulutus- ja hallintotehtäviin. 💰Onnistumiset myynnissä näkyvät suoraan tililläsi. Palkkauksesi muodostuu pohjapalkasta (700e/kk) lisäksi bonusjärjestelmästä ( 0e-900e/kk) ja itse provisioista, joista muodostuu isoin euromäärä. Keskimäärin aloittavien automyyjiemme kuukausipalkat liikkuvat 3 500 euron paikkeilla, aktiivisimmat myyjämme tienaavat 5000-8000 euroa kuussa. Työsuhteen alussa on myös takuupalkka 3 ensimmäiselle kuukaudelle. 🚤 Lisäksi saat meiltä kattavat työsuhde-edut kuten lounas- ja virike-edun, kuntosali kortin, pyöräedun, auton ostoedun, yhteisiä palloiluvuoroja sekä mahdollisuuden käyttää firman veneitä. Osa eduista tulee voimaan 6 kuukauden jälkeen koeajan loputtua. Kuulostaa hyvältä! Entä mitä toivoisitte minulta? ✅ Nautit ihmisten kohtaamisista ja olet omillasi kun pääset laittamaan oman persoonasi peliin ✅Olet aktiivinen ja tavoitteellinen tekijä. Aina kauppa ei tule helpolla, vaikka meillä mahdollisuuksia siihen riittääkin. Olet valmis käärimään hihat ja menemään tavoitteita kohti rohkeasti. ✅ Sinulla on hyvät vuorovaikutustaidot ja positiivinen palveluasenne. Olet yhtä mieltä kanssamme siitä, että palvelu on onnistunutta, kun se ylittää asiakkaan odotukset! ✅Pystyt hallitsemaan monia asioita yhtä aikaa, sillä työnkuvaasi kuuluu yhteistyötä samanaikaisesti useiden eri asiakkaiden ja yhteistyötahojen kanssa. ✅ Sinulla on B-ajokortti, jotta saat tarvittaessa hurautettua autoja paikasta toiseen. Kiinnostuin! Miten haku etenee? ✅ Hakuaika päättyy 30.11.2025, mutta käymme läpi hakemuksia jo hakuaikana.. ✅ Jos vaikutat porukkaamme sopivalta tekijältä, kutsumme sinut haastatteluun ja pyydämme sinulta vielä lyhyen videotervehdyksen, jos et lähettänyt sellaista jo hakemusvaiheessa. ✅ Seuraavaksi tapaat myyntipäällikön joko Teamsissa tai livenä. ✅ Hakuajan päättymisen jälkeen ilmoitamme kaikille hakijoille valinnoista. ✅ Toivomme, että pääset liittymään porukkaamme ja aloittamaan työt mahdollisimman pian! Etsimme motivoituneita ja energisiä tyyppejä, jotka haluavat kasvaa ja kehittyä kanssamme juuri Bilarilaisena. Henkilökuntamme on autoalan terävintä kärkeä. Jos olet valmis ottamaan seuraavan askeleen urallasi ja liittymään dynaamiseen tiimiimme, haluamme kuulla sinusta! Tervetuloa Bilarille! Lisätietoja: Myyntipäällikkö Miko Uimonen: 040 0604494 Bilar99 on suomalainen kannattavasti ja vastuullisesti kehittyvä vaihtoautoihin erikoistunut autoliikeketju. Meidät tunnetaan siitä että meillä pääsee tekemään aidosti paljon kauppaa ja etenemään uralla yrityksen sisällä! Kaikki lähtee siitä, että henkilöstö ja myyjät ovat hymy huulilla. Tämän takia panostamme erityisesti henkilöstön hyvinvointiin ja tyytyväisyyteen.",
    "status": "new",
    "notes": ""
  },
  "score": 30.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "API",
    "IT"
  ],
  "category": "Low Priority"
}