{
  "job": {
    "id": "38121d567dac63d7",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/analyytikko-retta-isannointi-oy-odevo-finland-value-added-services-yksikko-helsinki-sasca-19785525",
    "title": "Analyytikko, Retta Isännöinti Oy / Odevo Finland Value Added Services -yksikkö, Helsinki",
    "company": "Academic Work",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 27.11.",
    "discovered_date": "2025-12-01T14:37:32.871022",
    "description": "Työ Rettalla (osa kansainvälistä Odevo konsernia) on monipuolista monipuolista, haastavaa ja opettavaista sekä vaatii omaa ongelmanratkaisukykyä. Päivittäisessä työssäni pääsen mukaan mielenkiintoisiin liiketoiminnan kehitysprojekteihin, joilla voidaan aidosti parantaa meidän toimintaa, rakentamaan uusia palveluita ja sitä kautta helpottamaan ihmisten arkea. Lisäksi työkavereiksi saa takuuvarmasti alansa kovimpia ammattilaisia! Tehtävänkuvaus Tehtävä tarjoaa uraansa aloittavalle ratkaisukeskeiselle ja oppimishaluiselle tekijälle hienon mahdollisuuden kurkistaa kiinteistöalalle tehtävässä, jossa jokainen päivä ja viikko on erilainen. Rettalla tapahtuu paljon, joten tiedossa on vaihtelevia projekteja, joiden kautta pääset oman osaamisesi ja kiinnostuksesi mukaan vaikuttamaan omaan työnkuvaasi - tueksesi tehtävään saat kokeneempien kollegoiden osaamisen. Emme odota aiempaa kokemusta vastaavista tehtävistä, mutta jos sinulla on ymmärrystä Power BI:sta, nautit uuden oppimisesta ja itsesi haastamisesta sekä palat halusta sukeltaa syvälle kiinteistöalan syövereihin, saatat olla etsimämme henkilö! Tarjoamme Monipuolisen, vaihtelevan ja haastavan työnkuvan Paikan osana Globaalia johtavaa kiinteistöalan osaajien tiimiä (Retta on osa Odevo-konsernia) Hienoja urakehitysmahdollisuuksia myös vastuullisempiin tehtäviin - kolmesta edellisestä analyytikostamme, kahdesta on kasvanut liiketoimintavastuullisia johtajia Työtehtävät Liiketoiminnan kehitystiimin analyytikkona pääset osallistumaan kaikkiin tiimin jatkuviin ja kertaluonteisiin tehtäviin, joihin kuuluvat: Erilaiset liiketoiminnan kehitysprojektit - keskittyen uusien liiketoimintojen kehittämiseen tai skaalaamiseen Liiketoimintojen muutosohjelmien johtaminen ja tukeminen Lisäarvopalvelut yksikön (Value Added Services eli VAS) strategia työhön osallistuminen Etsimme Soveltuva korkeakoulututkinto (esim. DI, KTM) - voit olla myös opintojesi loppusuoralla tai vastavalmistunut Ymmärrystä ja aikaisempaa kokemusta Power BI:stä sekä hyvät tietoteknisten perustyökalujen hallinta (erityisesti Excel ja PowerPoint) - eduksi katsomme osaamisen/kokemuksen Power Apps, Low-code, sekä kokemukset teknisistä kehitysprojekteista (\"devaaminen\") tai kokemukset tuoteomistajuudesta (\"product owner\") Sujuva suomen ja englannin kielen osaaminen Emme odota sinulta aiempaa kokemusta vastaavista tehtävistä, mutta aiempi tausta rahoituksen, konsultoinnin tai liiketoiminnan kehityksen parista katsotaan eduksi tehtävässä Työntekijänä sinulla on Analyyttisyyttä ja kykyä hahmottaa isoja kokonaisuuksia ja asioiden riippuvuussuhteita Nopeaa oppimis- ja omaksumiskykyä sekä halua oppia jatkuvasti uutta kiinteistöalasta Erinomaiset vuorovaikutus- ja tiimityöskentelytaidot Kunnianhimoa sekä halua kehittyä Rekrytointiprosessimme Academic Work hoitaa tätä hakua asiakkaansa puolesta, jonka toiveena on kaikkien tehtävää koskevien kysymysten osoittaminen Academic Workille. Hakijoita haastatellaan jatkuvasti ja mikäli olemme edenneet jo rekrytointiprosessissa pidemmälle, saatamme sulkea haun ennen lopullisia valintoja. Valintaprosessiin sisältyvät luonteenpiirteitä sekä kognitiivista kykyä mittaavat testit. Testit toimivat työkaluina oikean tekijän löytämiseksi tehtävään sekä takaavat tasa-arvoisen ja oikeudenmukaisen arvioinnin. Retta Isännöinti Retta Isännöinti tarjoaa kattavan palveluvalikoiman asumiseen. Jo sadat suomalaiset taloyhtiöt ovat saavuttaneet palveluidemme avulla merkittäviä säästöjä ja jopa tuloja yhtiölleen. Palveluidemme teho perustuu isoon ostovoimaan sekä asiantuntijoidemme ja valikoitujen yhteistyökumppaneidemme osaamiseen.",
    "status": "new",
    "notes": ""
  },
  "score": 30.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "IT"
  ],
  "category": "Low Priority"
}