{
  "job": {
    "id": "7179fff5100dbbb5",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/ratkaisuarkkitehti-sdsuu-19794260",
    "title": "Ratkaisuarkkitehti",
    "company": "61N Solutions Oy",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 1.12.",
    "discovered_date": "2025-12-01T14:36:16.758026",
    "description": "Etsimme konsulttia rakentamaan kriittisiä tietojärjestelmiä ja kehittymään osana alan parasta työyhteisöä. Kuulostaako hyvältä? Lue lisää ja hae mukaan! Tuleva tiimisi odottaa! 61N on nopeasti kasvava puolustus- ja turvallisuusalan kriittisen suorituskyvyn sekä sitä tukevien tietojärjestelmien suunnitteluun ja kehittämiseen erikoistunut konsulttitalo. Yli 40 asiantuntijan tiimimme koostuu kokeneista ohjelmistoalan ammattilaisista, joista valtaosalla on vahva tausta puolustus- ja turvallisuustoimialan tietojärjestelmistä. Meillä pääset osaksi alan huippuosaajien tiimiä, ja projekteissamme näet konkreettisesti työsi vaikuttavuuden yhteiskunnan turvallisuuteen. Tule kanssamme tekemään työtä sen eteen, että kansallinen turvallisuus on aina askeleen edellä. Roolisi meillä Etsimme tiimiimme ratkaisuarkkitehtia tai ratkaisukonsulttia , joka haluaa kehittyä monipuolisessa IT-ympäristössä turvallisuustoimialla ja olla mukana erilaisten järjestelmähankkeiden valmistelu- ja suunnitteluvaiheessa. Tässä roolissa pääset tutustumaan laajaan järjestelmäkenttään ja työskentelemään vaihtelevien tehtävien parissa – pienistä selvitystöistä aina laajoihin tavoitetilakuvauksiin asti. Pääset näkemään ja vaikuttamaan kehityshankkeiden syntyyn ja suuntaan. Työsi voi sisältää esimerkiksi järjestelmäkartoituksia, integraatiosuunnittelua, vaatimusmäärittelyjä sekä erilaisten IT-ratkaisujen arviointia ja suositusten laatimista. Työtä tehdään tiiviisti sekä oman tiimin että asiakkaan kanssa. Työtehtävät saattavat sisältää myös protojen ja teknologiakokeiluiden toteuttamista. Roolinimike ja työnkuva räätälöidään valitun henkilön tausta ja osaaminen huomioiden. Mitä odotamme sinulta Roolissa onnistuminen edellyttää useamman (noin 5+) vuoden kokemusta ohjelmistoprojekteista tai muista laajoista IT-kehitysprojekteista. Aiempi kokemuksesi puolutustus- ja/tai turvallisuusalan järjestelmistä on eduksi, mutta ei välttämätöntä. Sinulta hoituvat tietojärjestelmiin liittyvät määrittely- ja suunnittelutyöt, kuten toiminnallisuuksien määrittely ja järjestelmäratkaisujen muotoilu. Keskeinen väline suunnitelmien tuottamiselle on niiden dokumentointi. Työssä onnistuminen edellyttääkin sujuvaa suomenkielisen tekstin tuottamista ja kokemusta järjestelmien toiminnan kuvaamisesta visuaalisesti. Kykenet kirkastamaan projektin suunnitelmia, tavoitteita ja toimenpiteitä selkeällä viestinnällä ja yhteistyössä tiimin kanssa. Edellytämme myös taitoa argumentoida arkkitehtuuri- ja suunnitteluratkaisut suullisesti ja vaikkapa valkotaululla esittäen. Lisäksi eduksesi on kokemus joistakin seuraavista osa-alueista (emme odota, että jokainen alue on sinulle tuttu): Data ja analytiikka Integraatiot Ohjelmistoalustat ja infrastruktuurit DevOps Tietoturva ja tietosuoja Puolustus- ja turvallisuustoimiala Huomioithan myös, että tulevassa projektissasi odotetaan säännöllistä läsnätyötä toimistolla Helsingin ydinkeskustassa, mutta satunnaiset etätyöpäivätkin ovat mahdollisia (1-2 pv/vko). Työsuhteen ehtona on hyväksytty viranomaisen turvallisuusselvitys ja mahdollisesti lisäksi huumausainetesti. Tarjoamme sinulle työn, jossa merkityksellisyys on arkipäivää Meidän projekteissamme olet mukana rakentamassa kansallista turvallisuutta –yhteiskunnan tärkeimpiä digitaalisia ratkaisuja. Voimme luvata, että meillä työn merkityksellisyys on läsnä arjessasi! Liittymällä tiimiimme saat myös mahdollisuuden tulla mukaan rakentamaan uutta menestystarinaa – olemme hyvin mielenkiintoisessa kasvuvaiheessa, ja meillä pääset todella vaikuttamaan. Lisäksi tarjoamme: Kilpailukykyisen palkan, joka tämän roolin puitteissa on noin 5000-6000e/kk osaamisestasi ja kokemustaustastasi riippuen Kattavat ja monipuoliset henkilöstöedut mukaan lukien laaja työterveys ja tapaturmavakuutus, liikunta- ja kulttuurietu, lounasetu, yrityksen puhelinliittymä ja koti-laajakaista sekä modernit valitsemasi työvälineet Tuemme tekijöidemme ammatillista kehittymistä yhdessä sovituilla tavoilla, aina mentoroinnista koulutuksiin ja sertifioinneista valmennuksiin Mukavan ja motivoituneen työkulttuurin, jossa tukea on saatavilla ja voit vaikuttaa kasvuyrityksen matkaan Rekrytointiprosessimme Voisiko tämä olla sopiva seuraava askel urallasi? Hae mukaan ja tule kanssamme varmistamaan, että kansallinen turvallisuus on aina askeleen edellä! Hakulomakkeemme on helppo ja nopea: lisää vain yhteystietosi, CV:si ja hakukirjeesi alla olevaan lomakkeeseen. Voit myös jakaa GitHub- ja LinkedIn-profiiliisi tai lisätä muita haluamasi oleellisia dokumentteja. Hakemuksen lähettämisen jälkeen voit myös ilmoittaa järjestelmässä suosittelijasi, jolta pyydämme tässä tapauksessa sähköpostitse suosituksen hakemaasi rooliin. Voit myös ottaa käyttöön Connect-toiminnon, jonka kautta voit kertoa itsestäsi meille lisää ja saat jatkossa tietoa uusista avoimista työpaikoistamme. Voit tutustua meihin lisää myös urasivuillamme ja LinkedInissä! Mikäli sinulla on kysymyksiä roolista tai 61N:stä, voit olla  yhteydessä Principal Consultant Teemu Ekolaan (050 3319807 / teemu.ekola@61n.fi ) 61N. Kansallisen turvallisuuden digitaalinen edelläkävijä.",
    "status": "new",
    "notes": ""
  },
  "score": 20.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "IT"
  ],
  "category": "Low Priority"
}