{
  "job": {
    "id": "76471fad25a9f854",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/product-owner-maventa-scsom-19805716",
    "title": "Product Owner, Maventa",
    "company": "Visma Finland",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 27.11.",
    "discovered_date": "2025-12-05T09:01:59.311320",
    "description": "We are looking for an enthusiastic Product Owner for Maventa to continue our international growth story! Maventa is a state of the art API-first SaaS electronic invoice and document exchange hub, operating in Europe, and serving close to 300 000 companies. Our platform serves tens of millions of transactions each month with superior scalability. What to expect when you join us? E-invoicing is an essential component of Europe's economic framework, and Maventa is at the forefront as the leading e-invoicing operator in the Nordics. We aim to extend our reach to become the leading provider for SMB companies across Europe. This is the perfect opportunity to join a fast-paced company with a committed multinational team working mostly remote. Our SaaS product has a huge impact in automating economies and needless to say we got some really interesting customer pains to solve. Good to understand from our product is that the UI really is playing a side role in it. The focus is on the API. As one of our Product Owners, you will be responsible for invoice receiving. Your key responsibilities are: Guiding the team in making the Product Manager's vision come true, transforming the vision into smaller and concrete deliverables Managing the team's backlog, creating, detailing and prioritising user stories based on customer feedback and company objectives Interacting with our customers and other relevant stakeholders, gathering understanding of their needs Give input to product roadmap planning and execution Utilising data in customer value creation, verifying created value through objective measurements and communication the results to key stakeholders Communicate across the company with Product Manager, Commercial, Marketing, Sales and Support teams when required. Keep track of evolving regulations, what's happening in the industry and in the market, and apply your knowledge to creating the best product. Act as a domain expert within the company, in relevant industry forums and in helping our Marketing succeed. We know that our domain needs some learning so the last bullet points may be something we'll help you grow into! You succeed by having the following: 2+ years previous experience in working as a Product Owner, preferably in SaaS, or as a Business Analyst Relevant education from business or tech. Understanding on how to utilise AI in your daily work Experience with agile methods in software development Ability to keep things simple and easily understandable Willingness to learn new things and having a growth mindset Excellent communication skills and ability to inspire development team and stakeholders A strong understanding of technical concepts to effectively engage in discussions with engineers and stakeholders Knowledge of API-related aspects, including integration and development Fluent English skills. Finnish language skills are not a must, but a plus! Plus for: prior knowledge about the E-invoicing domain or an adjacent domain such payments, AR/AP or ERP business What do we offer? To put it simply, work that matters! E-invoicing has a tremendous impact on societies through automation of B2B/B2G transactions and VAT reporting. Our culture is defined by freedom and responsibility. We take responsibility for our customers, set challenging goals, and give a lot of responsibility for achieving results. We are committed, curious, active, and solution-oriented team players. We also invest in skill development, and we want to help you shine! We naturally have a comprehensive list of benefits, including sports & culture, lunch, extended healthcare, dental and learning resources. You will also have the power of the Visma group and the ambitious, collaborative and fun Maventa team consisting of 50 colleagues backing you up. The salary range in this position is estimated to be 4000-5000 € per month , depending on your experience and background. Please let us know about your salary and general expectations in your application or cover letter. The position is for permanent employment. The recruitment process includes two interviews and a work ability test, with a third interview possible in case we have very equal candidates. We work in a hybrid setting and have an office in Helsinki (Tripla). Working from other remote locations in Finland, such as Tampere or Lappeenranta, is negotiable. Currently we are unable to offer relocation support. We are looking forward to hearing from you Please apply to the position by 21.12.2025 . We want to hear about your experience, skills and salary request in your cover letter and/or CV or LinkedIn profile. We process applications already during the application period, so we hope to hear from you soon! Any questions? Please don't hesitate to contact Rami Sirenius, Team Leader, rami.sirenius@visma.com Maventa is an API-first SaaS product, an e-invoicing platform. We are responsible for a state of the art electronic invoice and document exchange hub, operating in several countries, and serving close to 300 000 companies. Our platform serves tens of millions of transactions each month. Maventa is part of the Visma Group, which is Europe's largest SaaS company. Department Software Development Role Product Owner Locations Helsinki Remote status Hybrid Company Maventa Oy Application deadline 21 December, 2025",
    "contact_name": null,
    "contact_email": "rami.sirenius@visma.comMaventa",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "data",
    "API",
    "agile",
    "product owner",
    "team lead"
  ],
  "category": "Low Priority"
}