{
  "job": {
    "id": "ac48c3d453f839d0",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/fortum-lead-service-designer-digital-consumer-offering-sdsuu-19790668",
    "title": "Lead Service Designer, Digital Consumer Offering",
    "company": "Fortum Oyj",
    "location": "Espoo –",
    "posted_date": "Julkaistu 28.11.",
    "discovered_date": "2025-12-05T09:00:00.805857",
    "description": "Digital Customer Offering (DCO) is a business function within Fortum Consumer Solutions, where business and technology come together. At DCO, we create superior digital offerings and experiences for our 2.4 million consumer and enterprise customers. We innovate and find new ways to digitalize our offerings and processes. We collaborate closely with our stakeholders and external partners. Through cross-functional collaboration, agility and sustainability focus, we strive to make our customers’ increasingly digital lives easier with our services. We serve customers in the Nordics as well as Poland and Spain. About the role Are you passionate about designing seamless, human-centered services that deliver measurable impact? We are looking for an experienced and strategic Lead Service Designer to join our team in DCO. In this role, you will own and drive service design initiatives end-to-end, ensuring our digital services are intuitive, valuable, and aligned with real customer needs. You will collaborate with product teams, business stakeholders, and technology experts to shape service products and experiences that differentiate Fortum in the marketplace. You will also play a key role in strengthening our Design Community of Practice, mentoring peers, and embedding service design principles across the organization. This role is located in Espoo. Key responsibilities: Lead end-to-end service design processes: From discovery to delivery, applying service design methodologies to uncover customer needs and design impactful solutions. Own and refine user testing approaches: Develop and manage our Nordic user panel strategy, ensuring robust testing and continuous improvement. Service improvement: Identify pain points and opportunities in existing services; propose and validate enhancements that improve customer experience and business value. Cross-functional collaboration: Work closely with product managers, UX designers, developers, and business stakeholders to deliver key design artifacts such as journey maps, service blueprints, and prototypes using innovative tools such as TheyDo. Customer-centric development: Use qualitative and quantitative research to inform strategy and design decisions, validating hypotheses with real customer insights. Prototyping and testing: Design and test service prototypes to gather feedback and iterate quickly for both B2C and B2B offerings. Strategic alignment: Translate business objectives into actionable service design initiatives with measurable outcomes. Facilitation and communication: Lead workshops, discovery sessions, and stakeholder alignment activities; communicate design concepts through compelling storytelling and visual artifacts. Community leadership: Mentor and support colleagues to promote best practices and foster a culture of experimentation and continuous learning. About you To succeed in this role, you bring: 8+ years of experience in service design, UX design, or business design, supported by a relevant educational background (e.g., B.Sc . or MBA in Service Design or similar). Proven track record in service design for digital consumer products, ideally in complex, multi-market environments. Strong expertise in user research, design leadership, business design, service design methodologies, and facilitation techniques. Ability to balance strategic thinking with hands-on execution, driving both vision and delivery. Excellent communication and stakeholder management skills, with the ability to influence and align diverse business units. A collaborative, empathetic mindset and passion for creating customer-centric service experiences. Fluent skills in English. Fluency in Finnish will be considered a plus. We offer you At Fortum, you’ll have the opportunity to shape digital services that impact millions of customers while working in a dynamic, forward-thinking environment. You’ll collaborate with talented professionals, contribute to sustainability goals, and help embed service design as a strategic capability across the organization. We offer comprehensive benefits, flexible working hours, and hybrid work model to support your productivity, development and wellbeing. We are committed to build diverse teams where everyone feels included and is treated equally. More information about our culture and benefits can be found here . Interested? Submit your CV at latest on 12th of December . Please include a link to your portfolio showcasing your best service design work or add it as an attachment in the cover letter field in the job application form. We start contacting suitable candidates already during the application period. If you have questions and would like to hear more about the position, please contact Yonatan Kelib via email yonatan.kelib@fortum.com . To be selected for the position, the applicant must go through background clearance and a health examination including drug testing. We are Fortum Fortum is a Nordic energy company. We generate and deliver reliable energy to our customers and the Nordic energy system while at the same time helping industries decarbonise their processes and grow. Our core operations comprise efficient and best-in-class low-carbon power generation, customer services, and heating and cooling. Fortum’s power generation is already 99% from renewable or nuclear sources with one of the lowest specific CO2-emissions in Europe. We are guided by our ambitious SBTi-validated emission reduction targets on our way towards net-zero by 2040. For our ~4,500 employees, we commit to be a safe and inspiring workplace. Fortum's share is listed on Nasdaq Helsinki. fortum.com",
    "contact_name": null,
    "contact_email": "yonatan.kelib@fortum.com",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "title_match": 15.0,
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}