{
  "job": {
    "id": "d663a5a284635d35",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/tyonjohtaja-sdsuu-19781445",
    "title": "Työnjohtaja",
    "company": "JTK Power Oy",
    "location": "Vöyri –",
    "posted_date": "Julkaistu 25.11.",
    "discovered_date": "2025-12-05T09:00:00.804132",
    "description": "JTK Power on erikoistunut vaativien teräsratkaisujen valmistamiseen maailman johtaville yrityksille voimalaitoksiin, rakennusalalle sekä laiva- ja prosessiteollisuuteen yli 60 vuoden kokemuksella. Käytännössä valmistamme äänenvaimentimia, väestönsuojatuotteita sekä tarjoamme mekaanista ja akustista palvelua. Teemme myös vaativia koneistus- ja alihankintatöitä. JTK Power tunnetaan maailmanlaajuisesti alansa parhaasta teknologiaosaamisestaan, toimitusvarmuudesta ja tuotteidensa mittatarkkuudesta. Tuotteitamme löytyy kaikilla mantereilla, jopa 160 maassa. JTK Power muodostuu emoyhtiö JTK Power Oy:stä ja Kiinan tytäryhtiöstä JTK Power Suzhou Co:sta. Työllistämme 140 työntekijää ja liikevaihtomme on 30 M€. Suomessa tehtaamme sijaitsevat Vöyrillä ja Isossakyrössä. Olemme osa ruotsalaista Koncentra -konsernia . Menestyksemme syntyy työntekijöidemme osaamisen kehittämisestä ja arvostamisesta sekä yhteistyöstä asiakkaidemme kanssa. Lue meistä lisää: www.jtk-power-group.com Oletko valmistavan teollisuuden työnjohtamisen ammattilainen? Etsimme sinusta vahvistusta hitsausosastollemme Vöyriin, jossa yhdessä osaavan henkilöstömme kanssa pääset mahdollistamaan vahvan kasvumme. Tule mukaan rakentamaan suomalaisen vientiyrityksen menestystarinaa! Työnjohtaja Tulet työskentelemään yli 40 henkilöä työllistävällä hitsausosastollamme, jossa otat ensivaiheessa vastuun noin 10 henkilön työnjohdosta. Kasvuumme liittyen tiimisi henkilöstömäärä tulee kuitenkin kasvamaan lähiaikoina noin 20 työntekijään. Työtä tehdään päivävuorossa arkipäivisin. Työn suunnittelua teemme uudella toiminnanohjausjärjestelmällämme Monitorilla ja työnkuormitusta vielä toistaiseksi Excel-pohjaisesti. Raportoit vastuualueestasi tuotantopäälliköllemme Jussille. Arjen työtehtäviäsi ovat: Päivittäisen työn organisointi ja ohjaus vastuualueellasi Riittävistä resursseista huolehtiminen ja resurssien tehokas kohdentaminen Tuotannon sujuvuuden, tehokkuuden ja turvallisuuden varmistaminen Tuotantotavoitteiden ja aikataulujen seuraaminen ja niissä pysyminen Työn laadun ja tuotantoprosessien jatkuva kehittäminen Henkilöstön perehdytys, motivointi ja osaamisen kehittämisen tukeminen Aktiivinen yhteistyö sidosryhmien kanssa Päivittäinen raportointi ja toiminnanohjausjärjestelmän käyttö Edellytämme sinulta soveltuvaa teknisen alan koulutusta (esim. kone- ja metallitekniikan koulutus) tai työkokemuksen kautta hankittua vastaavaa osaamista.  Sinulla tulee olla aiempaa kokemusta valmistavan teollisuuden esihenkilötehtävistä, mieluiten konepajateollisuudesta. Arvostamme mahdollista osaamistasi hitsaustekniikoista ja -menetelmistä. Sinulla on hyvät dokumentointi- ja viestintätaidot sekä kyky lukea ja tulkita teknisiä piirustuksia ja standardeja. Työskentely monikulttuurisessa työyhteisössämme edellyttää englannin kielen taitoa. Henkilönä olet järjestelmällinen ja ratkaisukeskeinen tiimipeluri, joka kykenee johtamaan tiimiä määrätietoisesti ja kannustavasti. Sinulla on hyvät vuorovaikutustaidot sekä kyky luoda avoin ja luottamukseen perustuva ilmapiiri tiimissäsi. Arvostamme oma-aloitteisuutta, vastuullisuutta ja halua kehittää sekä itseäsi että työympäristöäsi. Johdat työtä esimerkilläsi ja näet laadun, turvallisuuden ja jatkuvan parantamisen olennaisena osana päivittäistä toimintaa. Miksi kannattaa hakea juuri meille? Alan johtavana toimijana tarjoamme sinulle avaimet onnistumiseen. Meillä on monipuolinen tuoteportfolio, joista on mahdollista räätälöidä aina toimiva ratkaisu kuhunkin asiakastarpeeseen. Olemme tunnettuja laadusta ja toimitusvarmuudesta ja meillä on myös erinomaiset referenssit. Meillä on kiva ja osaava työyhteisö, jossa autamme toisiamme onnistumaan. Lue lisää millaista meillä on työskennellä Työsuhde-etujamme: Kilpailukykyinen palkkaus Lounasetu Epassi: liikunta-, kulttuuri- ja hyvinvointi Kattavat työterveyspalvelut Vapaa-ajan tapaturmavakuutus Tartu tähän mahdollisuuteen ja esittele rohkeasti itsesi! Täytämme paikan soveltuvan henkilön löydyttyä, joten lähetäthän hakemuksesi mahdollisimman pian. Tiedustelut ja hakuohjeet: Lisätietoja tehtävästä antaa rekrytointikumppanimme Mentekin konsultti Jani Kallio numerossa 050 529 2715 tai jani.kallio@mentek.fi Jätä hakemuksesi Hae-nappia klikkaamalla. Tervetuloa mukaan rekrytointiprosessiin!",
    "contact_name": null,
    "contact_email": "jani.kallio@mentek.fi",
    "contact_phone": "0505292715",
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "API"
  ],
  "category": "Low Priority"
}