{
  "job": {
    "id": "fb81de405c1d9749",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/patria-paasuunnittelija-ajoneuvosuunnitteluun-sdsuu-19798250",
    "title": "Pääsuunnittelija ajoneuvosuunnitteluun",
    "company": "Patria Oyj",
    "location": "Hämeenlinna –",
    "posted_date": "Julkaistu 2.12.",
    "discovered_date": "2025-12-05T09:00:00.804425",
    "description": "Patria on työpaikka, jossa rakennat yhteistä turvallisuutta. Meillä tavalliset ihmiset ratkaisevat epätavallisia haasteita. Kun on kyse kriittisistä operaatioista maalla, merellä, ilmassa ja verkossa, osaamisella on merkitystä. Laatu syntyy ihmisistä – jokaisesta meistä. Patriassa sinä ratkaiset. Patria on kansainvälinen puolustus-, turvallisuus- ja ilmailualan luotettu asiakaskeskeisten elinkaaren tukipalvelujen ja teknologiaratkaisujen tuottaja, jolla on vahva kasvustrategia. Protected Mobility vastaa uusien ajoneuvojen ja ajoneuvojärjestelmien myynnistä sekä niiden tarjonnasta ja toimituksista. Meillä on hyvät valmiudet tarjota ajoneuvokalustoamme eri loppukäyttäjille eurooppalaisten ohjelmien, kuten johtamamme Common Armored Vehicle System (CAVS) -ohjelman kautta. Haemme nyt joukkoomme Pääsuunnittelijaa ajoneuvosuunnitteluun. Tehtävässä tuotat ajoneuvoversion rakenteen sarjavalmistusta varten asiakkaan tarpeiden ja ajoneuvon käyttötarkoituksen mukaan. Vastaat versiovarustelun suunnittelusta kokonaisuutena ja huolehdit myös siitä, että muiden toimittajien järjestelmät integroidaan ajoneuvoon oikealla tavalla. Pääsuunnittelijana ohjaat osaltasi muiden suunnittelijoiden työtä, myös alihankintasuunnittelua, ja toimit tiiviissä yhteistyössä Systems Engineerin Managerien ja projektipäällikköjen kanssa. Työtehtävät ovat vaihtelevia, suunnittelutyön lisäksi huolehdit toimitusprojektien onnistumisesta niin aikataulun, tavoitteiden kuin asiakasvaatimusten osalta. Tehtävässä keskitytään erityisesti pyöräajoneuvojen toimitusprojekteihin, mutta projektien salliessa voit osallistua myös tuotekehitykseen. Millaista osaajaa etsimme? Työtehtävässä menestyminen edellyttää useamman vuoden kokemusta ajoneuvotuotteiden suunnittelusta, sekä ymmärrystä laajoista mekaanisista ja sähköteknisistä kokonaisuuksista. Projektilähtöinen työskentelytapa ja kokemus projektihallinnasta ovat selvä etu, kuten myös kyky luoda yhteisiä ratkaisuja mekaniikka- ja sähkösuunnittelun sidosryhmien kanssa. Aiempi kokemus yhteistyöstä toimittajien ja asiakkaiden kanssa on suuri etu. Hakijalta edellytetään sujuvaa suomen ja englannin kielen taitoa sekä lisäksi satunnaista matkustusvalmiutta projektien tarpeiden mukaisesti. Hakijalta toivomme osaamista seuraavilla osa-alueille: Mekaniikkakokoonpanot NX/Teamcenter työkaluilla Rakenteenhallinta Ajoneuvon rakenteiden massan hallinta Eduksi katsotaan: Kokemus tuotevaatimusten käsittelystä. Kokemus ajoneuvojen testauksesta, verifioinnista ja tuotannollistamisesta Mitä tarjoamme: Meillä Patriassa pääset tekemään sellaista, mitä muualla et pääse edes näkemään. Sinulla on mahdollisuus pitkään ja monipuoliseen työuraan Patrian ainutlaatuisten tuotteiden ja toimintojen parissa. Tarjoamme sinulle henkilöstöetuna mm. vuosittaisen tulospalkkiomallin sekä lounas- ja virike-edun. Meillä on kattavat työterveyspalvelut, joihin sisältyy esim. erikoislääkäripalvelut. Tarjoamme myös vapaa-ajan tapaturmavakuutuksen työntekijöillemme. Arvostamme myös vapaa-aikaasi, joten meillä pystyt tasapainottamaan työn ja vapaa-ajan joustavasti esimerkiksi hyödyntämällä liukuvaa työaikaa. Tehtävässä on 50/50 etätyömahdollisuus. Pääset tutustumaan tarkemmin patrialaisiin ja meillä työskentelyyn täältä . Haluaisitko olla osa tarinaamme? Voit jättää hakemuksesi rekrytointijärjestelmämme kautta. Haethan tehtävää 14.12.2025 mennessä. Käsittelemme hakemuksia jo hakuajan puitteissa ja valinnat tehdään heti soveltuvien henkilöiden löydyttyä. Huomiothan, että emme käsittele sähköpostitse lähetettyjä hakemuksia. Lisätietoja tehtävästä antaa Juha Pääskyvuori 📞 +358 40 869 6763 ✉️ juha.paaskyvuori@patriagroup.com Käsittelemme tietojasi luottamuksellisesti. Paikkaan valitulle henkilölle tehdään turvallisuusselvitys ja huumausainetesti. Miksi Patria? 1. Turvaa yhteiskunnalle: edistämme ylpeydellä kansallista ja kansainvälistä turvallisuutta. Siihen tarvitaan vastuullista asennetta ja huippuosaamista, joka takaa toimintavarmuuden kaikissa olosuhteissa. 2. Sinä vaikutat: Patriassa sinä vaikutat työsi sisältöön, urasi kehittymiseen, asiakkaidesi ja koko yrityksen menestykseen. Meillä voit olla juuri niin hyvä kuin ikinä voit olla. 3. Keskity tärkeimpään: tee sitä, mitä rakastat ja näe kättesi jäljet. Olet meille ratkaisevan tärkeä. Haluamme että voit hyvin ja elät töiden ohella täyttä elämää. 4. Mahtava porukka: meillä teet työtä uudistuvassa ja energisessä työyhteisössä, jossa on hymy herkässä. Uskomme, että parhaat tulokset syntyvät hyvässä ilmapiirissä",
    "contact_name": null,
    "contact_email": "juha.paaskyvuori@patriagroup.com",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "java",
    "API"
  ],
  "category": "Low Priority"
}