{
  "job": {
    "id": "1463659",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1463659",
    "title": "Operational manager",
    "company": "LAUNDROMAT OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-28T08:00:07.732+00:00",
    "discovered_date": "2025-12-03T03:03:58.501583",
    "description": "Operational Manager (Entry to Mid-Level):\nWe are looking for a practical and responsible person who enjoys working with their hands and figuring out how things work. You do not need to already be a laundry technician what matters is curiosity, initiative, and willingness to learn step-by-step.\nYou will help keep our self-service laundromat locations running smoothly and make sure customers have a good experience. A lot of learning will happen directly from real situations, with support from teammates across the Baltics.\nThis role is active and varied, not a desk job:\nsome days you will be on-site checking machines and equipment,\nother days you will be answering customer calls or helping on-site,\nand at times you will be preparing improvements or assisting in opening new laundromats.\n\nWhat the job includes::\n- Visiting laundromat locations to check equipment and overall condition\n- Ensuring washing machines and dryers work properly (we will guide you as you learn)\n- Solving practical technical issues when they appear\n- Helping customers by phone and sometimes on-site\n- Keeping track of tasks and making sure they are completed\n- Assisting with installations or adjustments when opening new laundromats\n- Organizing and overseeing cleaning and basic maintenance work\nLearning here is\nhands-on\nand gradual you will build your knowledge step by step.\n\nWho will fit well in this role:\n- You like working with tools and equipment\n- You are not afraid to learn by doing and ask questions when needed\n- You think calmly and logically when solving problems\n- You take responsibility and finish what you start\n- You can plan your time and work independently once you know what to do\n- You speak\nEstonian, English\nand\nRussian\n- You have a\nB-category drivers license\nand\nyour own car\n(fuel and car wear are compensated)\n- You can provide references\nNo formal technical education is required. The key factor is\nmotivation to learn\n.\n\nWhy join us?:\n- The chance to learn practical technical skills that are valuable in many careers\n- Real responsibility and visible results when you fix something, it matters immediately\n- Varied work in different locations (not sitting behind a screen all day)\n- Supportive colleagues across Baltics learning happens together\n- The opportunity to grow into wider responsibilities as your skills develop (technical maintenance, location operations, installation projects)\nIf you are someone who enjoys practical work, wants to learn how equipment works, and takes pride in doing things well we would be glad to talk.\n\nWorking hours::\nFull-time\n\nWorkplace::\nPrimary Tallin, but spots to be supervised could be spread across all Estonia\n\nSalary::\nSalary: up to 2500 EUR/month gross, depending on experience and skill level. Salary increases as your skills and responsibilities grow.\nwww.laundromat.ee",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}