{
  "job": {
    "id": "1465746",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1465746",
    "title": "Accounting System Analyst",
    "company": "Gunvor Services AS ",
    "location": "Unknown",
    "posted_date": "2025-12-02T08:00:07.749+00:00",
    "discovered_date": "2025-12-03T03:03:58.500805",
    "description": "Ootused kandidaadile:\nBachelors degree in Information Technology, Computer Science, Information Systems, or a related field.\nAdditional studies or certifications in Finance, Accounting, or Business Administration are an advantage.\nRelevant Oracle certifications (e.g., Oracle Fusion ERP/EPM, SQL) preferred.\nMinimum 2 years of hands-on experience with Oracle ERP (Financials) and EPM, or Oracle Cloud Services.\nExperience in SQL-based data extraction, validation, and troubleshooting.\nBackground in collaborating with finance and operational teams to gather and translate business requirements into technical specifications.\nPrevious involvement in data migration processes using FBDI templates and validation tools is an advantage.\nSQL for data extraction, queries, and validation.\nBasic understanding of accounting principles and finance processes.\nBasic knowledge of programming languages.\nAdvanced problem-solving and analytical skills.\nStrong communication skills to liaise between technical and non-technical stakeholders.\nSelf-motivated with a positive attitude, willingness to learn new concepts, and readiness to take on challenges.\nFluent in English (spoken and written) any additional language an asset.\n\nTööülesannete kirjeldus:\nThe purpose of the position is to support and enhance the implementation of Oracle Fusion ERP and Oracle EPM, by translating business needs into effective technical solutions, ensuring data integrity, and maintaining smooth system operations.\nThis role is responsible for participating in the implementation, configuration, and maintenance of Oracle Fusion ERP and Oracle EPM systems, as well as related IT finance applications. The System Analyst/Super User will collaborate closely with stakeholders to gather requirements, design solutions, and support data migration and validation processes. The position involves coordinating system testing, addressing technical issues, and bridging the gap between technical teams and business users. Strong SQL skills, a foundational understanding of accounting principles, and effective communication are essential for success in this role.\nParticipate in the implementation of Oracle Fusion ERP and Oracle EPM.\nCoordinate system setup, configuration, and user/system testing.\nAssist in data migration using FBDI templates and validation tools.\nExecute SQL queries for data extraction, validation, and troubleshooting.\nGather business and functional requirements from finance and operational teams.\nTranslate business needs into technical specifications and ensure mutual understanding between technical and non-technical teams.\nDesign, develop, and maintain IT finance applications.\nTroubleshoot system issues and provide user support when required.\n\nOmalt poolt pakume:\nSelf-realization in a dynamic and fast-paced global company.\nAbility to learn from professionals in international environment.\nIn-house trainings not only related to main field of activity but also covering other respective areas.\nSupportive and friendly colleagues.\nGood working conditions and means + very good employee benefit package.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}