{
  "job": {
    "id": "1466039",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1466039",
    "title": "Senior Tech Consultant M365 (Tenant)",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-11T13:08:50.000+00:00",
    "discovered_date": "2025-12-03T03:03:58.501008",
    "description": "Key Responsibilities::\nDefine and maintain tenant-wide policies, baselines, and templates for M365 services.\nLead Exchange Online administration (org settings, transport, role models) and hygiene/mail flow posture.\nGovern SharePoint/OneDrive configuration, information architecture patterns, and sharing/retention defaults.\nManage Teams policies, templates, lifecycle rules, and app/integration permissions.\nCoordinate cross-service change intake and readiness; review release impacts and drive adoption prerequisites with the Adoption Consultant.\nMaintain authoritative admin guidance and FAQs; ensure documentation remains current and traceable.\nMonitor service health/telemetry and drive corrective actions with service owners and security.\nPartner with central governance (e.g., Cloud Governance) to align controls, exceptions, and evidence.\n\nRole Purpose: :\nSuite-wide M365 administration and governance across Exchange, SharePoint, OneDrive, and Teams.\nOwn and evolve tenant-wide M365 guardrails and cross-service configuration that balance security, compliance, and usability.\nLead administration for Exchange Online, SharePoint Online, OneDrive, and Teams; provide expert consulting to product teams and the Adoption Consultant.\nEnsure change readiness and lifecycle alignment across services within the cloud tenant (no L1/L2 end-user support).\n\nWhat do we offer: :\nInclusive and valuing culture\nAt Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks.\nHealth & Wellbeing\nYour physical and mental health is important to us. Take advantage of our various preventive care and support services.\nProfessional and Personal Development\nTake advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings\nMonetary Benefits & Discounts\nKnow that you're appreciated with plenty of employee benefits & discounts just for you.\nFlexibility\nOur diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 25.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0
  },
  "matched_keywords": [
    "architect",
    "architecture",
    "senior"
  ],
  "category": "Low Priority"
}