{
  "job": {
    "id": "1467387",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1467387",
    "title": "Infrastructure Regulations Support Project Manager",
    "company": "Playtech Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-27T11:00:01.187+00:00",
    "discovered_date": "2025-12-03T03:03:58.500667",
    "description": "Infrastructure Regulations Support Project Manager:\nPARENTAL COVER\nFounded in 1999 and premium listed on the Main Market of the London Stock Exchange, Playtech is a technology leader in the gambling industry with over 7,000 employees across 20 countries.\nPlaytech is the gambling industry's leading technology company delivering business intelligence-driven gambling software, services, content, and platform technology across the industry's most popular product verticals, including, casino, live casino, sports betting, virtual sports, bingo and poker. Read more about who we are and what we do here: www.playtech.com & www.playtechpeople.com\nHere at Playtech, we genuinely believe that people are our biggest asset. Diverse thoughts, experiences, and individual characteristics enrich our work environment and lead to better business decisions. Recognizing differences and ensuring our processes are transparent is the core of Playtech's overall commitment to responsible business practices.\nReady to level up your career?\nPlaytech's INFRASTRUCTURE UNIT\nis looking for a proactive\nRegulations Support Project Manager\nwith great communication skills.\nPress play and let us design future technology together!\nJob Description\nYour influential mission. You will...\nLead and coordinate regulatory projects and requests in the Infrastructure Business Unit\nInterpret audit controls to understand what is requested, gather the needed evidence from technical teams & defend it in audit session calls\nBe the representative contact point for all internal & external technical audits (both written and verbal) for the Playtech Infrastructure\nCreate and maintain an information knowledge base in the Infrastructure unit to support the business\nCommunicate inside the Infrastructure unit, the Compliance, Security, and product delivery teams of Playtech to ensure a smooth information flow\nParticipate in the creation of infrastructure-related documentation and policies\nQualifications\nComponents for success. You...\nHave a proactive approach to your responsibilities and a willingness to take ownership of your domain\nHave strong analytical capabilities and attention to detail\nAre confident and excellent communicator, both in verbal conversations and in writing\nKeep cool under pressure and stressful situations\nAre a true team player at heart and skilled in building relationships\nYou'll get extra points for...\nHaving previous experience with standards and regulatory audits\nHaving previous working experience in IT\nHaving previous experience in working with legal documentation and regulations\nThrive in a culture that values...\nInitiative-taking and confident approach at the workplace\nGlobal scope and inclusive working environment\nConstant learning and development opportunities\nActive lifestyle and mental well-being\nFun and engaging company events\nAdditional Information\nREGULATIONS SUPPORT PROJECT MANAGERS TEAM\nThe team is a part of Playtech's Infrastructure unit that provides private cloud platform services to all Playtech Products. Our small, tight-knit team keenly monitors our business unit's compliance with all regulations' requirements and our high standards of responsible gambling. We use our analytical skills to understand audit controls, communication skills to gather and present the needed evidence, and our trait for attention to detail to map it all to our knowledge base.\nPlaytech is an equal opportunities employer. Our mission is to welcome everyone and create inclusive teams. We celebrate differences and encourage everyone to join us and be themselves at work.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 25.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "infrastructure",
    "project manager"
  ],
  "category": "Low Priority"
}