{
  "job": {
    "id": "1468212",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468212",
    "title": "Reisikonsultant / Travel Consultant",
    "company": "SIA INTERLUX Travel",
    "location": "Unknown",
    "posted_date": "2025-11-28T12:02:13.972+00:00",
    "discovered_date": "2025-12-03T03:04:03.257281",
    "description": "Otsime oma meeskonda reisikonsultanti\nMeist:\nInterlux Travel on rahvusvaheline reisikorraldaja, kellel on üle 10 aasta kogemust kvaliteetsete ja nõutud reiside korraldamisel Balti riikides ja väljaspool. Meie meeskond kasvab, mistõttu otsime oma professionaalsesse kollektiivi positiivset, suhtlemisvalmis ja aktiivset reisikonsultanti.\nSinult ootame:\nEesti ja vene keele oskust kõnes ja kirjas\nValmidust õppida ja uusi väljakutseid vastu võtta\nPositiivset ellusuhtumist ja head probleemilahendusoskust\nEnesekindlust arvutikasutamisel ning suhtlemisel e-posti ja telefoni teel\nEelnev töökogemus turismi, müügi või klienditeeninduse valdkonnas tuleb kasuks\nB-kategooria juhiluba on eeliseks\nSinu peamised tööülesanded:\nSuhtlemine reisihuviliste ja klientidega\nSuhete hoidmine reisibüroodega\nReiside soovitamine, pakkumine ja broneerimine\nBroneerimissüsteemide kasutamine (väljaõpe meie poolt)\nOle usaldusväärne reisikonsultant ja tugi klientidele ning partneritele kogu reisi vältel\nPakume Sulle:\nStabiilset töökohta rahvusvahelise kogemusega ettevõttes\nTugevat ja reisisõbralikku meeskonda, kus reisimine on elu osa\nPõhipalka alates 1200 € bruto + tulemuspõhine boonus\nTasustatud vaba päeva sünnipäeval\nPaindlikkust, arenguvõimalusi ja sõbralikku töökeskkonda\nTäielikku sotsiaalset garantiid ning töölepingut vastavalt Eesti seadustele\nVanus ei ole takistuseks oluline on Sinu suhtumine, tahe õppida ja areneda!\nKui tunned, et see töö sobiks Sulle, siis kandideeri juba täna!\nVõtame ühendust vaid järgmisesse vooru pääsenud kandidaatidega.\n\nWe Are Looking for a Travel Consultant\nAbout Us:\nInterlux Travel is an international tour operator with over 10 years of experience organizing quality and in-demand trips in the Baltics and beyond. As we continue to grow, we are looking for a positive, communicative, and proactive colleague to join our professional team.\nWhat We Expect From You:\nFluency in Estonian and Russian (spoken and written)\nOpenness to new challenges and a willingness to learn\nA positive mindset, ability to react quickly, and problem-solving attitude\nConfidence using a computer and communicating via email and phone\nExperience in tourism, sales, or customer service is a strong advantage\nCategory B driver's license (preferred)\nYour Main Responsibilities:\nCommunicate with clients interested in traveling\nMaintain relationships with travel agencies\nRecommend, offer, and book trips while responding to client inquiries\nWork with reservation systems (we will train you!)\nBe a reliable travel advisor and support for clients and partners from start to finish\nWhat We Offer:\nA stable job in a company with international experience\nAn energetic team where traveling is a way of life\nSalary starting from €1200 gross + performance-based bonuses\nPaid day off on your birthday\nFlexibility, opportunities for growth, and a friendly work environment\nFull social guarantees and a contract in accordance with Estonian law\nAge is not a barrier your attitude, drive, and willingness to grow are what matter most!\nIf you feel this could be your next step apply today!\nWe will contact selected candidates for the next stage of the hiring process.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "react"
  ],
  "category": "Low Priority"
}