{
  "job": {
    "id": "1468873",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468873",
    "title": "Platform Operations Engineer",
    "company": "Starship Technologies OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-01T11:00:40.358+00:00",
    "discovered_date": "2025-12-03T03:03:58.500578",
    "description": "Your new adventure:\nAs a Platform Operations Engineer, you will join our global Internal IT team and play an essential part in our mission to provide the world with affordable and environment-friendly deliveries. Every day, our robots are completing thousands of autonomous deliveries in the US, UK and Europe, and were hitting records on an almost weekly basis.\nThis role is a direct step toward proactive Platform Engineering moving us beyond daily operational IT into true system ownership and security optimization. Your primary responsibility will be serving as the resident expert for the security and optimization of our core collaboration and productivity platforms. Your focus will be on eliminating manual work through automation and enforcing a strong security posture.\n\nYour main responsibilities::\nCore Platform Administration: Lead the management of Okta (IAM, SSO, MFA, provisioning) ; administration, security management and automations in Google Workspace, Atlassian (Jira/Confluence workflows), Slack etc.\nAutomation Engineering: Utilize scripting (e.g. Python, PowerShell, Google Apps Script) to automate administrative tasks, eliminate manual work, and build reliable integrations between internal applications.\nSecurity & Governance: Implement access lifecycle management, and regularly review and improve information security in internal tools. Contribute to various regular security assessment reviews.\nTier 2 Escalation: Act as the final technical expert for platform-related issues, providing advanced troubleshooting beyond standard support channels.\nDocumentation: Create and maintain high-quality documentation for configurations, procedures, and governance.\n\nWhat's in it for you? :\nYou will collaborate with people with a strong inner burning and motivation. We are self-aware and seek feedback and improvement. We take pride in our ability to make the most of limited resources to solve problems no one has ever encountered before.\nWe are a fast-growing startup, with great opportunities to grow within the company. Your contribution will matter. There are lots of ways you can make a difference and personally feel the impact.\nYoull have endless opportunities to learn from our inspirational, talented team members across the globe.\n\nWhat we hope you'll bring to the table: :\nHands-on experience in cloud application or systems administration within a fast-growing business environment.\nExpertise in the administration and architecture of at least one of the following: Okta, Atlassian (Jira/Confluence), Google Workspace, or Slack. Since you will be the lead admin for all core platforms, demonstrable experience across a combination of these systems is a significant advantage.\nStrong practical understanding of Identity and Access Management (IAM) principles and security controls (MFA, DLP).\nExperience in scripting for automation (e.g., Python, PowerShell) to manage systems and integrations is a strong advantage.\nExcellent verbal and written English skills are required to clearly communicate complex technical requirements to non-technical stakeholders.\nA strong collaborator eager to work cross-functionally and contribute to shared team goals.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 20.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "negative_keywords": -20.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "python",
    "architect",
    "architecture"
  ],
  "category": "Low Priority"
}