{
  "job": {
    "id": "1468215",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468215",
    "title": "Head of Internal Audit",
    "company": "IPF Digital AS",
    "location": "Unknown",
    "posted_date": "2025-11-14T12:52:31.000+00:00",
    "discovered_date": "2025-12-03T03:04:03.257313",
    "description": "We are seeking a\nHead of Internal Audit\nwho will play a key role within IPF Digital, leading and executing the internal audit strategy across all markets. This role will be responsible for ensuring effective risk management, governance, and control processes, while providing independent assurance and actionable insight to IPF Digital management and the Group Head of Internal Audit. Our ideal candidate will strengthen the organisations ability to manage risks, comply with regulatory requirements, and continuously improve its operations in line with the IPF Digital business strategy.\nAbout IPF Digital (in a nutshell)\nIPF Digital provides fast, flexible, and convenient credit solutions under the Creditea and Credit24 brands to retail customers in Estonia, Latvia, Lithuania, Mexico, Australia, and the Czech Republic.\nOur solutions are designed to be mobile-first with fully digital processes. The technology stack includes a native mobile APP, digital web journeys, and micro-services infrastructure. We offer different type of loan product like instalment loan, credit line, and buy-now-pay-later.\nOur customers might require money for something vital, such as paying an unexpected bill or coping with day-to-day expenses. Or they may be looking for help to carry out home improvements, buy a car, or start a business.\nWhatever they need, we offer innovative financial services that are respectful, responsible, and straightforward.\nKey Responsibilities:\nDevelop and deliver the internal audit plan\n, ensuring coverage of key business risks, including those specific to the E-Money Institution (EMI) in Estonia with Group Internal Audit methodology and regulatory expectations.\nProvide independent assurance on governance\n, risk management, and controls, with focus on EMI compliance and Estonian regulator (Finantsinspektsioon) requirements.\nMonitor e-money licence obligations\n, including safeguarding of funds, capital adequacy, AML controls, and operational resilience.\nEngage with senior stakeholders\nacross IPF Digital and the wider Group to align on risks and regulatory priorities.\nReport and liaise with regulators\n, ensuring timely communication of audit findings, risk assessments, and remediation progress.\nManage audit resources and third-party providers\n, ensuring efficient delivery of the audit plan and adherence to quality standards.\nAdvise leadership\nwith insights on internal controls, governance, and compliance processes.\nPromote a culture of risk awareness and integrity\n, embedding compliance responsibilities across the business.\nStay current on laws, regulations, and best practices\nto drive continuous improvement and best-in-class audit delivery.\nQualifications, skills and experience:\nDegree-level education with\nprofessional accounting qualification\n(ACA, ACCA, CIMA) or equivalent;\nCIA/CMIIA certification\ndesirable.\n7+ years experience\nin risk-based internal auditing within complex, multinational environments, with background in accounting, financial reporting, or business process management.\nStrong knowledge of\ninternal audit, governance, risk, and control frameworks\n, plus understanding of financial products and digital lending models (desirable).\nProven ability to\nmanage senior stakeholders\nand collaborate across geographically dispersed teams.\nExcellent\ncommunication, report-writing, and presentation skills\n, credible with senior leaders.\nStrong\nanalytical and problem-solving abilities\n, able to manage multiple complex projects under pressure.\nSkilled in\ncoaching and mentoring\nto support team development.\nFluent in English; proficient in\nMicrosoft Office\n; willing to travel as needed.\nWhat we can offer you:\nCompetitive salary;\nAnnual bonus;\nAdditional employer health insurance and/or sports compensation (Stebby);\nAnonymous mental health counseling service \"Võõras Sõber\";\nPartial remote work opportunity;\nModern office in Ülemiste City;\nGood work assets;\nParking near the office;\nInternal and external training opportunities;\nCareer and development opportunities;\nFun company and team events - we even celebrate Halloween!\nOpportunity to work in a dynamic and fast-paced environment;\nChance to make a real impact on the growth and success of the company.\nYou will enjoy working at IPF Digital if you value a truly international work environment where you can take responsibility for your tasks; you value a friendly and open work culture and good teamwork.\nHere's how our team describes our culture:\n\"The culture at IPFD is driven by our shared values. People are put first; we accept differences and encourage individuality. Due to our flat business structure, we enjoy collaborating. Although recognition is highly valued, failure is also accepted. Enjoying some good times together is also highly encouraged!\"\nSounds good? :) Then Please Apply, and let's meet up. ;)",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "senior",
    "aws",
    "infrastructure",
    "API"
  ],
  "category": "Low Priority"
}