{
  "job": {
    "id": "1470691",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1470691",
    "title": "Legal Assistant",
    "company": "ESTO AS",
    "location": "Unknown",
    "posted_date": "2025-11-20T11:51:42.000+00:00",
    "discovered_date": "2025-12-03T03:04:03.257210",
    "description": "LEGAL ASSISTANT\nWe are seeking a highly organised and proactive Legal Assistant to join ESTOs Legal team in Tallinn. You will be working closely with our lawyers, customer support, debt collection teams, and external partners to ensure that legal processes run smoothly and that our communication with authorities and debt collection agencies is timely, accurate, and professional.\nIf you thrive in an international, fastpaced, fintech environment, enjoy taking ownership, and want to grow your legal skills, this role is for you.\nKEY RESPONSIBILITIES:\nProvide comprehensive daily administrative and legal support to the Legal team and the rest of the business.\nTake full ownership of the legal inbox, including correspondence with debt collection agencies, regulatory authorities, bankruptcy trustees, bailiffs, police, prosecutors office, courts and other institutions.\nProvide legal and technical support in civil and criminal proceedings, including filing claims, drafting responses and, where needed, participating in court hearings under lawyer supervision.\nEnsure the Legal teams internal knowledge base and documentation are kept in excellent, uptodate order.\nPrepare and file documentation with business registries and other relevant registers.\nConduct targeted legal and regulatory research (including on upcoming regulatory changes) and summarise key findings for the Legal team and stakeholders.\nREQUIREMENTS:\nBachelors degree in Law.\nPrevious work experience in the legal field is an advantage (e.g. law firm, inhouse, court, bailiff, notary, public authority). Experience with financial services regulation in Estonia or the EU is a plus.\nEstonian as a native language or at C1 level and very good command of English, both written and spoken.\nHighly organized, detailoriented, able to manage deadlines and work independently.\nPositive, humble, and collaborative, with strong communication skills and a genuine interest in continuous learning and taking on new challenges.\nWE OFFER:\n🌟 Be Part of Something BIG:\nGain hands-on experience in a fast-growing fintech company.\n🤝 Work with the Best:\nJoin a tight-knit, highly skilled team where open communication and collaboration drive success.\n🏡 Work Your Way:\nEnjoy a hybrid setup, balancing office time and remote work to suit your lifestyle.\n🛡 Weve Got You Covered:\nBenefit from sick leave compensation, additional health days, and a flexible work environment that prioritizes your well-being.\n🎉 Stay Active and Connected:\nTake birthday leave, join fun team events, and enjoy plenty of opportunities to unwind.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -40.0,
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}