{
  "job": {
    "id": "1471460",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471460",
    "title": "Head of Support",
    "company": "Swedbank AS",
    "location": "Unknown",
    "posted_date": "2025-11-21T12:36:02.000+00:00",
    "discovered_date": "2025-12-03T03:03:53.654799",
    "description": "Are you passionate about payment systems, APIs and leading technical teams?\nThe Head of Support & Integration is responsible for managing all customer support, integration and technical onboarding activities and processes within the Paywerk organisation.\nPosition ensures that clients and partners receive timely, compliant, and high-quality support during implementation and throughout the lifecycle of their engagement with different services provided by Paywerk.\nRole requires a strong technical understanding of payment systems, APIs, and financial integrations, combined with leadership skills and experience in regulated payment environments.\nIn Paywerk you have the opportunity to:\nBuild      up, lead and oversee technical and onboarding support function in Paywerk;\nDefine,      own and maintain internal frameworks and processes related to support and      onboarding functions;\nBuild      up support and onboarding team to provide local language support in countries      where Paywerk operates;\nDefine      internal KPIs and quality standards for support function in Paywerk;\nLead      SLA monitoring according co-operation agreements with partners, represent      Paywerk in SLA meetings;\nCollaborate      with other teams In Paywerk to ensure smooth technical onboarding and excellent      support;\nOwn, maintain      and improve developer documentation, reference materials and integration      guides;\nEnsure that Paywerk incident management process is efficient, complaint and integrated with partners incident management processes.\nWhat is needed in this role:\nMinimum      3 years of experience in a similar role within a payment institution,      fintech, or regulated financial services company;\nProven      experience leading technical or customer-facing teams;\nStrong      understanding of payment processing, APIs, and system integration;\nProficient      in support tools and ticketing systems;\nExcellent      project management and stakeholder communication skills;\nFluency      in Estonian is required;\nCustomer first mindset;\nAbility      to see holistic view behind thousands of details;\nStrategic      mindset with strong operational execution;\nExcellent      leadership, interpersonal, and organizational skills.\nWith us, you can experience:\nPersonal and professional growth through self-leadership and continuous development;\nMeaningful work that positively impacts our workplace, our customers, and society;\nAn open and collaborative culture that encourages cross-functional teamwork and provides networking opportunities;\nA supportive and inclusive environment that promotes a balanced and sustainable work-life, with flexible working conditions when suitable for the role;\nBenefits such as our share based reward program Eken, company pension plan, employee offer for banking products, health insurance.\n\" Join our team and...\nbuild Paywerk support function from the ground up - your ideas, your impact, real ownership. Help us turn \"I need help\" into \"Wow, that was fast and simple\".\nIvar Truss\n, your future leader\nWe look forward to your application at 05.12.2025 the latest.\nWe have made our choice regarding recruitment media and therefore kindly decline contact with ad sellers or sellers of other recruitment services.\nIf you are to be employed in Estonia, please note that the salary offered for this position ranges from 3\n,300–4,900 €\ngross i.e. before taxes. Read more here!\nSwedbank does not discriminate anybody based on gender, age, sexual orientation or sexual identity, ethnicity, religion or disability – everybody is welcome.\n#LI-Hybrid #LI-MR1",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "API"
  ],
  "category": "Low Priority"
}