{
  "job": {
    "id": "1471610",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471610",
    "title": "Senior Customer Retention Manager",
    "company": "Malwarebytes Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-21T14:47:25.000+00:00",
    "discovered_date": "2025-12-03T03:03:58.501050",
    "description": "Ootused kandidaadile:\nMalwarebytes is looking for.\n..\nA Senior Customer Retention Manager who can blend analytical and creative thinking to deliver customer-first solutions. Your role will focus on subscription management and customer portal initiatives to drive engagement and retention and will be dedicated to providing engaging and impactful experiences for our customers. We focus on generating sustained growth through innovative and purpose-driven marketing programs.  Reporting directly to the Lifecycle and Customer Experience Director, you will monitor and report on key findings, identify opportunities for improvement, and work cross-functionally to bring ideas to market.\nSkills You'll Need to Have\n:\n5+ years of experience in customer retention and lifecycle marketing\nExperience with subscription products and ecommerce subscription management and payment processes\nA passion for exceptional customer education, engagement, and inventive marketing programs\nStrong analytical skills with the ability to interpret data, identify trends, recognize opportunities, and report findings\nExcellent communication skills and ability to collaborate with stakeholders at all levels\nExperience with product analytics tools and a/b testing solutions like Amplitude and VWO\n\nTööülesannete kirjeldus:\nLead key retention efforts by driving optimization and expansion of key touchpoints, focusing on in-app and customer portal experiences\nUse product analytics, business trends, and customer insights to shape engagement and retention strategies\nPartner with product, lifecycle, and e-commerce teams to improve subscription management capabilities including upsell, renewal, and downgrade flows\nCreate clear and detailed briefs to convey marketing requirements, quantitative goals, and customer intent\nSupport go-to-market efforts for new digital products and services, enabling crosssell, engagement, adoption opportunities\nLead cross-functional projects with minimal guidance, fostering collaboration and building consensus to achieve shared goals and outcomes\nDevelop innovative strategies to drive customer engagement, create habit loops, and demonstrate ongoing value\n\nOmalt poolt pakume:\nComprehensive medical, dental, and vision insurance coverage\nEmployee Referral Bonus Program\nWellness programs\nAn opportunity to do something great for yourself and the world!",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "senior"
  ],
  "category": "Low Priority"
}