{
  "job": {
    "id": "1472277",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1472277",
    "title": "Product Owner (Mechanical)",
    "company": "Stargate Hydrogen Solutions OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-25T15:00:48.938+00:00",
    "discovered_date": "2025-12-03T03:03:58.500831",
    "description": "Role overview: :\nWe're looking for an experienced Product Owner/Mechanical Engineer with strong NPI and product ownership expertise to join our Product Development team at Stargate Hydrogen. You will be responsible for managing the complete mechanical integration lifecycle - from product introduction through serial manufacturing - with a strong focus on engineering documentation control, change management, and ensuring seamless transitions from development to production.\nIf you have hands-on experience with complex mechanical product development, serial manufacturing, ERP systems, and take pride in owning products from conception to scaled production, this role offers the perfect opportunity to make a tangible impact in the hydrogen technology sector. You're naturally detail-oriented, thrive in collaborative environments, and are ready to drive quality and efficiency across engineering, production, and quality functions.\nWe are seeking candidates currently located in Estonia.\nMust-have qualifications:\nUniversity degree in Engineering, Physics or Chemistry\n2+ years in mechanical product development and serial manufacturing\nProven NPI experience from development to production\nStrong CAD and PDM/PLM skills for design and document control\nERP experience in engineering documentation and BoM management\nStrong process orientation and attention to traceability\nExcellent problem-solving and ownership mindset\nStrong teamwork and communication skills in English\nNice-to-have qualifications:\nProject or program management experience\nProduct ownership background, managing design revisions and lifecycle\nAdvanced Inventor and Vault proficiency\nExperience with alkaline electrolyser stacks or components\nExpertise in mechanical design for manufacturability\nKnowledge of hydrogen/process industry manufacturing\nFamiliarity with DfM principles\nUnderstanding of ISO 22734, PED, ISO 9001, ISO 13849\n\nWhat does day-to-day look like in this role? :\nEngineering Documentation & ERP Management\nOwn and maintain mechanical design documentation in the ERP system BoMs, drawings, 3D/CAD data, and specifications. Ensure all records are accurate, traceable, and version-controlled, keeping production, quality, and suppliers aligned with the latest data.\nNew Product Introduction (NPI)\nLead mechanical integration for new product launches, managing the transition from development to serial production. Secure production readiness through complete documentation, validated processes, and qualified suppliers. Coordinate with engineering, production, quality, and supply teams to meet timelines and standards.\nChange Implementation & Design Upgrades\nManage design changes and upgrades driven by production feedback or improvement initiatives. Conduct impact analyses, lead reviews, align stakeholders, and control timing of change implementation to ensure full compliance with updated specs.\nSerial Production Support\nBe the technical bridge between engineering and production. Support troubleshooting, non-conformance resolution, and root cause analysis. Coordinate corrective actions with suppliers and participate in risk analyses (FMEA, HAZOP).\nSupplier Coordination\nDefine and maintain technical specifications for critical components. Oversee supplier documentation, compliance, and communication. Support problem-solving and ensure specifications are implemented correctly in production.\nProcess & Documentation Optimisation\nContinuously improve workflows for product changes, documentation, and supplier management. Capture production and quality feedback to refine NPI and preventive processes for future releases.\n\nWhy us?:\nYou will join a world-class team of 65+ experienced and goal-driven professionals and hydrogentechnology experts\nWe are an agile scale-up wishing to make a difference in a field typically dominated by large andslow behemoths\nWe have secured a €29m state aid via the Important Projects of Common European Interest (IPCEI) framework, and are backed by our existing investors such as UGI and Repsol\nThe performance of our ceramic electrode technology has been independently validated by Fraunhofer IFAM in Dresden, and the performance of our prototype stack by ZSW in Stuttgart\nWhats in it for you?\nYou will be able to contribute to electrolysis technology and its novel applications, thereby participating in creating a net-zero world\nYou can accelerate your career and enjoy professional growth opportunities\nWe have a flexible policy you can organise your work between the office and remotely to get the best results and enjoy flexible working hours\nYou can choose between employer health insurance or sports compensation\nWe organise regular team events and company Summer Days that foster camaraderie, collaboration, and fun outside of the workplace\nIf you're interested in relocation, we're based in Estonia, which offers a flat income tax of 22%, great access to abundant nature and is the most advanced digital society\nWe aim to fill this position at the earliest opportunity, so we encourage interested candidates to submit their applications promptly.\nYou can expect a response from us within two weeks of your application date.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "agile",
    "product owner"
  ],
  "category": "Low Priority"
}