{
  "job": {
    "id": "1474733",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474733",
    "title": "Head of Legal",
    "company": "Marabu Airlines OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-28T08:54:42.804+00:00",
    "discovered_date": "2025-12-03T03:04:03.257257",
    "description": "Requirements:\nMasters degree in Law.\nMinimum of 5 years of relevant legal experience, ideally a combination of in-house and reputable law firm work.\nStrong background in corporate and commercial law; experience in aviation, transportation, or other regulated industries is a strong advantage.\nDemonstrated ability to manage complex contracts, cross-border matters, and multi-stakeholder environments.\nAbility to work independently, prioritize effectively, and provide pragmatic, business-oriented solutions in a fast-paced environment.\nExcellent communication skills in English and Estonian; proficiency in German is considered an asset.\n\nDescription:\nThe Head of Legal will play a critical role in shaping and overseeing Marabus legal function. This position serves as the primary legal advisor to senior leadership and ensures the company operates in full compliance with corporate, regulatory, and industry-specific requirements. The role combines strategic guidance with hands-on legal support across corporate governance, commercial matters, employment law, and risk management.\nResponsibilities\n1. Legal Leadership & Governance\nServe as the primary legal advisor to the CFO, CEO, and senior leadership team.\nEstablish and lead the in-house legal function, including developing internal legal processes, contract templates, and governance frameworks.\nEnsure compliance with all applicable laws and regulations, in cooperation with regulators and external legal counsel.\n2. Corporate & Regulatory\nOversee corporate governance matters, including Board and shareholder resolutions, corporate filings, and group-structure topics.\nSupport corporate restructuring, financing activities, and intercompany agreements.\nAdvise on regulatory matters relevant to aviation, competition, and other applicable legal frameworks.\n3. Commercial & Contracting\nDraft, negotiate, and review a broad range of commercial agreements related to the companys operations.\nSupport the procurement function and ensure adherence to internal policies, compliance standards, and risk management principles.\n4. Employment & HR\nAdvise on employment law in Estonia and other relevant jurisdictions.\nSupport HR with drafting and reviewing employment agreements, internal policies, and employee relations matters.\nProvide guidance on cross-border labor topics, including crewing-related agreements and regulatory requirements.\n5. Disputes, Claims & Risk Management\nManage litigation, pre-litigation, and dispute resolution processes involving customers, suppliers, airports, and regulatory bodies.\nCoordinate with external counsel to ensure efficient and cost-effective dispute handling.\nIdentify legal risks across the business and develop appropriate mitigation strategies.\n6. Leadership & Stakeholder Management\nAct as a trusted advisor to internal teams across the organization.\nBuild and maintain strong relationships with external legal advisors, regulators, and business partners.\nDeliver legal training and awareness sessions to internal stakeholders.\n\nBenefits:\nInspiring and truly unique experience at the newest Estonian airline\nCompetitive compensation package\nAdditional 7 days of vacation per year\nPaid sick leave from first day and three health days\nDevelopment and career opportunities\nFlexible working environment\nOpportunity to work with a dynamic and multicultural industry-leading team\nA modern office in Ülemiste, filled with exciting office events",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "senior",
    "aws",
    "API"
  ],
  "category": "Low Priority"
}