{
  "job": {
    "id": "1474684",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474684",
    "title": "Estonian Language & Culture Teacher (Part-Time/Full-Time)",
    "company": "International School of Estonia",
    "location": "Unknown",
    "posted_date": "2025-11-28T07:59:02.965+00:00",
    "discovered_date": "2025-12-03T03:04:03.256729",
    "description": "Estonian Language & Culture Teacher Vacancy part-time/full time:\nISE is seeking to appoint a part-time\nEstonian Language & Culture Teacher\nto start in February 2026, with the strong possibility of the role growing into a full-time position. International School of Estonia is a private, co-educational, not-for-profit school, located in Estonia (Tallinn).  ISE is a fully authorised International Baccalaureate Continuum World School. It is also accredited with NEASC and CIS, and as such, is the only triple authorised/ accredited International School in Estonia.\nQualifications /prerequisites\nDegree-qualified, certified Teacher with a formal, degree-level studies in language education, preferably with a focus on Estonian.\nAt least 2 years of experience in a similar position.\nAdditional Desirable Qualifications:\nCommitment to model the behavioural competencies of the IB Learner Profile\nTraining and experience teaching the IB Primary Years Programme of the International Baccalaureate\nAn understanding of inquiry learning and the importance of student agency.\nGood skills using instructional technology and experience in differentiated classroom teaching.\nA knowledge of/passion for the International Baccalaureate,\nStrong desire to be an inspiring, motivated educator.\nPractical English language-based experience in a similar position.\nThe Role\nThis part-time position involves teaching students in the primary and middle school.\nWorking Relationships\nYou will form part of a small, closely knit cohort of primary teachers in the school who work collaboratively to maximise learning opportunities for students.\nThe Package\nIn addition to a competitive salary, an accommodation allowance, relocation support, and high-quality international medical insurance is available to overseas candidates. Expressions of interest for the above position close on 31 January 2026. Should a very suitable applicant be identified before that date, the school reserves the right to make an immediate appointment. A letter of interest and introduction, a Curriculum Vitae and the names and contact details of two referees who have been closely involved with you professionally should be sent by email to: vacancies@ise.edu.ee\nPlease note:\nThe school reserves the right to appoint a suitable candidate prior to the closing date. Only candidates shortlisted for an interview will be contacted.\nFurther information about ISE may be found at   https://ise.edu.ee\nKatre Pohlak\nHR Manager",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -60.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}