{
  "job": {
    "id": "1475112",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1475112",
    "title": "Administrative Assistant / Administratiivosakonna assistent",
    "company": "Jaapani  Suursaatkond",
    "location": "Unknown",
    "posted_date": "2025-11-28T14:54:11.000+00:00",
    "discovered_date": "2025-12-03T03:04:03.257336",
    "description": "Administrative Assistant (Administrative and Accounting Affairs):\nThe Embassy of Japan in Estonia seeks a full-time staff for the position of Administrative Assistant including the secretary works.\n1.   Estimated Starting Date:\nMarch-April 2026\n2.   Duties for this position include:\nAssisting with accounting operation.\nCoordinating with vendors, which may involve negotiation.\nAssisting with reception operations.\nManaging schedule.\nSupervising other local staff and providing guidance as needed.\nAssisting diplomats with their daily life in Estonia.\nCollecting information, conducting research, translating and preparing documents in English.\nPlease note: The specific duties outlined above may be subject to adjustment or evolution after the successful candidate joins us, based on their qualifications and the evolving needs of the mission.\n3.   Working hours:\nMonday to Friday, 9:00 am 5:00 pm with a possibility of overtime work. 1 hour of lunch time is included.\n4.   Additional information:\nA competitive salary will be offered, commensurate with the successful candidate's experience and qualifications. Employees are entitled to annual leave, sick leave, and public holidays (in addition to Estonian public holidays, some Japanese holidays are also observed). The specific terms and conditions of remuneration and benefits will be discussed during the interview.\n5.   Requirements:\nEstonian citizenship or Residence permit for employment in Estonia.\nGood mental and physical health.\nFluency in Estonian and English. *While not strictly mandatory, candidates with Japanese language proficiency (JLPT N2 level or higher) will be given strong preference.\nProficiency in computer skills, including Microsoft Word and Excel, etc.\nA university degree.\nExcellent administrative, planning and organizational skills.\nExcellent research and analytical skills.\n6.   Application Deadline: By January 23, 2026\nPlease note: Following document screening, interviews and practical tests (e.g., telephone handling) will be conducted.\n7.   How to Apply:\nInterested applicants are requested to submit their\nCV and a cover letter, both in English\nto the Embassy via email (\nsaiyou@ti.mofa.go.jp\n).\nPlease ensure your CV includes the following essential details: your full name, date of birth, nationality, address, comprehensive contact details (including mobile phone number and email address), educational background, and work experience.\nPlease be assured that all personal information provided will be treated with confidentiality and will only be used internally by the Embassy for the purpose of this recruitment process. It will not be disclosed to any third parties.\nFollowing an initial document screening, only shortlisted candidates will be contacted for an interview.\nEmbassy of Japan in Estonia\nHarju 6, 15069 Tallinn\nE-mail: saiyou@ti.mofa.go.jp\n\nAdministratiivosakonna assistent (haldus- ja raamatupidamine):\nJaapani Suursaatkond Eestis otsib täistööajaga töötajat saatkonna administratiivosakonna assistendi kohale.\n1.   Töö eeldatav algusaeg\n: märts-aprill 2026\n2.   Tööülesannete hulka kuulub\n:\nabistamine raamatupidamistoimingutes;\nsuhtlemine erinevate teenusepakkujatega ja vajadusel läbirääkimine;\nabistamine vastuvõttude korraldamisel;\najakavade haldamine;\nkohalike töötajate juhendamine ja vajadusel nõu andmine;\ndiplomaatide abistamine nende igapäevaelus Eestis;\ninformatsiooni kogumine, uurimistööd, tõlkimine ja dokumentide ettevalmistamine inglise keeles.\nPange tähele: eespool kirjeldatud konkreetsed ülesanded võivad pärast eduka kandidaadi tööleasumist muutuda või täieneda sõltuvalt kandidaadi kvalifikatsioonist ja diplomaatilise esinduse muutuvatest vajadustest.\n3.   Tööaeg\n: esmaspäevast reedeni kl. 9.00-17.00, valmisolekuga teha ületunde. 1-tunnine lõunapaus kuulub tööaja hulka.\n4.\nLisainformatisoon\n:\nPakutakse konkurentsivõimelist palka, mis vastab eduka kandidaadi kogemustele ja kvalifikatsioonile. Töötajale võimaldatakse iga-aastast puhkust, haiguspuhkust ja puhkepäevi riigipühadel (Eesti riigipühadele lisanduvad ka mõned Jaapani pühad). Töötasu ja hüvitiste täpsemaid tingimusi arutatakse intervjuu käigus.\n5.   Nõuded kandideerimiseks\n:\nEesti kodakondsus või elamisluba töötamiseks;\nhea füüsiline ja vaimne tervis;\nväga hea eesti ja inglise keele oskus. Jaapani keele oskus on soovitatav. Kuigi jaapani keele oskuks ei ole rangelt kohustuslik, eelistatakse kandidaate, kes valdavad jaapani keelt (JLPT N2 tase või kõrgem).\narvutikasutamise oskus (Microsoft Word, Microsoft Excel jm);\nkõrgharidus;\nsuurepärased haldus-, planeerimis- ja organiseerimisoskused;\nsuurepärased uurimis- ja analüüsioskused.\n6.   Kandideerimise tähtaeg : 23. jaanuar 2026\nPärast dokumentidega tutvumist kutsutakse väljavalitud kandidaadid intervjuule ja palutakse täita mõned praktilised ülesanded.\n7.   Kuidas kandideerida\nHuvilistel palume saata nii oma\nCV\nkui ka\nkaaskiri ingliskeelsena\nsaatkonnale e-posti teel (\nsaiyou@ti.mofa.go.jp\n).\nCV peab sisaldama järgimisi olulisi andmeid: täisnimi, sünniaeg, aadress, kontaktinfo (mobiiltelefoni number ja e-posti aadress), kodakondsus, hariduslik taust ja töökogemused.\nKinnitame, et kõiki esitatud isikuandmeid käsitletakse konfidentsiaalselt ja kasutatakse ainult asutusesiseselt käesoleva värbamisprotsessi eesmärgil. Neid ei avaldata kolmandatele osapooltele.\nÜhendust võetakse ainult esmase valiku läbinud kandidaatidega, et kutsuda nad tööintervjuule.\nJaapani Suursaatkond\nHarju 6, 15069 Tallinn\nEmail: saiyou@ti.mofa.go.jp",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -40.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "java"
  ],
  "category": "Low Priority"
}