{
  "job": {
    "id": "1476220",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1476220",
    "title": "Timber Sales Manager",
    "company": "Ingka Investments Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-02T07:40:58.000+00:00",
    "discovered_date": "2025-12-03T03:03:56.911093",
    "description": "WHO YOU ARE:\nAs a person you are passionate about people, business, IKEA's purpose and continuously driving better performance. You are energized by increasing customer value, driving business growth and contributing to overall success and results through people. You inspire individuals and teams to accomplish organizational goals.\n\nTo be successful in this role, you have the following::\nA university or educational school degree in a relevant field (e.g., Forestry). Over 4 years of experience in operational or tactical forestry sales decision-making forums. At least 3 years of experience in a leadership position. Proficient in Microsoft Office Package (Word, Excel, PowerPoint and Access) and forest management software and You can communicate confidently and clearly in English.\nAnd of course, you are motivated by living the IKEA culture and values.\n\nAbout the job:\nThe Timber Sales Manager contributes to the growth and secures sustained profitability of the business, in line with and building on the Ingka Investments Direction focusing on maximizing timber sales revenues.\n\nMore specifically, this means you will::\nLead and secure the development of sales\nwhich reflects long and short-term strategic objectives of Ingka Investments and identifies business opportunities in the market;\nDrive the commercial agenda to maximize the net present value of the forest assets;\nManage timber sales, budget items, and goals; monitor KPIs and take action on deviation;\nEnsure full insight / transparency of gross timber incomes and cost items (harvesting costs, transportations costs, etc.);\nManage commercial relations with business partners or contractors of Ingka Investments;\nIdentify appropriate benchmarks that allow for assessing and adapting sales tactics under changing conditions in the timber market;\nSecure access to the forest with commercial purposes.\n\nWe offer::\nExciting and responsible work in an international environment\nExcellent working conditions\nOpportunities for professional development and growth\nWide range of employees benefits\n\nIf you have any questions about the role and responsibilities, please contact Country Manager of Ingka Investments Estonia, Tauno Kusma:\ntauno.kusma@ingka.com\nWe look forward to receiving your application letter and CV till 14th of Dec 2025.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}