{
  "job": {
    "id": "3ec103ddbfbe9b0e",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/fullstack-developer-outdoor-payment-solutions-sok-helsinki-scsle-19701853",
    "title": "Fullstack Developer (outdoor payment solutions), SOK, Helsinki",
    "company": "SOK, Helsinki / Clevry",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 24.10.",
    "discovered_date": "2025-12-01T14:37:32.870033",
    "description": "We are looking for you At Clevry, we are looking for a Full Stack Developer (outdoor payment solutions) for our client SOK. The position is full-time and permanent, with a planned start in January 2026. You will be hired for the position through Clevry. The main office is located in Vallila, Helsinki, and SOK offers a flexible hybrid work model. In this role, you'll join SOK's ABC Digital Team, which is responsible for developing digital services for the ABC business, such as EV charging and ABC mobile. The team works in a modern and agile way, and you'll have the opportunity to build solutions that have a meaningful impact on thousands of users - for example, by improving payment systems or developing new service features. The ABC team is a highly valued and well-liked part of SOK's digital development organization. You'll be surrounded by skilled professionals who share a strong hands-on mindset and use a modern tech stack. This is an opportunity to influence the direction of your work, take part in planning, and help solve real business challenges. Main responsibilities • Full stack development with a focus on backend as part of the ABC digital team • Designing, implementing, and maintaining new features in close collaboration with the team and business stakeholders • Contributing to architecture and design discussions • Writing and maintaining unit and integration tests as part of your development work • Collaborating with designers, product owners, and other stakeholders • Participating in development cycles and team planning sessions • Using AI-powered tools such as GitHub Copilot and AWS AI solutions to support your work What we expect from you • Several years of experience in full stack development, preferably in backend-focused roles • Hands-on experience with some of the following technologies: TypeScript, React, Kotlin, AWS (Lambda, ECS, CDK, Terraform, DynamoDB, RDS), Kafka, Serverless • Experience or interest in mobile applications (React Native experience is a plus) • Ability to work both independently and collaboratively in a team • Good communication skills and a proactive approach to teamwork • Fluent English (written and spoken); Finnish language skills are considered an advantage What we offer • A meaningful and impactful role in SOK's digital development organization • The opportunity to grow your skills with modern technologies and cloud environments • The support of a skilled, close-knit, and friendly team • A hybrid work model (2 days per week at the office / 3 days remote) and flexible working hours • The chance to learn and apply AI-based tools in your daily development work Apply now! If you recognize yourself in this description, please apply for the position by 14.12.2025. However, we urge you to act quickly - we will proceed with potential candidates already during the application period. For more information, contact Recruitment Manager Suvi-Anna Salonen (suvi-anna.salonen@clevry.com, +358 40 487 5157). Please note that we cannot receive applications via email due to data privacy legislation and that we handle all inquiries on behalf of our client company. Additional information about our recruitment process At Clevry, we believe that rather than focusing solely on hard skills, the key to success is based on soft skills and the willpower to rise beyond expectations. Therefore, our recruitment process involves psychometric assessments that evaluate soft skills and cognitive abilities essential for each role. By assessing soft skills, we can help applicants describe their strengths more effectively and find employment quicker and more easily. When applying through us, you will receive a personal feedback report based on the personality assessment. The recruitment process also involves an interview with both Clevry and the client company, so you will get to know both as the recruitment process progresses. Additional information about Clevry For over 30 years we have been the change-maker for more soft skills-driven working life within talent acquisition, assessments, and advisory. We operate globally with customers, consultants, and candidates from North America to Singapore with headquarters in Brighton, Stockholm, and Helsinki. At Clevry we have over 150 soft skills certified recruiters, business psychologists, and experts at your service. We find the right candidate for the job and the right job for the candidate!",
    "status": "new",
    "notes": ""
  },
  "score": 80.0,
  "score_breakdown": {
    "positive_keywords": 70.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "backend",
    "agile",
    "architect",
    "manager",
    "developer",
    "IT"
  ],
  "category": "High Priority"
}