{
  "job": {
    "id": "79b0ca9c2b10c55a",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/test-manager-manufacturing-engineering-scsom-19776271",
    "title": "Test Manager - Manufacturing Engineering",
    "company": "RELEX Solutions",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 28.11.",
    "discovered_date": "2025-12-01T14:37:32.873502",
    "description": "Who we are We're bold thinkers and kind teammates, growing fast but staying grounded. Our Nordic roots and global outlook shape a culture of friendliness, creativity, and collaboration, all powered by openness and shared wins. We care deeply about doing the right thing - and doing it together. We aim to improve the flow of goods, time, and energy - and we know we can't shape the future by clinging to the past. So, we keep evolving, together. What we do RELEX Solutions delivers a unified supply chain planning platform for retailers and manufacturers, enabled by proven AI technology. We help companies optimize demand forecasting, replenishment, merchandising, pricing and promotions, supply chain operations, and production planning across the end-to-end value chain. With a global team of over 2,000 professionals, we work side-by-side with our customers to solve real problems with lasting impact. Companies trust RELEX to increase product availability, boost sales, deliver actionable insights, improve sustainability, and drive profitable growth. Join us and make an impact on the world and your career! In response to our fast growth and market expansion, we are looking for a Test Manager to join our Manufacturing (MFG) department at RELEX. What we need you to do and be Bring your ideas. Challenge ours. Grow with us. You will work with cross-functional teams, including Test Managers, QA Managers, developers, and stakeholders, to ensure quality delivery across our SaaS platform. You will support the design and execution of efficient end-to-end testing approaches in an Agile, multi-project environment. You will contribute to building testing excellence by optimizing test coverage, facilitating collaboration, and embedding testing expertise across the organization. Main Responsibilities: Design efficient E2E testing approaches that maximize business value while minimizing effort and time. Optimize test coverage, execution speed, and scenario prioritization based on risk and complexity at all levels (unit, integration, system). Run a virtual testing team with participants from development teams. Facilitate collaboration and build shared understanding of testing responsibilities and outcomes. Train and coach teams in system-level test design, tools, and practices. Facilitate workshops and embed testing expertise across the organization. Collect and share business process knowledge and cross-product integration expertise. Maintain and develop MFG business use case test data and test environments that mirror standard production configurations. Drive testing innovation and continuous improvement. Lead exploratory testing and problem-solving sessions with the teams. Support Release Managers on quality metrics and status for release readiness. Collaborate with QA Managers and stakeholders in applying the Quality Framework and Strategy. What you'll bring to the table Our five values are our playbook. We speak up when things don't make sense. We stop doing what doesn't add value. We stay curious, back each other up, and make space for both innovation and laughter. Proven experience in Test Management. Strong expertise in designing testing strategies that balance business value with technical constraints. Hands-on experience with E2E software test planning and management in multi-project R&D environments and SaaS platforms. Solid understanding of testing methodologies, quality assurance principles, and the software development lifecycle. Experience with test automation and automation tools. Willingness to learn and share the essence of MFG business use cases. Ability to navigate complex projects and drive initiatives across organizational boundaries. Skilled at facilitating virtual teams and reducing single-point dependencies. Strong communication skills in English, with developers, test engineers, Product Owners, Release Managers, and Business stakeholders. Qualities considered an advantage: Performance testing expertise. Experience in AI-powered testing. Skills in testing tool development. What we offer in return You'll be supported and given the space to thrive. We offer meaningful work, flexibility, and a culture that backs you to share your voice and be authentic. An international career and learning opportunities. A rapidly growing and financially robust software company with exciting opportunities for career growth. Flexible working and genuine work-life balance. Diverse, inclusive, and supportive work culture. Meaningful work with a commitment to a more sustainable future. High autonomy and room for creativity. Strong team spirit through company events, team days, and after-work activities. Family-oriented policies and flat hierarchies. Two paid volunteering days each year. We are a global community of different cultures, voices, and experiences. We celebrate what makes us unique and connect through what we share, in an authentic and safe environment. Together we shape the future, and each other. If you feel this is the opportunity you don't want to miss, you can apply by sending your cover letter and resume through the application form as soon as possible. Please note that to be considered for this position, candidates must be fluent in English, be based in Finland, Portugal or Sweden and hold a valid work permit for that country. We're excited to connect with applicants who meet these criteria and share our passion for shaping the future together. Apply today and be part of the future. Be RELEX!",
    "status": "new",
    "notes": ""
  },
  "score": 70.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "negative_keywords": -20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "API",
    "agile",
    "lead",
    "manager",
    "developer",
    "software",
    "IT"
  ],
  "category": "High Priority"
}