{
  "job": {
    "id": "9d02bf34f05f45c1",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/power-platform-architect-scsom-19627476",
    "title": "Power Platform Architect",
    "company": "Efima",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 21.10.",
    "discovered_date": "2025-12-01T14:36:16.759910",
    "description": "Low-code-kehityksen taituri - haluatko päästä mukaan projekteihin, joissa pääset vaikuttamaan suoraan yritysten ydinbisnekseen ja tuhansien loppukäyttäjien arkeen? Sellaisia olisi nyt tarjolla mitä mahtavimmassa tiimissä! Etsimme Power Platform -osaajiemme vahvistukseksi kokenutta low-code-osaajaa suunnittelemaan ja toteuttamaan asiakkaidemme tarpeisiin soveltuvia liiketoimintasovelluksia sekä nappaamaan liidiä appikehityksestämme. Nyt olisi siis oiva hetki suunnata kohti uusia uratuulia! Tiimissämme työskentelee osaajia erilaisilla taustoilla ja osaamispainotuksilla. Kokemuksesi voi olla karttunut niin low-code kuin pro-code -projekteissa ja esimerkiksi teknisen konsultin, kehittäjän, arkkarin tai leadin tehtävissä. Olennaista on Power Platform -tuotteiden ja Microsoft-ympäristön tuntemus sekä monipuolinen projektikokemus. Mitä siis tulisit meillä tekemään? Power Platform -arkkitehtina Efimalla Ymmärrät asiakkaan liiketoimintatarpeet ja osaat muuntaa ne toimiviksi ratkaisuiksi. Tehtävänäsi on suunnitella niin stand-alone Power Platform -toteutuksia kuin isoja ja kompleksisia kokonaisuuksia, joissa Power Platform on osana toiminnanohjauskokonaisuutta. Suunnittelet ja toteutat Power Apps -sovelluksia asiakkaillemme osana Efiman projekti- tai asiakastiimiä. Toimit kokeneena asiantuntijana monipuolisissa projekteissa ja otat vetovastuun sovituista asiakastoteutuksista. Vastaat työsi tuloksista sekä ratkaisun laadusta. Scrum ja Github ovat sinulle tuttuja juttuja. Ratkot teknisiä ongelmia ja autat asiakkaita sekä kollegoita teknisissä kysymyksissä. Seuraat aktiivisesti teknologiakehitystä sekä jaat osaamistasi organisaatiossa ja asiakkaille. Mitä tuot tullessasi Asiakaslähtöisyyttä - Kuuntelet asiakkaiden tarpeita herkällä korvalla, osaat haastaa niitä rakentavasti ja tunnistaa, missä Efiman -ratkaisut, erityisesti Power Apps, voivat tuoda aitoa lisäarvoa. Rakennat yhdessä tiimin kanssa selkeää visiota teknologian mahdollisuuksista ja viet projekteja määrätietoisesti eteenpäin asiakkaan kokonaiskuva huomioiden. Teknistä taituruutta ja näkemyksellisyyttä - Sinulla on vahvat näytöt onnistuneista Power Platform -toteutuksista ja näkemystä Canvas App:ien, Power Automaten ja Dataversen mahdollisuuksista. Pystyt kokemuksellasi ottamaan appikehityksestä vetovastuuta ja sparraamaan asiakkaita sekä kollegoita erilaisten ratkaisujen suhteen. Joustavuutta ja kehittymishalua - Viihdyt projektiympäristössä vaihtelevien työtehtävien ja työpäivien parissa. Näet uudet tilanteet mahdollisuutena oppia yhdessä kollegoiden kanssa, ja sinulla on aitoa innostusta syventää Power Platform -osaamistasi edelleen. Mitä lisäksi arvostamme (mutta emme odota sinun hallitsevan näitä kaikkia) Näkemystä AI:n sekä agenttien mahdollisuuksista Kokemusta Power Pagesista Osaamista JavaScriptistä ja CRM plugin:eista Tietämystä Azure Logic Appsista tai muista integraatioalustoista Ymmärrystä käyttöliittymäsuunnittelusta Mitä me lupaamme sinulle Kehittämiseen ja kokeiluun kannustavan ilmapiirin - Efima on digitaalisen muutoksen ja automaation edelläkävijä. Toimme ensimmäisten joukossa Microsoft Power Platform -alustaa Suomeen ja olemme saaneet edelläkävijyydestämme myös tunnustuksia. Erityisen ylpeitä olemme Microsoftin 2022 myöntämästä \"Vuoden Power Platform -kumppani Suomessa\" pystistämme sekä voimassa olevasta Microsoftin Low-Code Advanced Specialization tunnustuksesta. Lupaamme, että meillä pysyt kärryillä teknologiakehityksestä ja pääset yhdessä kollegoidesi kanssa muovaamaan low-code-kehittämisen tulevaisuutta Suomessa! Merkittäviä projekteja ja kehittymismahdollisuuksia - Pääset ottamaan vastuuta erilaisissa asiakasprojekteissa, hyödyntämään osaamistasi ja oppimaan uutta matkan varrella. Tiimimme on rakentanut tähän mennessä lähes 100 Power Platform -ratkaisua asiakkaillemme, jotka ovat pääasiassa suomalaisia suuria ja keskisuuria yrityksiä. Toteuttamamme Power Platform -ratkaisut tehostavat mm. asiakkaidemme taloushallinnon ja toiminnanohjauksen prosesseja. Täältä löydät lisätietoa kehittämistämme sovelluksista. Ainutlaatuisen yrityskulttuurin - Työntekijämme nostavat ensimmäisinä esiin työilmapiirin ja yrityskulttuurimme asioiksi, jotka erottavat Efiman heidän aiemmista työpaikoistaan. Yrityksemme arvot elävät aidosti arjessa. Etenkin \"omana itsenä\" ja \"yhdessä eteenpäin\" ovat monille efimalaisille arvoistamme lähellä sydäntä. Täältä pääset tutustumaan efimalaisiin uratarinoihin, jotka raottavat kulttuuriamme lisää. Joustavuutta ja hyvät edut - Tehtävä on vakituinen ja sijaitsee siellä missä sinäkin! Tuemme efimalaisia tasapainoisessa (työ)elämässä: sinulla on vapaus valita, kuinka paljon haluat työskennellä etänä, ja kuinka paljon toimistoillamme Helsingin ydinkeskustassa Kaivopihalla tai Tampereen Tulli Business Parkissa. Huolehdimme siitä, että arkesi rullaa, työkaverisi ovat tukenasi ja työvälineesi kunnossa niin kotitoimistolla kuin konttorillakin. Lisäksi tarjoamme tietenkin henkilöstöllemme kattavat edut ja vakuutukset. Mitä seuraavaksi? Tartu tilaisuuteesi ja ilmianna osaamisesi meille oheisen linkin kautta (onnistuu myös pelkällä LinkedIn-profiililla). Käymme hakemuksia aktiivisesti läpi ja olemme sinuun yhteydessä rekrymme edetessä. Mikäli sinulla on mitä tahansa kysyttävää rooliin tai tiimiimme liittyen, ole matalalla kynnyksellä yhteydessä tiiminvetäjäämme Millaan: Milla Blomqvist, milla.blomqvist@efima.com / +358 50 589 8013.",
    "status": "new",
    "notes": ""
  },
  "score": 70.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "java",
    "javascript",
    "API",
    "lead",
    "architect",
    "IT"
  ],
  "category": "High Priority"
}