{
  "job": {
    "id": "1003ec7b38b00fcb",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/data-architect-sfsut-19505063",
    "title": "Data Architect",
    "company": "Futurice",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 11.8.",
    "discovered_date": "2025-12-10T15:09:57.236821",
    "description": "Join us! If you're ready to start the next chapter in your career journey, you've come to the right place. We're always happy to hear from people who are eager to learn and grow, and share our values. Read more about the role and apply. About the role Data Architects at Futurice are generalists working across industries to help clients solve their important challenges in business and technology. They work with digital services, software development and improving how digital is done in big organizations. Architects have a wide understanding of technology and a toolset of modern frameworks and methodologies. They often have years of experience in software development but have extended the scope of problems to tackle as they also want to see the impact being made to organizational issues. As a Data Architect you truly get a deep-dive into a client's data. Guided by business and user needs, Data Architect at Futurice designs end-to-end overall architecture, which is needed to ingest, process, store and publish data for further usage. You will e.g. work on Designing and building data platform, data mesh and data warehousing solutions in the cloud. Planning architecture and building infrastructure for data ingestion, processing, analytics, visualizations and business intelligence systems. Integrating AI/Machine learning inference as part of a data platform. Data governance and (conceptual and logical) data modeling. Designing and implementing data pipelines to handle different types of source data. Here you can explore more about Futurice's Data story and watch our webinars around the topic. Here are some practical things that would definitely help succeeding: You have a solid experience in designing software architectures and can communicate them both to business decision makers and technology experts in a clear way. You can design and build cloud-based solutions (such as AWS, Azure, GCP, Snowflake) utilizing data warehouses, databases, machine learning and business intelligence. You have been designing batch and streaming data processing. You understand master data management, data governance and data catalogs. You understand data regulations like GDPR and how it affects development and utilizing data assets. Expertise in agile software development and methods (e.g. Scrum, Kanban). You are familiar with modern Dev/Data/MLOps best practices and tools. We'd love to hear that you have been described as a person with Good leadership skills in achieving momentum, action and results. Ability to ask the right questions and drive troubleshooting with experts. Thought leader and influencer: public speaking, tech articles, etc. Willingness to take a step in the abstraction level to solve organizational issues and drive towards results in big projects. Ability to work in diverse work cultures and comfortable with nonhierarchical organizations. Appreciation for a good communication with both the team and the clients. You are fluent in Finnish and English. Futurice offers you Besides our overall cultural and organizational model, we support your growth as a professional. As an agency, we have a versatile portfolio of projects, and we solve different kinds of problems that require different kinds of tools. For you, this means the chance of a lifetime to pursue your learning goals and broaden your skill set. You will be inspired and supported throughout your journey. On top of this, you get the opportunity to work with the most motivated and multi talented forces in development, design and strategy. In addition, we listed here some of the perks we offer: Futurice Hybrid Work Model Free choice of laptop, phone, tablet, headphones and other work gear Sports and lunch benefit Futurice's clubs for free-time activities Learning events Certification programs Compensation Your complete compensation package will be discussed in detail during the recruitment process. Our salary model is designed to offer a range of levels based on three factors: skills, responsibilities and impact. We are dedicated to fostering an inclusive and supportive work environment where every employee has the opportunity to thrive and advance in their career and become better versions of themselves. During the initial interview round, we will discuss the salary range for this position. We offer a fixed salary with the possibility of performance-based bonuses and additional benefits. Next steps If this sounds like the opportunity you've been looking for and are ready to take the next step, please submit your application. Our application form is about as easy as it gets. All you need to do is enter your contact information and upload your attachments. We'd love to see a CV, and a few lines about yourself and why you want to join Futurice. If you need some inspiration, read our tips on how to stand out from the other applicants. You can also submit links to your LinkedIn and/or GitHub profile or your portfolio, as well as share other attachments relevant to the application. After we receive your application, we will reach out to you. Those selected for the interview phase can look forward to an initial discussion that will help us get to know you better, and you to get more info about life at Futurice. This is followed by an in-depth talk with your potential future colleagues to dive deeper into your professional skills. Finally, there's a general chat to discuss things like your potential future projects. It is also worth mentioning that reference calls are an integral part of our recruitment process. How we work Ever since Futurice was founded, we've been committed to offering a workplace people will genuinely enjoy coming to every morning, Mondays included. We've put tons of effort into fostering a healthy and welcoming company culture combined with fair and competitive salaries as well as perks that improve the wellbeing of each Futuricean - take a look here to learn more, check our Culture handbook 2.0. and get to know some of our people through their career stories. Each of our offices also adds its own unique vibe and flavor into the mix. Learn more about our offices here ! At Futurice, new joiners are not expected to fit into a specific mold - people are free to come as they are, regardless of their background. We believe there's power in perspectives and consider diversity an important part of our success. You can learn more about our DE&I commitment and efforts here .",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 100.0,
  "score_breakdown": {
    "positive_keywords": 100.0,
    "title_match": 15.0
  },
  "matched_keywords": [
    "data",
    "architect",
    "architecture",
    "aws",
    "azure",
    "gcp",
    "infrastructure",
    "database",
    "agile",
    "scrum"
  ],
  "category": "High Priority"
}