{
  "job": {
    "id": "317b17496af3a8f4",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/alfame-systems-ohjelmistoarkkitehti-java-react-aws-helsinki-sdsuu-19815454",
    "title": "Ohjelmistoarkkitehti (Java, React, AWS)",
    "company": "Alfame Systems Oy",
    "location": "Helsinki ja 2 muuta –",
    "posted_date": "Julkaistu 9.12.",
    "discovered_date": "2025-12-10T15:09:57.232256",
    "description": "Arvostatko sitä, että suunnittelun lisäksi pääset ohjaamaan teknistä toteutusta oikeaan suuntaan? Ohjelmistoarkkitehdin saappaissa pääset vaikuttamaan vahvasti siihen, millainen ratkaisu asiakkaan tarpeisiin kehitetään ja millainen meininki tiimissä on. Millaisia projekteja on luvassa? Alfamen asiakkuudet ovat pääosin julkiselta sektorilta. Niissä pääset luomaan tärkeitä palveluja kaikelle kansalle, muuttamaan suomalaista yhteiskuntaa sujuvammaksi ja kokemaan oman työsi merkitykselliseksi. Olemme keskittyneet erityisesti tieto-, käsittely- ja asiointipalvelujen suunnittelemiseen ja kehittämiseen. Toimimme pilviympäristössä mikropalveluarkkitehtuurin parissa. Asiakkaiden ongelmien ratkomisen lisäksi uusien teknologioiden tutkiminen ja soveltaminen on meille mieluista puuhaa. Tällä hetkellä meille tuttuja teknologioita ovat esimerkiksi Java, Spring Boot, Javascript, Typescript, React, Next.js, Node.js, Docker, Quarkus, GitLab, SonarQube ja AWS. Ohjelmistoarkkitehdin rooli ja työtehtävät Määrittelet, suunnittelet ja toteutat selainpohjaisia palveluja asiakkaiden tarpeisiin. Arkkitehtina työpanoksesi on tärkeä etenkin projektin käynnistys- ja viimeistelyvaiheissa. Tuet tiimiä omalla osaamisellasi ja piirrät kokonaiskuvaa projektista. Otat teknisen vetovastuun uudesta projektista , johdat tiimiä ympäristön pystyttämisessä ja keskustelet asiakkaan kanssa muutostarpeista ja ratkaisuun vaikuttavista yksityiskohdista. Tuet tiimiä omalla osaamisellasi ja piirrät kokonaiskuvaa ratkaisusta . Huolehdit säntillisestä dokumentaatiosta ja katselmoit kokonaisuutta. Sparraat myös muiden arkkitehtien kanssa. Pidät huolta hyvästä asiakaskokemuksesta osana arkista yhteistyötä. Viilaat omaa toimintaamme jatkuvasti paremmaksi yhdessä työkavereiden kanssa. Voit olla kiinnostunut myös uusien myyntimahdollisuuksien spottaamisesta ratkaisukonsultin roolissa Mitä odotamme sinulta? Sinulla on jo muutaman vuoden työkokemus vastaavista ohjelmistoarkkitehdin tehtävistä. Hallitset pilviympäristöt ja teknologioiden osalta Java, React ja AWS ovat sinulle tuttuja. Omaat vahvan sovelluskehitystaustan ja haluat pistää kätesi saveen myös koodin parissa. Yhteistyötaitosi ovat erinomaiset. Ymmärrät tiimityön hyödyt ja edellytykset. Valmentava rooli ja oman osaamisen jakaminen on sinulle luontevaa. Työskentelet sujuvasti suomen kielellä . Eduksi katsotaan soveltuva korkeakoulututkinto ja palava halu uusien asioiden oppimiseen. Mitä tarjoamme sinulle? Palkka muodostuu roolisi ja osaamisesi mukaisesti yhdessä keskustellen ja käytössäsi on kattavat edut. Sen lisäksi tarjoamme sinulle jotain ainutlaatuista: Mahdollisuuden vaikuttaa: Pääset työskentelemään yhteiskunnallisesti merkittävissä projekteissa sekä julkisen että yksityisen sektorin parissa. Hakkeruus: Uteliaisuus ja rohkeus kokeilla uutta ovat toimintamme ytimessä. Tuemme osaamistasi Hakkeriakatemian, koulutusbonusten ja henkilökohtaisen urasparrauksen avulla, jotta voit kehittyä datatalouden asiantuntijana. Vapaus ja vastuu: Ohjaat itse omaa työelämääsi ja vaikutat yhteiseen matkaamme. Mahdollisuudet ovat laajat ja kasvavat koko ajan, erityisesti datatalouden kentällä. Palkittu kulttuuri: Olemme useaan otteeseen sijoittuneet Great Place to Work -tutkimuksessa kärkisijoille, ja saimme ykkössijan vuonna 2020. Arvojemme mukainen toiminta on meille ensiarvoisen tärkeää. Mahtava tiimi: Meillä työskentelemme tiimeissä, eikä yksinäisiä susia ole. Järjestämme monia yhteisiä vapaa-ajan aktiviteetteja, ja kollegoista tulee helposti ystäviä. Joustavuus: Tarjoamme paikkariippumattoman ja joustavan työkulttuurin, joka mahdollistaa elämän eri vaiheet. Meillä sinäkin pääset tekemään urasi parhaita töitä ja osallistumaan datatalouden tulevaisuuden muokkaamiseen! Lue lisää Alfamesta työpaikkana täältä . Hakuprosessi Esittäydy meille CV:n kera hakulomakkeen kautta. Kerrothan myös ajatuksesi sinulle sopivasta palkkahaarukasta. Käymme yhteydenottoja läpi viikoittain ja vastaamme sinulle mahdollisimman nopeasti. Kaikki tapaamiset hoituvat toiveittesi mukaan etänä tai livenä: Keskustelu Talent Acquisition Manager Susanna Huhmarniemen ja teknisen rekrytointivastaavan kanssa (Helsinki / etä) Tapaaminen tulevien työkavereiden kanssa (Helsinki / Kokkola / Rovaniemi / etä) Sopimusasiat HR:n kanssa (Helsinki / etä) Tehtävään valitulle henkilölle voidaan tehdä henkilöturvallisuusselvitys. Toivottavasti kuulemme sinusta pian! Alfame on perustettu vuonna 2004. Sydämemme sykkii erityisesti ohjelmistokehitykselle ja prosessiautomaatiolle. Kasvamme vauhdilla mutta vakaasti ja ilman yrityskauppoja. Tällä hetkellä meillä on reilut 100 työystävää ja toimistot Helsingissä, Tampereella, Rovaniemellä, Kokkolassa ja Turussa. Paikkariippumaton ja joustava työkulttuuri on meille arkipäivää.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 70.0,
  "score_breakdown": {
    "positive_keywords": 70.0
  },
  "matched_keywords": [
    "javascript",
    "java",
    "typescript",
    "react",
    "data",
    "docker",
    "aws"
  ],
  "category": "High Priority"
}