{
  "job": {
    "id": "bca0564bfba12d0e",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/senior-cloud-test-engineer-svsai-19817312",
    "title": "Senior Cloud Test Engineer",
    "company": "Vaisala Oyj",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 10.12.",
    "discovered_date": "2025-12-10T15:11:28.068085",
    "description": "We are looking for a Senior Test Engineer to join our Industrial Measurements Products and Technologies team at Vaisala headquarters in Vantaa, Finland. Vaisala is a global leader in measurement instruments and intelligence helping industries, nations, people, and the planet to thrive. From predicting hurricanes to optimizing renewable energy production, our technology is used where it matters the most - from data centers, windfarms and laboratories to airports, the Arctic and even the surface of Mars. Vaisala is recognized in TIME Magazine's World's Best Companies in Sustainable Growth 2025 study. Our team of over 2,400 experts and 59 nationalities around the world is committed to taking every measure for the planet. Driven by our shared purpose, curiosity, and pioneering spirit, we stay ahead and make a difference. At Vaisala, you don't have to fit in to belong. Why join us? You get to work with IoT platform behind Vaisala Echo , enabling clients across different sectors solve challenges in environmental indoor, and process measurements You'll be joining a dynamic and innovative team of seven persons that is shaping the future of IoT and environmental data analytics, making this a truly exciting opportunity The latest employee experience survey results show that people like it in the team: engagement index has been 4.2/5 and the wellbeing index 4.3/5 The Hiring Manager Eduardo Murillo describes his leadership as follows: \"A sense of importance and ownership at work is important for motivation, and we're pioneering ways to make it happen.\" What's your role? Partner with senior developers, QA engineers, and product owners to architect and deliver high-reliability, high-availability solutions that consistently meet complex and evolving customer requirements. Work hands-on with advanced, production-scale cloud environments, including AWS services used for secure backend operations, scalable data flows, and automated governance controls. Own contributions across the entire software lifecycle, from design through automated deployment, ensuring every step meets enterprise-grade standards. Actively shape and refine agile practices by driving retrospectives, leading process improvements, and demonstrating a strong sense of technical ownership within the team. Translate customer and field feedback into roadmap-level design decisions, influencing not just your own work but the direction of the product architecture. What will you bring? Deep understanding of testing strategy and ability not just to reference but to apply and architect an effective testing strategy using the testing pyramid-and adjust it for complex, Microservices-based systems. Proven, practical experience designing and executing system level test scenarios for integrated, multi component distributed systems, not just theoretical familiarity AWS Cloud competency that consists of hands-on experience with AWS identity/user management, cloud security principles, and the ability to implement QA-related policies in a production environment. Ownership and understanding of CI/CD concepts plus the practical ability to design, maintain, and troubleshoot automated pipelines end-to-end. Ability to work with engineers to ensure meaningful unit and integration test coverage, and to guide best practices when needed. Skillful when executing structured manual testing when appropriate, without compromising testing standards. Fluency in Python with the ability to write reliable, production-quality test automation frameworks and tools. Bonus: practical understanding of the C++ ecosystem and ability to contribute to mixed-language testing environments. For additional information please contact Development Manager, Eduardo Murillo, eduardo.murillo@vaisala.com. Please note that applications sent via email cannot be processed due to privacy reasons. Ready to take every measure for the planet? Apply at the latest on January 4th, 2026 via the application form. We know this is a busy time of the year, so we want to offer an extended application period. That way, no matter where or when you are celebrating holidays, you will still have the chance to apply for this fascinating position.",
    "contact_name": null,
    "contact_email": "eduardo.murillo@vaisala.com",
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 100.0,
  "score_breakdown": {
    "positive_keywords": 120.0,
    "title_match": 15.0
  },
  "matched_keywords": [
    "python",
    "data",
    "architect",
    "architecture",
    "senior",
    "aws",
    "ci/cd",
    "backend",
    "API",
    "microservices",
    "agile",
    "product owner"
  ],
  "category": "High Priority"
}