{
  "job": {
    "id": "c427766451a67521",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/senior-product-owner-customer-management-sospp-19807856",
    "title": "Senior Product Owner, Customer Management",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 5.12.",
    "discovered_date": "2025-12-10T15:11:28.067598",
    "description": "Are you ready to lead the development of next-generation customer relationship systems in the non-life insurance domain? Do you have the vision to act as the bridge between business needs and modern technology? Could you be the leader who maximizes customer value by steering the lifecycle of our critical systems? Here at Pohjola Insurance we are transforming our core capabilities related to customer data management. We are now seeking a Senior Product Owner for a full-time, permanent position. You can be based in either Helsinki or Oulu, and we support a flexible hybrid working model that allows you to work remotely from within the borders of Finland. You will lead the development and transformation of our customer relationship systems to serve both consumer and corporate customers. A few words about the job In this role, you will drive innovation by steering and prioritizing the lifecycle of critical systems-both existing and new. You will maximize customer value by defining priorities and development content that delivers real impact. You will not be alone; your team will be supported by experienced technical roles such as a Tech Lead for architecture and a Service Product Owner for production coordination. Together, you'll create solutions that matter and the blueprint for Pohjola's modern software development. Your key responsibilities will include: Leading a modern software development team Leading transformation as a key player in our journey to a modern, centralized platform. Collaborating across teams, acting as the bridge between business and technology, ensuring commercial, technical, and regulatory needs are met. Creating clear, business-driven roadmaps for multiple stakeholders. Where the person is coming to work You will be joining a multinational team where collaboration and trust thrive. This is a chance to have an impact at scale: your work will shape the future of insurance technology for thousands of customers. We offer a modern tech environment where you will be part of a major transformation to cloud-based platforms and cutting-edge solutions. We value flexibility and balance, offering hybrid work options and flexible hours to suit your life. If you are looking for career growth, this is an opportunity to develop your skills and advance in a leading financial services group. What we expect from you? We are looking for a professional with solid experience in a Product Owner or manager-type development role, combined with a strong knowledge of agile software development processes and methods. Familiarity with the non-life insurance business is an advantage, though not a mandatory requirement. Ideally, you have: Proven ability to lead a multinational team where collaboration and trust thrive. Hands-on experience with cloud-based systems and modern technology environments. A talent for balancing business and technology priorities to meet commercial goals and stakeholder needs. Excellent communication skills in English, both written and spoken. Finnish language proficiency is a plus but not a requirement. Familiarity with data management and data governance is a plus, as you will be working closely with our data subject matter experts and owners. What we will offer you As a counterbalance to responsible work, we take care of your well-being and future-oriented work arrangements. We offer you a stable environment where responsibility, human touch, and mutual success are key values. You get access to our versatile employee benefits, which include staff-based banking, insurance, and loan services. We also offer comprehensive occupational health care, extensive medical expense insurance, and full-time accident insurance. We invest in everyday balance and flexibility as well as offering you lunch, exercise, and cultural benefits and the opportunity for inexpensive vacations in OP Pohjola vacation shares. Further information and application instructions Apply for the position by sending us your CV and cover letter through our recruitment system by 4.1.2026. The application period is longer than usual due to the Christmas and New Year holidays. We would love to hear more about your skills and motivation for this role. Please also indicate your salary expectations in your application. Further information about the task and working with us is provided by Competence Lead Tiina Mäntykangas at +358 443 264 397 on 8th December at 12-13 or on 15th December 10-11. We operate in the financial sector and our business is founded on trust and accountability. For this reason, we will check the successful candidate's credit history, corporate connections and potential conflicts of interest. In addition, the successful candidate must take a drug test and will be subject to a security clearance vetting by the Finnish Security and Intelligence Service. OP Pohjola - We have something in common Diversity and equality are highly prized at OP Pohjola. We want everyone to feel welcome and valued, and we appreciate that diversity enriches us and brings new perspectives. We invite job applications from everyone, because we all have something in common. We're thrilled that you want to join us on our shared journey. Owned by our customers, we are the most attractive financial sector employer in Finland. OP Pohjola employs more than 14,000 professionals. We have a mission - to promote the sustainable prosperity, security and wellbeing of our owner-customers and operating region. What we do matters, both to our employees and society in general. As the largest provider of financial services in Finland, we are building a better tomorrow; this has been our goal for more than 120 years.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 70.0,
  "score_breakdown": {
    "positive_keywords": 70.0
  },
  "matched_keywords": [
    "data",
    "architect",
    "architecture",
    "senior",
    "agile",
    "product owner",
    "team lead"
  ],
  "category": "High Priority"
}