{
  "job": {
    "id": "1467476",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1467476",
    "title": "Software Engineer (Credit Path)",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-13T12:25:08.000+00:00",
    "discovered_date": "2025-12-02T23:39:17.589626",
    "description": "We seek a highly skilled software developer with 3+ years of experience working mainly with front end using modern technologies. We strongly believe in a \"You build it, you run it\" mindset. You will be a good fit for the role if you are: Experienced in utilizing REST API web services in Front-End Development and have hands-on experience in UI development with modern frameworks Strong in Front End Development (we mainly use Angular / VueJS) Hands-on experience in back-end (we use C#) Understanding of RESTful APIs Familiar withcloud development; experience with Azure is a plus Proficient in both written and spoken English You will become a key member of one of our dynamic product teams and daily you will: Develop, test, and ship high-quality software that meets user needs, including applications, APIs, and other workflows. Initiate, participate in, and communicate technical architecture designs. Collaborate with UX/UI designers and stakeholders to discover the right solutions. Attend regular scrum ceremonies as a member of an agile cross-functional team. Analyze, discuss, and implement business requirements while maintaining good documentation of the systems and components you create. Implement and advocate for industry standards and best practices to continually improve our codebase and architecture. Make a positive impact on our engineering culture by adopting, implementing, and providing feedback on both organizational and industry standards and practices. Inclusive and valuing culture At Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks. Health & Wellbeing Your physical and mental health is important to us. Take advantage of our various preventive care and support services. Professional and Personal Development Take advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings Monetary Benefits & Discounts Know that you're appreciated with plenty of employee benefits & discounts just for you. Flexibility Our diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 75.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0
  },
  "matched_keywords": [
    "vue",
    "angular",
    "architect",
    "architecture",
    "azure",
    "API",
    "agile",
    "scrum"
  ],
  "category": "High Priority"
}