{
  "job": {
    "id": "1468785",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468785",
    "title": "Full Stack Developer (React, Node, AWS)",
    "company": "Raintree Systems OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-01T09:00:04.611+00:00",
    "discovered_date": "2025-12-02T23:39:17.589549",
    "description": "Develop and maintain web applications using React and TypeScript. Integrate front-end applications with AWS services. Write clean, maintainable, and efficient code. Collaborate with designers, product managers, and other engineers to deliver high-quality software. Participate in code reviews and contribute to improving our development processes. Troubleshoot and resolve issues related to front-end and AWS integrations. Stay up-to-date with the latest trends and technologies in front-end development and AWS. Strong proficiency in React and TypeScript/JavaScript. Proficient with GraphQL Experience with AWS services (e.g., EC2, S3, Lambda, API Gateway). Solid understanding of HTML, CSS, and JavaScript. Experience with serverless architectures. Knowledge of CI/CD pipelines. AWS certifications. Excellent problem-solving and debugging skills. Experience with testing frameworks (e.g., Jest, Cypress). Strong communication and collaboration skills. Working with cutting-edge technologies AWS Serverless tools GraphQL CI/CD via GitHub Actions Monitoring tools with Slack integrations Microservices Event-driven architecture Mostly work with greenfield projects We offer a flexible hybrid model that strikes a balance between collaboration and autonomy. Work on software that directly improves peoples lives with better healthcare outcomes Get valuable experience in bringing a 40+ year legacy software system to a modern stack. Collaborative team environment with opportunities for growth Opportunity to do AWS certifications Tight-knit team with team events Modern development practices and a continuous learning culture with an individual development plan and career guidance Competitive compensation and benefits package Paid bonus vacation during Christmas week Company, Team, and personal performance-based bonus pay Stebby for the health and sports bonus Keep full salary when on military exercises Budget for personal training Beautiful office space in Tartu with flexible work arrangements You'll have dedicated mentorship and ongoing support from senior engineers to ensure you thrive from day one Develop and maintain web applications using React and TypeScript. Integrate front-end applications with AWS services. Write clean, maintainable, and efficient code. Collaborate with designers, product managers, and other engineers to deliver high-quality software. Participate in code reviews and contribute to improving our development processes. Troubleshoot and resolve issues related to front-end and AWS integrations. Stay up-to-date with the latest trends and technologies in front-end development and AWS. Strong proficiency in React and TypeScript/JavaScript. Proficient with GraphQL Experience with AWS services (e.g., EC2, S3, Lambda, API Gateway). Solid understanding of HTML, CSS, and JavaScript. Experience with serverless architectures. Knowledge of CI/CD pipelines. AWS certifications. Excellent problem-solving and debugging skills. Experience with testing frameworks (e.g., Jest, Cypress). Strong communication and collaboration skills. Working with cutting-edge technologies AWS Serverless tools GraphQL CI/CD via GitHub Actions Monitoring tools with Slack integrations Microservices Event-driven architecture Mostly work with greenfield projects We offer a flexible hybrid model that strikes a balance between collaboration and autonomy. Work on software that directly improves people's lives with better healthcare outcomes Get valuable experience in bringing a 40+ year legacy software system to a modern stack. Collaborative team environment with opportunities for growth Opportunity to do AWS certifications Tight-knit team with team events Modern development practices and a continuous learning culture with an individual development plan and career guidance Competitive compensation and benefits package Paid bonus vacation during Christmas week Company, Team, and personal performance-based bonus pay Stebby for the health and sports bonus Keep full salary when on military exercises Budget for personal training Beautiful office space in Tartu with flexible work arrangements You'll have dedicated mentorship and ongoing support from senior engineers to ensure you thrive from day one",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 100.0,
  "score_breakdown": {
    "positive_keywords": 110.0,
    "preferred_company": 15.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "javascript",
    "java",
    "typescript",
    "react",
    "architect",
    "architecture",
    "senior",
    "aws",
    "ci/cd",
    "API",
    "microservices"
  ],
  "category": "High Priority"
}