{
  "job": {
    "id": "1471344",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471344",
    "title": "Java vanemarendaja/arhitekt",
    "company": "Fujitsu Estonia AS",
    "location": "Unknown",
    "posted_date": "2025-11-28T10:00:01.774+00:00",
    "discovered_date": "2025-12-02T23:39:19.157705",
    "description": "Kui soovid anda oma panuse Eesti riigi majandusse läbi suurte avalike organisatsioonide ning eraettevõtete strateegiliste töövahendite arendamise, siis tule ja liitu Fujitsu meeskonnaga. Oma töös puutud kokku erinevate arendusinitsiatiivide elluviimisega, uute lahenduste väljatöötamisega ja põnevate projektide teostamisega - parimad praktikad kuuluvad selle kõige juurde. - töötada rahvusvahelises ettevõttes, mis pakub stabiilsust ja kindlust - oleme Eesti IT-turul tegutsenud juba üle 30 aasta: - teha koostööd meeskonnas, kus kõiki mõtteid ja ideid saab vabalt arutada, omavaheline hea huumor ning südamlik suhtumine käib tööpäeva juurde; - arendada oma professionaalseid oskusi ja teadmisi toote ja tehnoloogia valdkonnas ning erinevates Eestis või Soomes ärisektorites. Sinu arengut toetab ka ligipääs LinkedIn Learning keskkonda; - nautida töö- ja eraelu tasakaalu, see tähendab, et pakume paindlikkust tööajas ja töökohas sul on võimalus töötada kodus või meie Tallinna või Tartu kontoris. - töötada meeskonnas, kelle juht on hooliv, inimkeskne ja lahendustele orienteeritud (tuginedes Fujitsu rahulolu uuringule saame kinnitada, et meeskond hindab oma juhti kõrgelt.) Lisaks pakume muid ettevõtte hüvesid muuhulgas näiteks 7 kalendripäeva lisapuhkust, tervisekindlustust või tervise- ja spordikompensatsiooni, haiguspäevade hüvitamist jne. - vähemalt 5-aastast infosüsteemide arendamise kogemust JAVA programmeerimiskeelega; - varasemat töökogemust JavaScript raamistike (Angular/React/Vue vms.), PostgreSQL/Oracle tehnoloogiatega; - teadmisi ja praktilist kogemust konteinerite tehnoloogiatega (Kubernetes, Docker, HELM jne), et luua kaasaegseid ja skaleeritavaid lahendusi - analüütilist ja arhitektuurset mõtlemist, mis toetab sind uute lahenduste arendamisel; - teadmisi tarkvara turvalisuse nõuetest ja põhimõtetest; - oskust juhtida nooremarendajaid, jagada neile ülesandeid, motiveerida ja õpetada; - head eesti keele oskust; Kui oled meile sooviavalduse teele saatnud, siis: - tutvume Sinu avaldusega; - positiivse otsuse korral kutsume MS Teams´i töövestlusele meie meeskonnajuhiga; - teises vestlusvoorus osaled tehnilisel vestlusel meie vanemarendajaga; - saadame tööpakkumise e-mailile. Fujitsu Estonia väärtustab mitmekesisust ja kaasatust. Me usume, et igaühe ainulaadsus rikastab meie meeskonda. Meie juures hinnatakse igaühte ning diskrimineerimisele pole ruumi - kõik kandidaadid, olenemata nende taustast, on teretulnud. Meid võid usaldada. Oleme maailmaturul tegutsenud juba aastast 1935 ja Eestis 1991. Ühe suurima IT-ettevõttena oleme Eestis tööandjaks ligi 400 inimesele. Pikaajaline kogemus võimaldab meil oma töötajatele pakkuda kindlustunnet ja stabiilsust. Oleme usaldusväärsed tervikuna, mis tähendab, et igale meie meeskonnaliikmele saab loota. kodukontoris töötamise võimalus ning selle ülesseadmiseks mööbli ja tehniline varustus, 7 kalendripäeva lisapuhkust, haiguspäevade täiendav hüvitamine, tervisekindlustus või igakuine tervise- ja/või spordikompensatsioon.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 90.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "javascript",
    "java",
    "react",
    "vue",
    "angular",
    "kubernetes",
    "docker",
    "postgresql"
  ],
  "category": "High Priority"
}