{
  "job": {
    "id": "1473117",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473117",
    "title": "Tech Lead / Senior Java Software Engineer",
    "company": "1oT OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-25T14:48:51.000+00:00",
    "discovered_date": "2025-12-02T23:31:27.273284",
    "description": "1oT is looking for a Tech Lead / Senior Software Engineer to join us in building connectivity solutions according to the new eSIM IoT standard. 1oT has built a platform for helping global IoT service providers manage their SIM cards and billing. The self-service based platform enables users to control and monitor SIM card sessions, switch SIM cards on/off, buy new SIMs, send SMS to the SIM, etc. Our client portfolio ranges from e-mobility to asset tracking to smart city solutions, so you will have interaction with a variety of IoT sectors and telecom companies. eSIM team builds and maintains services that implement at 1oT the eSIM standard of GSMA. Develop large-scale services ( Java / REST / Spring / SQL ) Contribute to back-office UI ( Vue.js ) Run and maintain our services in AWS ( Terraform / Docker / Grafana ) Lead discussions on the architecture of the platform Identify bottlenecks in technical solutions of the team Lead implementation of technical initiatives Prioritize security and compliance in development initiatives Mentor junior members of the team on best practices and ways of working Ensure that eSIM services are built according to GSMA specs Handle external integrations via APIs 6+ years of development experience (Java / REST / Spring / SQL) Previous experience as Senior Engineer, Solution Architect, or Tech Lead Experience with cloud-hosted services (AWS / Azure / GCP) Familiarity with modern UI frameworks is a huge plus Experience with cryptography or HSM is a huge plus enjoy working as part of a team and like driving technical discussions forward approach challenges with a problem-solver mindset and get things done take strong ownership of your work and manage yourself well have the curiosity and hunger to build products that don't yet exist Ability to work with APIs and integrations Comfortable with security-focused development Willingness to mentor and guide other engineers Readiness to take ownership of technical domains A degree in Computer Science or a related field is beneficial but not mandatory. Strong practical experience is valued more highly. Meaningful, globally impactful work on cutting-edge eSIM technology Diverse tasks from building new features to optimizing existing systems Influence and ownership inside a growing, sustainable company Cozy and productive environment in Tallinn HQ Ambitious teammates who challenge the status quo Supportive, fun team and great vibes",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 100.0,
  "score_breakdown": {
    "positive_keywords": 120.0,
    "negative_keywords": -20.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "java",
    "vue",
    "architect",
    "architecture",
    "senior",
    "docker",
    "aws",
    "azure",
    "gcp",
    "terraform",
    "API",
    "team lead"
  ],
  "category": "High Priority"
}