{
  "job": {
    "id": "1475899",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1475899",
    "title": "Tech Platform Lead",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-12-01T13:52:44.000+00:00",
    "discovered_date": "2025-12-02T23:39:20.796339",
    "description": "Bachelor's or Master's degree in Computer Science, Engineering, or a related field. Proven experience in a technical leadership role, preferably in the fintech industry. Strong knowledge of both frontend and backend technologies. Familiarity with programming languages such as C#, Java, JavaScript, Python, or similar. Experience with cloud platforms (AWS, Azure, Google Cloud). Excellent problem-solving skills and attention to detail. Strong communication and interpersonal skills. Ability to work collaboratively in a fast-paced environment. Owning the technical vision of our payment methods, our Apps, Portals and our checkout APIs Leading design, development, deployment, and operations of the components Collaborating with product leadership to align technical solutions with business requirements Providing technical leadership and mentorship to the software engineering teams Planning and tracking budgets, ensuring cost efficiency of development and operations Ensuring engineering adhesion to best practices in security, scalability, and performance and fulfilling all compliance and regulatory requirements Staying on top of the latest industry trends and overseeing the integration of new technologies and tools to enhance the platforms capabilities Inclusive and valuing culture At Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks. Health & Wellbeing Your physical and mental health is important to us. Take advantage of our various preventive care and support services. Professional and Personal Development Take advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings Monetary Benefits & Discounts Know that you're appreciated with plenty of employee benefits & discounts just for you. Flexibility Our diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 85.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "python",
    "javascript",
    "java",
    "technical lead",
    "aws",
    "azure",
    "backend",
    "API"
  ],
  "category": "High Priority"
}