{
  "job": {
    "id": "1464859",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1464859",
    "title": "Projektijuht",
    "company": "Filter AS",
    "location": "Unknown",
    "posted_date": "2025-11-10T13:53:15.000+00:00",
    "discovered_date": "2025-12-04T14:13:20.254723",
    "description": "Ametikohal edukaks tegutsemiseks vajalikud eeldused:\n10 aastat kogemust projektijuhina tehnoloogiliste projektide valdkonnas\nTehniline kõrgharidus, automaatika, ehituse, energeetika, keskkonnaehituse või soojusenergeetika valdkonnas\nVäga hea suhtlemisoskus. Avatud suhtlemine, info jagamine, koostöö, oskus juhtida infot eri osapoolte vahel. Koordineerimine ja koostöö juhtimine ettevõtte erinevate üksuste vahel.\nTulemusele orienteeritus. Väga selge arusaam projekti lõpptulemusest ja selle selgitamine projektis osalejatele.\nVäga hea eesti ja inglise keele suuline ja kirjalik oskus.\nVäga hea arvuti kasutamise oskus projektijuhtimise tarkvara (MS Project) ja/või excel professionaalsel tasemel. Joonestusprogramm kasutamise oskus tuleb kasuks.\nB-kategooria autojuhi load.\n\nPeamised tööülesanded:\nProjektide (eel)planeerimine ja teostamine\n. Klientide nõustamine projekti planeerimisel. Eelarve koostamine ja selle täitmise jälgimine. Projekti tarnete, tegevus- ja ajakava lähtudes kliendiga sõlmitud lepingust. Projekti tiimi moodustamine ja kokkulepped. Suhtluse ja kommunikatsiooni koordineerimine projekti elluviimise ajal. Dokumentatsiooni nõuetekohane koostamine, kättesaadavus, süsteem ja korrashoid. Teostab projekti elluviimisejärgse analüüsi ja teeb parendusettepanekud.\nSuhtlemine tarnijatega ja allhankijatega.\nPlaneerib projektis ettenähtud tööd, korraldab hankekonkursid ja tellib allhanked järgides ettevõtte sisemist korda ja sõlmib vajadusel lepingu. Teostab kontrolli alltöövõtjate ja tarnijate tegevuse üle. Korraldab seadmete ja materjalide ostmise ettevõttes kehtestatud protseduuri järgides. Kontrollib vajadusel toodete vastavust tellimusele, kinnitab ostuarved. Korraldab auditikohustuslike seadmete ja/või rajatiste projektide kooskõlastamise ja kasutuselevõtule eelnevad auditid.\nProjekti jälgimine garantiiajal.\nKorraldab projekti lisa- ja remonditöid. Korraldab kliendi reklamatsioonide lahendamist projekti/objekti garantiiajal.\n\nVäärtuspakkumine:\n* Tööülesannete täitmiseks tagame vajaliku informatsiooni, koolitused ja töövahendid.\n* Töövahendite hulka kuuluvad personaalarvuti, mobiiltelefon ja ametiauto.\n* Motiveeriv tasupakett, mis sisaldab lisaks põhipalgale ka tulemustasu. Täpne pakkumine selgub läbirääkimiste käigus.\n* Sinu valikul täiendav ravikindlustus, mis sisaldab erinevaid teenuseid (nt ambulatoorne eriarstiabi, haiglaraviteenused, eridiagnostika, vaimse tervise teenused, taastusravi, hambaravi, ennetavad terviseuuringud) või sporditoetus 100 eur/kvartal.\n* Lahedad ühised sündmused, tiimi-ja suvepäevad.\n* Lugupidav ja palju iseseisvust andev töökultuur",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}