{
  "job": {
    "id": "1468494",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468494",
    "title": "Elektriinsener",
    "company": "Hitachi Energy Estonia AS",
    "location": "Unknown",
    "posted_date": "2025-11-16T05:49:34.000+00:00",
    "discovered_date": "2025-12-04T13:57:19.903060",
    "description": "Valmis uueks väljakutseks?:\nPakume võimalust ühineda meie ettevõtte ärisuunaga elektrisüsteemide tehnoloogialahenduste alal ning töötada kaasaegses töökeskkonnas koos oma ala spetsialistidega.\nOtsime inseneri elektrisüsteemide projekteerimise, seadistuse ja korrashoiu alal elektripaigaldistele kuni 330kV. Töö sisaldab projekteerimist ja tegevusi kliendi töömaal ning hõlmab koostööd teiste inseneride ja projektijuhtidega.\nOotame kandideerima nii kogenud spetsialiste kui ka noori arenemissooviga insenere.\n\nTööülesanded:\nElektrisüsteemide projekteerimine, seadistamine ja korrashoid.\nTehniliste probleemide lahendus ning uute lahenduste ja parendustegevuste pakkumine koostöös meeskonnaga.\nOhutuse ja kvaliteedi tagamine sooritatavatel töödel.\nTööde koordineerimine ja kommunikatsioon klientide, allhankijate, kohalike elektrivõrkude juhtimiskeskuste ja teiste asjaosalistega.\n\nOotused kandidaadile:\nElektriinsener vastavalt EstQF/EQF nõuetele, vähemalt tase 6.\nProjekteerimistarkvara (Eplan, E3, AutoCad vm) valdamine.\nHea eesti ja inglise keele oskus.\nMeeskonnatöö oskus ja kohusetunne.\nValmisolek töötada rahvusvahelises ja multikultuurses töökeskkonnas.\nKasuks tuleb tehnoloogiste paigaldiste juht- ja arvutisüsteemide tundmine.\n\nEttevõttest:\nHitachi Energy on globaalselt esindatud rohkem 90 riigis ja töötajaid on üle 50 000. Teenindame kliente energeetika-, tööstus- ja transpordisektoris uuenduslike lahenduste ja teenustega kogu väärtusahela ulatuses. Koos klientide ja partneritega oleme tehnoloogiate teerajajad ja võimaldame digitaalset ümberkujundamist süsinikuneutraalse tuleviku suunas.\nPakume konkurentsivõimelist töötasu, paindliku töökorraldust, mitmekülgset motivatsioonipaketti, võimalusi pidevaks arenguks ning töökeskkonda, kus tunnete end toetatuna ja väärtustatuna. Täpsematest hüvedest räägime värbamisprotsessi käigus.\nRohkem infot meie tegemiste kohta leiate meie kodulehelt www.hitachienergy.com",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}