{
  "job": {
    "id": "1474480",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474480",
    "title": "Insener-geodeet/projektijuht",
    "company": "Inseneribüroo REIB OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-28T08:46:40.503+00:00",
    "discovered_date": "2025-12-04T14:13:20.254522",
    "description": "Ootused kandidaadile:\nOotame oma ridadesse head kolleegi, kel on kogemus geodeetiliste tööde, eriti geodeetiliste võrkude rajamise läbiviimisel ja juhtimisel. Eelistatud kandidaadil on geodeetiliste võrkude rajamiseks vajalik geodeedid/geodeesiainseneri kutse, tase 6 või 7. Viimase puudumisel hariduslik eeldus selle taotlemiseks.\nHea kandidaat on tulemustele orienteeritud ja suudab oma tööd hinnata mitte ainult töötatud tundide, vaid ka nende jooksul klientidele loodud väärtuse läbi.\nVajalik on valmisolek nii iseseisvaks tehniliseks tööks kui võime juhtida väiksema töörühma tööd.\n\nTööülesannete kirjeldus:\nGeodeetilised tööd, eeskätt geodeetlise võrgu rajamine ja mõõtmine ning antud töödega seotud projektide ja töörühma juhtimine. Arvutustööd ja aruannete koostamine. Suhtlemine klientide ja teiste osapooltega. Kokkuvõtvalt nii välitööd objektil kui sisetööd kontoris.\n\nOmalt poolt pakume:\nTöötasu kokkuleppel, aga kindlasti sektori keskmisest tuntavalt kõrgem, saab olema seotud loodud väärtusega.\nSõbralik, avatud ja kokkuhoidev meeskond. Sisseelamisperioodiks kogenud spetsialistide tugi.\nTipptasemel instrumendid ja IT-tugiteenus\nTervisetoetused, firmasündmused, isiklike sündmuste meelespidamine\nKoolitused, seminarid jm enesetäiendamine ning kutsetaotlemine ettevõtte kulul\nTranspordivahend ettevõtte poolt\nMuud hüved vastavalt vajadusele ja kokkuleppele",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}