{
  "job": {
    "id": "1477592",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1477592",
    "title": "Senior Talent Acquisition Specialist",
    "company": "Gepard Media OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-04T07:47:42.000+00:00",
    "discovered_date": "2025-12-04T13:57:11.566835",
    "description": "What we expect from you::\nProven experience in recruitment within iGaming, IT, fintech, digital entertainment, or technical agencies\nDemonstrated capability in hiring roles such as software engineering, product, QA, data, risk, compliance, fraud, or operations\nStrong expertise in international sourcing and engaging talent across multiple markets\nProficiency in LinkedIn Recruiter, ATS platforms, Boolean search, and modern search tools\nSkilled in structured interviews and evidence-based candidate assessment\nAbility to manage multiple vacancies with high accuracy and strong organisational discipline\nClear, timely, and professional communication with candidates and stakeholders\nComfort operating in fast-paced and dynamic environments\nStrong prioritisation, documentation habits, and process reliability\n\nAbout the role::\nWe are seeking a highly skilled\nSenior Talent Acquisition Specialist\nto manage end-to-end hiring for technical, operational, and specialist positions. The position focuses on precise execution of the hiring process, global sourcing of scarce talent, and the application of structured assessment methods. You will work closely with hiring managers, ensure full process compliance, and contribute to onboarding implementation and employer-branding activities that strengthen our market presence.\nWhat's in it for you:\nFlat structure with minimal bureaucracy\nOpportunity to influence hiring quality and market reach\nDirect contribution to recruitment performance and talent acquisition capability\nChance to support the growth of our brand\nClear impact on team development and organisational outcomes\nWhat you will do:\nManage the full recruitment cycle for marketing, technical, product and operational roles.\nConduct structured intake discussions and drive efficient screening, interviewing, and offer processes.\nSource talent internationally through targeted outreach, talent mapping, Boolean search, and professional networks.\nApply structured interviewing methods and provide evidence-based assessments to hiring managers.\nEnsure accurate documentation, process compliance, and timely communication with candidates and stakeholders.\nSupport onboarding implementation and contribute to smooth offboarding processes where relevant.\nCollaborate on employer-branding initiatives to strengthen market visibility and candidate engagement.\n\nWhat we offer::\nA no bureaucracy work environment\nCompetitive salary\nFlexible working hours\nHybrid work setup; brand-new office in Ülemiste City\nDiverse and inclusive workplace\nSports compensation via Stebby\n28 calendar days of annual leave\nComplimentary company merchandise",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "senior"
  ],
  "category": "Low Priority"
}