{
  "job": {
    "id": "28b1641b0b962c45",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/senior-product-manager-games-scsom-19732550",
    "title": "Senior Product Manager - Games",
    "company": "Netflix",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 6.11.",
    "discovered_date": "2025-12-01T14:38:30.079375",
    "description": "Netflix is one of the world's leading entertainment services, with over 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. Next Games, founded in 2013 and based in Helsinki, Finland, crafts cutting-edge, approachable games for a global audience inspired by popular Netflix shows and movies and our own fresh ideas. We combine the Finnish game development culture with Netflix's global entertainment culture, embracing the strengths of both and empowering our talented and diverse teams to do the best work of their careers. The Role As a Senior Product Manager , you will be responsible for the business viability of games, throughout their lifecycle. You will get to work on Next Games' new games initiatives, working hands-on within the game team to create, launch, and operate innovative new games under a subscription-based business model. As part of this pioneering initiative, your contribution is in a unique position to create value for Netflix members and make an impact within Netflix. Essential Functions/Responsibilities Collaborate with the Game Director to strengthen the Product Vision with a matching Product Strategy, Go-to-market plan, and Live Operations plan Set and uphold game-specific KPIs, performance targets, and business viability constraints that drive Netflix objectives. Be the champion for your games' performance, learnings, opportunities, and business impact within the game studio. Collaborate with designers, engineers, UX, and artists to plan and deliver high-impact features, systems, economies, content, and live operations. Collaborate with data analysts on defining and validating our product hypotheses, and creating plans for telemetry, product analysis, and experimentation. Collaborate with Marketing, UA, and Product Discovery to drive growth Focus the efforts of the game team by evaluating and prioritizing player needs and opportunities with impactful tactics and solutions. Work with Netflix stakeholders and studio leadership to ensure clarity and alignment on roadmaps and product requirements, performance, objectives, and expectations. Work with internal Netflix partners to ensure your game is built for success within and leveraging the Netflix ecosystem. Skills and Abilities You're a strategic thinker with a passion for games, equipped with a healthy blend of technical knowledge, a customer-focused mindset, and strong instincts for an outstanding customer experience. You have a deep understanding of the games market and trends (mobile, console, PC), and top-performing products, and familiarity with commonly applied strategies and tactics for acquisition, engagement, and retention. You have the ability to inspire, motivate and lead a cross-functional team: Your ability to build strong relationships is critical to success. You are proficient and self-sufficient in using data to analyse game performance, inform priorities, and evaluate opportunities. You have excellent written and verbal communication skills in English, our working language. You are proficient with common software development, communication, and virtual collaboration tools to be effective within the team (eg. Jira, Slack, Notion, Miro, Figma, Google suite, LLMs / GenAI tools) Experience Hands-on Product management experience with multiple games, a proven record of successfully launching products and/or running successful live-operated games. Experienced in player-centric approaches to defining the target audiences and evaluating their needs and motivations. Expertise in game design for engagement and retention Experienced in using player research and experimentation methods such as AB-testing to validate hypotheses. Experienced in high-stakes executive presentations and stakeholder management. We aim high here at Next Games and will ask you to do the same. In exchange, you'll be part of a team that is great to work with, who is dedicated and passionate about what we do. Our guiding light in growing our team is that we don't look for a culture fit - we look for what each person brings to our collective skillset, culture and values to make them richer. Will you be the person to make us better? Apply now. Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner. We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.",
    "status": "new",
    "notes": ""
  },
  "score": 50.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "negative_keywords": -20.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product manager",
    "senior",
    "lead",
    "manager",
    "software",
    "IT"
  ],
  "category": "Review"
}