{
  "job": {
    "id": "38e6af20eddd0969",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/senior-platform-architect-scsom-19456527",
    "title": "Senior Platform Architect",
    "company": "ServiceNow",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 10.7.",
    "discovered_date": "2025-12-01T14:36:16.761238",
    "description": "Company Description It all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today - ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500®. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone. Job Description The Customer Outcomes Senior Platform Architect is an advisory role, responsible for helping our customers establish a technical foundation in the ServiceNow Platform and design solutions that deliver outcomes. The Senior Platform Architect ensures customers use leading practices around instance strategy, technical governance, core data, integrations and the health of the platform. This is a consultative role focused on guiding ServiceNow, partner and customer employees on the engagement team to provide a solution on an architecture designed for long-term success. You will work with the customer across executive, platform owner, enterprise architects, and development teams during the selling, structuring, and implementation of solutions. Be an architectural advisor across multiple engagements to guide customers, partners, and internal team members to provide successful customer solutions. Provide a variety of architectural knowledge across multiple workflows. Develop relationships with CoEI and business leaders at the customer site to understand the role of ServiceNow in their digital transformation vision. Translate goals to outcomes into a customer roadmap. Translate business information and technical requirements into an architectural blueprint to achieve complex goals. Engage with the customer's Enterprise Architects to position ServiceNow as the digital transformation platform standard, integrated with the customer's core applications. Manage technical governance, and a delivery operating model and governance. Ensure instance health by working with the engagement team to reduce technical debt and align to ServiceNow leading practices. Support the sales effort by scoping and estimating the engagement and change orders. Be an active contributor of leading practices and expertise related to the ServiceNow platform. Qualifications To be successful in this role you have: Experience in leveraging or critically thinking about how to integrate AI into work processes, decision-making, or problem-solving. This may include using AI-powered tools, automating workflows, analysing AI-driven insights, or exploring AI's potential impact on the function or industry. 8+ years progressive experience as part of a professional services organization; or equivalent education/experience Management consulting experience Creativity with comfort running programs independently within a \"startup paced\" environment Success driving complex issues through analysis and resolution Industry domain expertise Large program experience leading architecture and design Enterprise architecture experience Cloud application technology experience ServiceNow certifications in aligned workflow Ability to travel Right to work in the Country you have applied to - ideally a Finnish citizen Additional Information Work Personas We approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work. Learn more here. Equal Opportunity Employer ServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements. Accommodations We strive to create an accessible and inclusive experience for all candidates. If you require a reasonable accommodation to complete any part of the application process, or are unable to use this online application and need an alternative method to apply, please contact globaltalentss@servicenow.com for assistance. Export Control Regulations For positions requiring access to controlled technology subject to export control regulations, including the U.S. Export Administration Regulations (EAR), ServiceNow may be required to obtain export control approval from government authorities for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by relevant export control authorities. From Fortune. ©2024 Fortune Media IP Limited. All rights reserved. Used under license.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "enterprise architect",
    "senior",
    "lead",
    "architect",
    "IT"
  ],
  "category": "Review"
}