{
  "job": {
    "id": "420147e2342d628f",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/koodaava-hands-on-ai-ratkaisuarkkitehti-finanssialalle-scsom-19686234",
    "title": "Koodaava hands-on AI-ratkaisuarkkitehti finanssialalle",
    "company": "IQIFI Ltd.",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 15.10.",
    "discovered_date": "2025-12-01T14:36:16.760173",
    "description": "iQi hakee koodaavaa hands-on AI-ratkaisuarkkitehtia finanssialalle Oletko koodaava hands-on AI-ratkaisuarkkitehti, joka haluaa olla mukana rakentamassa digitaalista tulevaisuutta asiakkaidemme toimeksiannoissa finanssialalla? Haluatko liittyä osaksi dynaamista tiimiämme? Etsimme nyt vahvistusta joukkoomme työskentelemään kanssamme monipuolisissa asiakasprojekteissa. Tehtävänkuvaus: Etsimme kokenutta koodaava hands-on AI-ratkaisuarkkitehtia finanssipuolen asiakasprojekteissa. Tässä roolissa sinulla on mahdollisuus kehittää asiakkaiden tarpeiden mukaisia palveluja, suunnitella heille parhaita mahdollisia ratkaisuja ja olla osana tuottamassa niitä yhdessä tiimisi kanssa. Tehtäväsi muovautuu yksilöllisten toiveidesi sekä teknisen osaamisesi ja kokemuksen pohjalta. Kokemusta AI-malliratkaisuiden suunnittelusta ja toteuttamisesta pankissa AI-SaaS-ratkaisuiden käyttö osana AI-kokonaisarkkitehtuuria Väärinkäytösteneston ratkaisuiden suunnittelusta ja toteuttamisesta Compliance-vaatimusten toteuttamisesta AI-ratkaisuissa Toimimisesta lead developer -roolissa Kiinnostusta Agenttien AI -arkkitehtuureihin Tarjoamme: Tarjoamme ainutlaatuisen tilaisuuden kehittää osaamistasi korkeatasoisissa projekteissa samalla, kun nautit innostavasta työympäristöstä ja kokeneen tiimin tuesta. Pääset osallistumaan monipuolisiin työtehtäviin ja kantamaan vastuuta omasta työstäsi. Työyhteisömme on kokenut ja organisaatioltaan matala, mutta sitäkin hauskempi. Meillä on hyvä työilmapiiri ja paljon pitkäaikaisia työntekijöitä. Töitä teemme yhdessä toimistollamme, asiakkaan tiloissa ja etätyönä. Työntekijäkokemus ja hyvinvointi on meille tärkeää. Tavoitteenamme on ylläpitää vastuullista ja myönteistä yrityskulttuuria, joka tarjoaa oikeudenmukaisen, turvallisen ja innostavan työympäristön jokaiselle tiimin jäsenelle. Työntekijänämme hyödyt myös joustavista työajoista, kilpailukykyisestä palkkauksesta sekä monipuolisista henkilöstöeduista. Jos harkitset alihankkijan roolia kanssamme, voit olla varma, että se ei vaikuta työskentelyolosuhteisiin millään tavoin. Ylläpidämme avointa ja säännöllistä kommunikaatiota alihankkijayhteistyössämme ja työskentelet saumattomasti osana tiimiämme. Tiivis yhteistyö niin pienyritysten kuin yksityisyrittäjienkin kanssa on meille ensiarvoisen tärkeää ja pyrimme luomaan kestäviä ja vahvoja kumppanuuksia. Palkkaus- ja kannustinjärjestelmä Meillä tienaa hyvin sekä peruspalkan että kannustinten osalta Työsuhdeasiat ja -edut Kokonaispakettimme on kilpailukykyinen Tarjoamme: Tilaisuuden kehittyä ja kasvaa ammatillisesti Mahdollisuuden työskennellä parhaiden asiantuntijoiden kanssa Ainutlaatuisen tilaisuuden päästä mukaan IQIn matkalle kohti visiota olla Suomen vetovoimaisin ja luotetuin IT-Kumppani Kiinnostuitko? Hakuaika päättyy 30.11.2025. Hakemus kannattaa jättää mahdollisimman pian, sillä kutsumme soveltuvat henkilöt haastatteluun heti ja täytämme paikan sopivan henkilön löydyttyä. Kerro meille, miksi juuri sinä olisit loistava lisä tiimiimme!",
    "status": "new",
    "notes": ""
  },
  "score": 50.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "API",
    "lead",
    "developer",
    "IT"
  ],
  "category": "Review"
}