{
  "job": {
    "id": "571c6fc11e193de6",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/product-owner-aml-transaction-monitoring-talousrikollisuuden-torjunta-sospp-19770372",
    "title": "Product Owner, AML Transaction monitoring, Talousrikollisuuden torjunta",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 20.11.",
    "discovered_date": "2025-12-01T14:37:32.869790",
    "description": "Oletko valmis johtamaan kehitystiimiä, joka varmistaa taloudellisen turvallisuuden ja suojaa asiakkaita talousrikollisuuden eri muodoilta? Oletko valmis työskentelemään dynaamisessa ympäristössä, jossa jokainen päivä tuo uusia haasteita ja mahdollisuuksia talousrikollisuuden torjunnan kehittämiseen? Haemme vakituiseen työsuhteeseen Helsinkiin Product Owneria Talousrikollisuuden torjunnan (TRT) heimoon johtamaan Transaktiomonitoroinnin (TM) -kehitystiimiä. Tehtävästä Product Ownerin tehtäviisi kuuluu tiimin ja sen vastuulla olevien tekemisten johtaminen kohti määriteltyä tavoitetilaa. Osaat yhdistellä sääntelyn vaatimukset unohtamatta asiakkaan näkökulmaa. Sinulla on vahva ymmärrys AML- ja transaktiomonitoroinnin yleisistä kontrolleista ja näkemystä tulevaisuuden mahdollisista kehityssuunnista. Vastaat vastuualueesi toimista oman tiimisi kehitysaihioiden sisällön ja priorisoinnin osalta. Teet läheistä yhteistyötä oman tiimisi lisäksi heimotasolla esimerkiksi Head of AML kanssa, sekä laajalti heimon ulkoisten sidosryhmien osalta. Johdat määrätietoisesti tiimiä ja työskentelet itseohjautuvasti. TM-tiimillä on kokonaisvaltainen vastuu OP Pohjolan järjestelmätuetusta transaktioiden monitoroinnista. Vastuut pitävät sisällään niin kokonaisuuden kehittämisen, toimivuuden varmistamisen kuin ylläpidon. Mitä odotamme sinulta? Sinulta löytyy liiketoimintaosaamista, sääntely- ja teknologiaymmärrystä sekä omaat kokemusta prosessien johtamisesta, ketterästä kehittämisestä ja toimintatavoista. Sinulla on näyttöjä kehityshankkeiden läpiviennistä ja talousrikollisuuden torjunnan syväosaamisesta. Lisäksi sinulla on hyvät viestintä- ja yhteistyötaidot ja vahva kokemus sidosryhmäyhteistyöstä. Johdat tiimiä varmistaen tavoitteiden saavuttamisen vaativassa ja muuttuvassa ympäristössä. Kommunikoit ja työskentelet sujuvasti niin suomeksi kuin englanniksi ja sinulta löytyy tehtävään soveltuva korkeakoulututkinto. Muutama sana meistä ja mitä me tarjoamme OP Pohjolan Talousrikollisuuden torjunnan organisaatio on voimakkaasti kehittyvä ammattitaitoisten osaajien kokonaisuus. Meillä on hyvä kehittymiseen tähtäävä yhteishenki. Jatkuvasti muuttuvat talousrikollisuuden torjunnan trendit sekä lainsäädäntö ja siitä nousevat tarpeet pitävät työmme mielenkiintoisena. Pääset työskentelemään itsenäisessä roolissa vaikuttaen laajasti Talousrikollisuuden torjunnan toiminnan kehittämiseen ja hankkeisiin. Tavoitteemme on turvata OP Pohjolan asiakkaita talousrikollisuuden eri muodoilta. Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme , johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Kiinnostuitko? Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään sunnuntaina 7.12.2025. Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Ilmoitathan hakemuksesi yhteydessä myös palkkatoiveesi. Lisätietoja tehtävästä antaa Elina Tamminen (Competence Area Lead) p. 050 401 8884 tai Matti Törmänen (Head of AML) matti.tormanen(at)op.fi. Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat, teetetään huumausainetesti, Suojelupoliisin teettämä perusmuotoinen turvallisuusselvitys sekä ulkomaansidonnaisuuksien selvitys. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "lead",
    "IT"
  ],
  "category": "Review"
}