{
  "job": {
    "id": "b0f711c995825ca7",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/analytics-lead-asiakkuuksien-ennustava-liiketoiminta-analytiikka-pohjola-vakuutus-hki-sospp-19774317",
    "title": "Analytics Lead, Asiakkuuksien ennustava Liiketoiminta-analytiikka, Pohjola Vakuutus, HKI",
    "company": "OP Pohjola",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 21.11.",
    "discovered_date": "2025-12-01T14:37:32.872724",
    "description": "Oletko kiinnostunut syventämään osaamistasi roolissa, jossa pääset rakentamaan ylivertaista asiakaskokemusta, toteuttamaan Pohjola Vakuutuksen strategiaa ja johtamaan vastuualueesi toimintaa liiketoimintatavoitteiden mukaisesti? Haemme nyt Analytics Leadia uudelle Liiketoiminta-analytiikka vastuualueelle työsuhteeseen johtamaan analytiikkatiimin toimintaa ja kehitystä. Roolissa vastaat tiekartasta, priorisoinnista ja tiimin hyvinvoinnista. Tavoitteesi on varmistaa, että tiimi tuottaa liiketoiminnalle arvoa datan ja analytiikan avulla - ilman mikromanageerausta - ja että työkuorma pysyy tasapainossa. Lisäksi johdat tiimin osaamisen kehittymistä ja urapolkuja. Tehtävästä Omistat ja ylläpidät analytiikan tiekarttaa yhdessä kollegoidesi kanssa. Muodostat selkeän suunnan tiimin kehitykselle sekä lyhyellä (0-3 kk) että pitkällä (3-18 kk) aikavälillä. Priorisoit työt yhdessä tiimin kanssa ja ylläpidät backlogia niin, että tiimi osallistuu päätöksiin ja säilyttää autonomian. Johdat ihmisiä ja osaamista sekä toimit tiimin esihenkilönä, vastaten tiimin hyvinvoinnista, kehityskeskusteluista ja osaamisen kasvusta esimerkiksi koulutusten ja mentoroinnin avulla. Huolehdit työkuorman tasapainosta ja varmistat resurssien riittävyyden, jotta ylikuormitusta ei synny. Teet tiivistä yhteistyötä liiketoiminnan ja muiden tiimien kanssa varmistaen, että analytiikkaratkaisut tuottavat arvoa. Lisäksi kehität toimintatapoja ja teknologioita parantaen prosesseja, työvälineitä ja tiimin kyvykkyyttä jatkuvan parantamisen hengessä. Millaista osaamista etsimme? Edellytämme tehtävässä kokemusta analytiikan tai datan parissa työskentelystä tiiminvetäjän, Product Ownerin, tai vastaavan roolin näkökulmasta. Sinulla on kykyä hallita tiekarttaa, priorisoida tehtäviä ja hallita laajoja kokonaisuuksia. Omaat ymmärrystä analytiikkatyökaluista, datan hallinnasta ja raportoinnista, ja sinulla on konkreettisia näyttöjä tästä aiemmissa työtehtävissä. Omaat kokemusta ihmisten johtamisesta ja osaamisen kehittämisestä, ja pidät sitä mielekkäänä osana työtäsi. Kehität systemaattisesti myös omaa osaamistasi ja yhteisiä parhaita käytäntöjä, ja koet onnistumista silloin kun tiimisi onnistuu ja pääsee sille asetettuihin tavoitteisiin. Rakennat mielelelläsi suhteita eri puolelle organisaatiota, kommunikoit ja viestit selkeästi ja halua rakentaa positiivista tiimikulttuuria. Tehtävä edellyttää työkielenä sekä suomen- että englanninkielen hyvää taitoa. Edellä mainittujen asioiden lisäksi arvostamme myös kokemusta ketteristä menetelmistä, ymmärrystä pilvipalveluista ja modernista data-arkkitehtuurista sekä kokemusta modernien koneoppimismenetelmien kehittämisestä. Me tarjoamme Vastuullisen työn vastapainoksi pidämme huolen työhyvinvoinnistasi ja tulevaisuuteen katsovista työjärjestelyistä. Tarjoamme sinulle vakaan ympäristön, jossa vastuullisuus, ihmisläheisyys ja yhdessä menestyminen ovat keskeisiä arvoja. Saat käyttöösi monipuoliset henkilöstöetumme, johon kuuluvat mm. henkilökuntaehtoiset pankki-, vakuutus- ja lainapalvelut. Tarjoamme myös kattavan työterveyshuollon, laajan hoitokuluvakuutuksen sekä täysajan tapaturmavakuutuksen. Työssäjaksamiseen panostamme arjen tasapainolla ja joustavuudella sekä tarjoamalla käyttöösi lounas-, liikunta- ja kulttuuriedut sekä mahdollisuuden edulliseen lomailuun OP Pohjolan lomaosakkeissa. Lisätiedot ja hakuohjeet Hae tehtävää lähettämällä meille CV:si ja vapaamuotoinen hakemuksesi rekrytointijärjestelmämme kautta viimeistään 5.12.2025 mennessä . Kuulemme mielellämme lisää osaamisestasi ja motivaatiostasi tätä tehtävää kohtaan. Head of Customer Analytics Antti Rahtu kertoo sinulle mielellään lisää. Antin tavoitat numerosta 050 306 6946 tai sähköpostitse antti.rahtu(at)pohjola.fi. Arkipäivisin. Finanssialalla luottamus ja vastuullisuus ovat toimintamme perusta, minkä vuoksi tehtävään valittavalta henkilöltä tarkistetaan luottotiedot, yritysyhteydet ja mahdolliset eturistiriidat ja vakuutussääntelyn edellyttämä hyvämaineisuus sekä teetetään huumausainetesti. OP Pohjola - Meillä on jotain yhteistä OP Pohjola on monimuotoisuutta ja yhdenvertaisuutta kunnioittava työyhteisö. Meille on tärkeää, että jokainen tuntee olonsa tervetulleeksi ja arvostetuksi. Arvostamme erilaisuuden mukanaan tuomaa rikkautta ja monipuolisia näkökulmia. Kannustamme kaikkia hakemaan meille töihin, sillä meillä on jotain yhteistä. Hienoa, että haluat mukaan yhteiselle matkallemme. Olemme asiakkaidemme omistama, finanssialan vetovoimaisin työnantaja Suomessa. Meillä työskentelee yli 14 000 alan ammattilaista. Perustehtävämme on edistää omistaja-asiakkaidemme ja toimintaympäristömme kestävää taloudellista menestystä, turvallisuutta ja hyvinvointia. Meillä työskentely on merkityksellistä sekä työntekijöillemme että muille, sillä Suomen suurimpana finanssitoimijana rakennamme työllämme toiveikkaampaa tulevaisuutta. Sitä olemme tehneet jo yli 120 vuoden ajan.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "lead",
    "IT"
  ],
  "category": "Review"
}