{
  "job": {
    "id": "b6bb79c1239ea17f",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/data-platform-architect-sdsuu-19794272",
    "title": "Data Platform Architect",
    "company": "61N Solutions Oy",
    "location": "Helsinki ja 1 muu –",
    "posted_date": "Julkaistu 1.12.",
    "discovered_date": "2025-12-01T14:36:16.758301",
    "description": "Etsimme Data Platform Engineeriä/Architectia rakentamaan kriittisiä tietojärjestelmiä ja kehittymään osana alan parasta työyhteisöä. Kuulostaako hyvälle? Lue lisää ja hae pian! Tuleva tiimisi odottaa ! 61N on nopeasti kasvava puolustus- ja turvallisuusalan kriittisen suorituskyvyn sekä sitä tukevien tietojärjestelmien suunnitteluun ja kehittämiseen erikoistunut konsulttitalo. Yli 40 asiantuntijan tiimimme koostuu kokeneista ohjelmistoalan ammattilaisista, joista valtaosalla on vahva tausta puolustus- ja turvallisuustoimialan tietojärjestelmistä. Meillä pääset osaksi alan huippuosaajien tiimiä, ja projekteissamme näet konkreettisesti työsi vaikuttavuuden yhteiskunnan turvallisuuteen. Tule kanssamme tekemään työtä sen eteen, että kansallinen turvallisuus on aina askeleen edellä. Roolisi meillä Meillä tulet työskentelemään merkittävien ja kriittisten järjestelmäprojektien parissa. 61N:n tiimin lisäksi tulet työskentelemään asiakkaamme projektipäälliköiden ja toimiala-asiantuntijoiden kanssa ja pääset varmasti oppimaan lisää toimialasta ja teknologioista! Lopullinen rooli muotoutuu tekijänsä mukaan, mutta painottuu data- ja analytiikka-alustojen rakentamiseen sekä dataputkien kehittämiseen. Olemme kiinnostuneet myös tuoreesta käytännön kokemuksesta tiedon mallintamisesta tietoallas- ja/tai tietovarastoalustoilla. Kokemus data lakehouse –paradigman hyödyntämisestä on myös eduksi. Toimimme sekä hybridipilvi- että on-premises -alustoilla. Yksin hommaa ei tietysti tarvitse tehdä, vaan tukenasi ovat muut tiimimme rautaiset ammattilaiset. Mitä odotamme sinulta Sinulla on jo kokemusta vastaavista tehtävistä datan parissa, taustaltasi voit olla niin muutaman vuoden kokemuksella varustettu data engineer tai jo pidemmän urapolun omaava arkkitehti. Sinulla on osaamista niin datan keräämisestä, koko dataputken hallinnasta ja kehittämisestä, datan prosessoinnista kuin tietomallin suunnittelusta. Tietoaltaat ja -varastot ovat sinulle tuttuja ja sinulla on kokemusta datainfrastruktuurin rakentamisesta käyttämisen lisäksi. Osaat huomioida, mitä datalla halutaan tehdä – pidät mielessä asiakkaan tarpeen, analytiikan ja datan loppukäytön, ja data-alustaa/tietomallia suunnitellessasi ymmärrät myös sen vaikutukset visuaaliseen puoleen. Odotamme sinulta osaamista seuraavista: SQL Python Tietokannat, tietoaltaat, relaatiokannat Dataputkien orkestrointi Datan prosessointi (esim. Apache spark, Apache Flink, Kafka) Hybrid-cloud & on-prem Seuraavien osaaminen katsotaan eduksesi, muttei ole välttämätöntä: Kubernetes DBT Amazon EMR AWS Glue Databricks Apache Airflow Scala, kotlin Huomioithan myös, että vaikkakin työskentelemme joustavasti hybrid-mallissa, projektiemme luonteen ja yhteisöllisyyden kulttuurin vuoksi odotamme, että olet valmis työskentelemään osan viikosta toimistollamme Tampereella tai Helsingissä. Tampereella toimistomme sijaitsee GO21-rakennuksessa ja Helsingissä päärautatieaseman läheisyydessä. Projektimme vaativat tällä hetkellä ammatillista ja sujuvaa suomen kielitaitoa ja työsuhteen ehtona on hyväksytty viranomaisen turvallisuusselvitys ja mahdollisesti huumausainetesti. Tarjoamme sinulle työn, jossa merkityksellisyys on arkipäivää Meidän projekteissamme olet mukana rakentamassa kansallista turvallisuutta –yhteiskunnan tärkeimpiä digitaalisia ratkaisuja. Voimme luvata, että meillä työn merkityksellisyys on läsnä arjessasi! Liittymällä tiimiimme saat myös mahdollisuuden tulla mukaan rakentamaan uutta menestystarinaa – olemme hyvin mielenkiintoisessa kasvuvaiheessa, ja meillä pääset todella vaikuttamaan. Lisäksi tarjoamme: Kilpailukykyisen palkan, joka tämän roolin puitteissa on 4000 - 6000 e/kk osaamisestasi ja kokemustaustastasi riippuen Kattavat ja monipuoliset henkilöstöedut mukaan lukien laaja työterveys ja tapaturmavakuutus, liikunta- ja kulttuurietu, lounasetu, yrityksen puhelinliittymä ja koti-laajakaista sekä modernit työvälineet Tuemme tekijöidemme ammatillista kehittymistä yhdessä sovituilla tavoilla, aina mentoroinnista koulutuksiin ja sertifioinneista valmennuksiin Mukavan ja motivoituneen työkulttuurin, jossa tukea on saatavilla ja voit vaikuttaa kasvuyrityksen matkaan Rekrytointiprosessimme Voisiko tämä olla sopiva seuraava askel urallasi? Hae heti ja tule kanssamme varmistamaan, että kansallinen turvallisuus on aina askeleen edellä! Hakulomakkeemme on helppo ja nopea: lisää vain yhteystietosi, CV:si ja hakukirjeesi alla olevaan lomakkeeseen. Voit myös jakaa GitHub- ja LinkedIn-profiiliisi tai lisätä muita haluamasi oleellisia dokumentteja. Hakemuksen lähettämisen jälkeen voit myös ilmoittaa järjestelmässä suosittelijasi, jolta pyydämme tässä tapauksessa sähköpostitse suosituksen hakemaasi rooliin. Voit myös ottaa käyttöön Connect-toiminnon, jonka kautta voit kertoa itsestäsi meille lisää ja saat jatkossa tietoa uusista avoimista työpaikoistamme. Voit tutustua meihin lisää myös urasivuillamme ja LinkedInissä! Mikäli sinulla on kysymyksiä roolista tai 61N:stä, voit olla yhteydessä Head of Talent Heta Hällforsiin, 0405364426 / heta.hallfors@61n.fi 61N. Kansallisen turvallisuuden digitaalinen edelläkävijä.",
    "status": "new",
    "notes": ""
  },
  "score": 40.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "python",
    "architect",
    "IT"
  ],
  "category": "Review"
}