{
  "job": {
    "id": "ce812c244e60e8d9",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/technical-product-owner-sdsan-19783943",
    "title": "Technical Product Owner",
    "company": "Danfoss",
    "location": "Tampere ja 2 muuta –",
    "posted_date": "Julkaistu 24.11.",
    "discovered_date": "2025-12-01T14:37:32.868751",
    "description": "The Impact You'll Make As a Technical Product Owner, you'll help shape the next generation of power-conversion solutions for the rapidly growing electrification market. Your work will directly support energy-efficient technologies for Smart Grid, energy storage, green hydrogen (P2X), and fast-charging applications. You'll be part of a skilled and supportive product team where your decisions and ideas influence how our products take shape. By working closely with customers, partners, and internal experts, you'll turn real-world needs into meaningful product improvements. In this role, you'll help Danfoss advance toward a more sustainable future-bringing innovative, reliable, and energy-efficient solutions to the industries that need them most. Join Danfoss Drives and become part of a team making a significant impact in energy efficiency and electrification. As a global leader in power conversion solutions, we are committed to sustainability, exceptional quality, and fostering an inclusive work environment. Our technology powers industries worldwide and supports global decarbonization efforts. Engineer a better future with Danfoss, where meaningful change begins with you! The position is located in Vaasa, Tampere or Helsinki What You'll Be Doing Lead and guide product development teams to deliver high-value features, products, or platform elements for electrification customers. Refine business and technical requirements with stakeholders to ensure the optimal balance of value, cost, and quality. Collaborate with cross-functional teams and partners to build executable release plans with prioritized product backlog items. Apply your experience in customer support, power-conversion design, and indirect leadership to strengthen team capabilities and outcomes. Continuously learn, share insights, and help improve how we innovate and develop solutions with our customers. What We're Looking For A relevant technical degree (B.Sc. or M.Sc.) 5+ years of experience in power-conversion product development, product management, or electrification applications Experience leading teams or projects; familiarity with agile/Scrum is an advantage Strong collaboration and communication skills Fluency in English (spoken and written) A customer-focused mindset and a passion for innovative R&D If this role excites you, we'd love to hear from you! We review applications continuously, so please apply as soon as possible to start the conversation and discover where your career can go with us. What You'll Get from Us We promote from within and support your learning with mentoring, training, and access to global opportunities. You'll have flexibility, autonomy, and support to do your best work while maintaining a healthy work-life balance. Your well-being matters to us. We strive to create an inclusive work environment where people of all backgrounds are respected, and valued for who they are. Ready to Make a Difference? If this role excites you, we'd love to hear from you! Apply now to start the conversation and learn more about where your career can go with us. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, veteran status, or other protected category. Danfoss engineers solutions that increase machine productivity, reduce emissions, lower energy consumption, and enable electrification. Our solutions are used in such areas as refrigeration, air conditioning, heating, power conversion, motor control, industrial machinery, automotive, marine, and off- and on-highway equipment. We also provide solutions for renewable energy, such as solar and wind power, as well as district-energy infrastructure for cities. Our innovative engineering dates back to 1933. Danfoss is family-owned, employing more than 39.000 people, serving customers in more than 100 countries through a global footprint of 95 factories. Danfoss engineers solutions that increase machine productivity, reduce emissions, lower energy consumption, and enable electrification. Our solutions are used in such areas as refrigeration, air conditioning, heating, power conversion, motor control, industrial machinery, automotive, marine, and off- and on-highway equipment. We also provide solutions for renewable energy, such as solar and wind power, as well as district-energy infrastructure for cities. Our innovative engineering dates back to 1933. Danfoss is family-owned, employing more than 39.360 people, serving customers in more than 100 countries through a global footprint of 95 factories.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0
  },
  "matched_keywords": [
    "product owner",
    "API",
    "infrastructure",
    "agile",
    "lead",
    "IT"
  ],
  "category": "Review"
}