{
  "job": {
    "id": "ddb8d63af7ff3227",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/ratkaisuarkkitehti-finanssitoimialan-uudistushankkeisiin-scsgi-19664592",
    "title": "Ratkaisuarkkitehti finanssitoimialan uudistushankkeisiin",
    "company": "CGI Suomi",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 10.10.",
    "discovered_date": "2025-12-01T14:36:16.757512",
    "description": "Position Description: CGI on yksi suurimmista IT- ja liiketoimintakonsultoinnin yrityksistä Suomessa ja maailmalla. Vahva kokemuksemme eri toimialoilta auttaa julkisen ja yksityisen sektorin asiakkaitamme onnistumaan digitaalisessa muutoksessa ja saavuttamaan tavoitteitaan entistä tehokkaammin. Ratkaisuarkkitehti finanssitoimialan uudistushankkeisiin Etsimme nyt kokenutta ratkaisuarkkitehtiä vahvistamaan finanssitoimialan asiakkuuksiamme ja viemään läpi merkittäviä digitaalisia muutoshankkeita. Tässä roolissa pääset suunnittelemaan ja toteuttamaan ratkaisuja, jotka tukevat asiakkaidemme kasvua ja uudistumista - ja samalla kehität myös omaa asiantuntijuuttasi alan huippujen joukossa. Keskeiset tehtävät • Johdat ja suunnittelet arkkitehtuuria finanssialan muutoshankkeissa. Yhdistätä liiketoiminnan tavoitteet ja teknologian mahdollisuudet. • Osallistut asiakasprojekteihin ja autat muuntamaan liiketoimintatarpeet toimiviksi, skaalautuviksi ratkaisuiksi. • Teet tiivistä yhteistyötä asiakkaiden, kehittäjien ja konsulttien kanssa ja vaikutat kokonaisarkkitehtuuriin ja kehityksen suuntaan. • Toimit aktiivisesti myös myynti- ja konsultointitehtävissä - olet asiakkaan luottokumppani teknisissä ratkaisuissa. Tämän tehtävän sijaintipaikka on Helsinki, mutta toimimme CGI:llä joustavasti hybridimallilla, yhdistäen etä- ja lähityöskentelyä. Edellytämme sinulta • Vankkaa kokemusta arkkitehtuurien suunnittelusta ja uusista teknologioista - esimerkiksi pilvipalveluista ja tekoälyratkaisuista. • Monipuolista taustaa finanssitoimialan ratkaisuista ja vähintään 5 vuoden kokemusta ratkaisuarkkitehdin roolissa. • Konsultatiivista työotetta ja kykyä hahmottaa kokonaisuuksia sekä kommunikoida sujuvasti eri sidosryhmien kanssa. Sujuvaa suomen kielen taitoa ja hyvää englannin osaamista. Tarjoamme sinulle Tiedämme, että onnistuminen perustuu ihmisiin ja kulttuuriin, toimivia työkaluja ja teknologiaa unohtamatta. CGI:llä saat luoda juuri sinulle sopivaa urapolkua mielenkiintoisten tehtävien sekä sisäisen urakierron kautta. Voit myös jatkuvasti kehittää taitojasi ja syventää osaamistasi mm. CGI Academian avulla. Tarjoamme sinulle työn, jossa voit kehittyä haluamaasi suuntaan sekä mahdollisuuden omistaa yhtiön osakkeita ainutlaatuisen osakesäästöohjelmamme avulla. Henkilöstöstämme 85 % on osakkeenomistajia ja siksi olemmekin CGI Partnereita. Meillä työ joustaa, kun elämäntilanteesi sitä vaatii. Pidämme huolta sinusta ja hyvinvoinnistasi monipuolisin henkilöstöeduin ja tarjoamme mm. kattavan työterveyshuollon, vapaa-ajan vakuutuksen, sairaan lapsen hoitopalvelun sekä mahdollisuuden työsuhdepolkupyörään. Osallistumalla CGI:n hyvinvointiyhteisöjen toimintaan pääset myös tutustumaan työkavereihin eri puolilta taloa yhteisten harrastusten parissa. Tutustu meihin lisää yrityskohtaisesta työehtosopimuksestamme! Tule rakentamaan omaa urapolkuasi meille! Mikäli tämä tehtävä voisi olla seuraava askel urallasi, haethan tehtävää 10.12.2025 mennessä. Etenemme rekrytointiprosessissa heti sopivan kandidaatin löydyttyä. Lisätietoja tehtävästä antaa Kim Kalpio, numerosta 040 5656 345. Perusmuotoinen turvallisuusselvitys tullaan tekemään tehtävän niin vaatiessa. Tutustu meihin lisää: CGI Ura Facebook , Instagram , LinkedIn , X , YouTube #LI-MP5 Skills: Artificial Intelligence English Finnish Solutions Architecture What you can expect from us: Together, as owners, let's turn meaningful insights into action. Life at CGI is rooted in ownership, teamwork, respect and belonging. Here, you'll reach your full potential because... You are invited to be an owner from day 1 as we work together to bring our Dream to life. That's why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our company's strategy and direction. Your work creates value. You'll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise. You'll shape your career by joining a company built to grow and last. You'll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons. Come join our team-one of the largest IT and business consulting services firms in the world.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 30.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "lead",
    "architect",
    "IT"
  ],
  "category": "Review"
}