{
  "job": {
    "id": "e61b3641920a7734",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/technical-product-owner-s-kaupat-sss-r-19790379",
    "title": "Technical Product Owner, S-Kaupat",
    "company": "S-ryhmä",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 25.11.",
    "discovered_date": "2025-12-01T14:37:32.869544",
    "description": "Sijainti: HELSINKI Haluatko työskennellä osuuskunnassa, joka on läsnä lähes jokaisen Suomessa asuvan arjessa? S-ryhmä on Suomen suurin yksityinen työnantaja ja nykyisin merkittävä digityönantaja. Kanssamme pääset vaikuttamaan suurimman osan Suomessa asuvien arkeen. S-kaupat on Suomen suosituin ruoan verkkokauppa - ja tehtävämme on helpottaa asiakkaidemme arkea ruokaostoksilla. Haemme innostuneita osaajia mukaan rakentamaan tulevaisuuden ruoan verkkokauppaa aikana, jolloin sen käyttö kasvaa vauhdilla ympäri Suomea. Jo nyt jopa 42 % suomalaisista valitsisi ensisijaisesti S-kaupat-palvelun eri vaihtoehdoista (Suomi Syö -tutkimus). Kehitämme kokonaisvaltaisesti verkkokaupan ostokokemusta, kuljetusratkaisuja, automaatiovarastoja ja toimitusketjuja. Kansainvälisessä tiimissämme työskentelee yli 100 monialaista ammattilaista liiketoiminnan kehittämisen, teknologian ja designing parissa. Toimimme ketterästi, jatkuvasti oppien ja työtapojamme kehittäen. Liity huippuammattilaisten joukkoon ja tule mukaan rakentamaan S-kauppojen menestystarinaa! Millaisesta tehtävästä on kyse? Etsimme Technical Product Owneria vastaamaan ruoan verkkokaupan automaatiovarastojen WMS-järjestelmän (Warehouse Management System) tehokkaasta käytöstä, kehittämisestä ja ylläpidosta yhdessä asiantuntevan tiimin kanssa. Teet tiivistä yhteistyötä ruoan verkkokaupan liiketoiminnan ja teknisen kehityksen ammattilaisten kanssa ja tuet sekä SOK:n asiantuntijoita että alueosuuskauppojen keräilykeskustiimejä heidän päivittäisessä työssään. Lisäksi toimit aktiivisessa yhteistyössä WMS-järjestelmätoimittajan kanssa. Rooli tarjoaa mahdollisuuden osallistua uusien keräilykeskusten käyttöönottoihin ja olla mukana suunnittelemassa automaatioasteen kasvattamista - esimerkiksi robotiikan tuomista osaksi prosesseja. Tässä tehtävässä pääset vaikuttamaan kasvavan liiketoiminnan kehitykseen ja rakentamaan roolia omien vastuualueiden puitteissa. Keräyskeskukset ovat keskeinen osa S-kauppojen verkkokaupan tulevaisuutta, ja niiden teknologia kehittyy nopeasti. Olet tärkeässä roolissa varmistamassa tehokkaat ja modernit keräily ratkaisut yhdessä motivoituneen tiimin kanssa. Työskentelypaikkana meillä on Helsingin toimistomme, Ässäkeskus, jossa kohtaamme kollegoidemme kanssa useamman kerran viikossa. Työtehtävien salliessa voit myös joustavasti työskennellä etänä osan viikosta. Toivomme myös mahdollisuutta satunnaisesti työskennellä varastoillamme. Minkälaista osaajaa etsimme? Sinulla on 2-3 vuoden kokemus tuoteomistajan roolista sekä vahva kiinnostus varastoprosesseihin ja WMS-järjestelmiin. Olet utelias ja analyyttinen, ja sinulta löytyy oma-aloitteinen työote sekä kyky viedä asiat maaliin asti. Menestyt tehtävässä, kun pidät osaamisesi ajan tasalla ja osaat viestiä sujuvasti suomeksi ja englanniksi erilaisten sidosryhmien kanssa. Lisäksi toivomme: Hyviä tietoteknisiä taitoja, erityisesti WMS-järjestelmien parissa. Kykyä analysoida dataa ja tehdä päätöksiä tuloksien perusteella. Kehityssuuntautunutta asennetta ja halua oppia uutta. SQL-osaamisesta on hyötyä tehtävässä. AMK- tai yliopistotason tutkintoa soveltuvalta alalta. Halukkuutta ja mahdollisuutta työskennellä eri keräilykeskuksillamme tarpeen mukaan. Miksi valita meidät? Reilun palkan, monipuolisten työsuhde-etujemme sekä mainioiden ja asiantuntevien kollegoiden lisäksi tarjoamme sinulle: Mahdollisuuden parantaa, vaikuttaa ja helpottaa S-ryhmän työntekijöiden ja miljoonien ihmisten arkea. Yhteistoiminnallisiin arvoihin ja periaatteisiin perustuvan vakaan ja joustavan työympäristön, mahdollisuuden vaikuttaa omaan työaikaan ja -paikkaan. Vaikuttavuutta ja vastuuta. Meillä on paljon vapautta työssä mutta elämme ratkaisujemme kanssa, samoin kuin miljoonat käyttäjät. Omistajuutta. Luot palveluita suoraan loppukäyttäjille. Et ole vain piipahtamassa projektissa, vaan omistat palvelun/ tuotteen yhdessä tiimisi kanssa. Työyhteisön demokratiaa. Toimintatapamme eivät ole kiveen hakatut. Yhdessä kehitämme jatkuvasti tapoja kehittää tuotteita ja palveluita. Konkreettisia ja palkitsevia tuloksia, jotka voit kokea itse S-ryhmän palveluita käyttämällä, ostoksilla, tankkaamalla tai hotellissa yöpyessäsi. Mahdollisuuden hankkia teknistä osaamista monipuolisilla teknologia-alueilla (kuten web, mobiili ja pilvi) sekä liiketoiminta-alueilla (ravintolat, hotellit, verkkokauppa ja huoltoasemat), ison talon monipuoliset ura- ja kehityspolut sekä IT-yhteisömme laajan asiantuntijaverkoston vertaistuen. Työterveys-, liikunta- ja kulttuuriedut sekä lounasedun henkilökunnan ravintolassamme sekä pääsyn Ässäkeskuksen harrastus- ja liikuntatiloihin. Miltä vaikutti? Kuulisimme mielellämme sinusta Lähetä meille CV:si ja hakemuksesi 7.12.2025 mennessä. Käymme aktiivisesti hakemuksia läpi jo hakuajalla ja kutsumme sopivimmat ehdokkaat jatkokeskusteluun. Ilmoitamme kaikille hakijoille päätöksestä kahden viikon kuluessa hakuajan päättymisen jälkeen. Rekrytointiprosessimme aikana tapaat rekrytoijan, tulevan esihenkilösi ja mahdollisia tulevia kollegojasi. Rekrytointiprosessimme viimeisessä vaiheessa osallistut soveltuvuusarviointiin. Me S-ryhmässä olemme sitoutuneet työskentelemään monimuotoisen ja syrjimättömän työympäristön puolesta, jossa kunnioitetaan ja arvostetaan kaikkien työntekijöidemme ainutlaatuisia taustoja, taitoja ja näkemyksiä. S-ryhmän osuuskauppojen omistama Suomen Osuuskauppojen Keskuskunta, eli tuttavallisemmin SOK, tuottaa S-ryhmän yrityksille hankinta-, asiantuntija- ja tukipalveluita sekä vastaa S-ryhmän strategisesta ohjauksesta ja eri ketjujen kehittämisestä. SOK:lla työskentelee noin 2300 asiantuntijaa vaativissa liiketoiminnan kehitystehtävissä, IT:n, digikehityksen ja muotoilun parissa, taloushallinnossa, kiinteistö- ja energiatehokkuusalalla, HR:ssä sekä viestinnässä ja markkinoinnissa. Vastuulliseen osuustoiminnallisuuteen perustuvat arvot ohjaavat toimintaamme: olemme asiakasta varten, uudistamme jatkuvasti toimintaamme, kannamme vastuuta ihmisistä ja ympäristöstä ja toimimme tuloksellisesti. #SOK",
    "status": "new",
    "notes": ""
  },
  "score": 45.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "product owner",
    "IT"
  ],
  "category": "Review"
}