{
  "job": {
    "id": "ef7b8b2c97e32134",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/sales-manager-product-specialist-focus-scsom-19791071",
    "title": "Sales Manager - Product Specialist focus",
    "company": "Topcon Europe Medical B.V.",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 27.11.",
    "discovered_date": "2025-12-01T14:38:30.079650",
    "description": "Company Description Topcon Healthcare sees eye health differently. Our vision is to empower providers with smart and efficient technologies for enhanced patient care. Keeping pace with the ever-changing landscape of the healthcare industry, we offer the latest integrated solutions including advanced multimodal imaging, vendor-neutral data management and groundbreaking remote diagnostic technology. By investing in value-driven innovations, Topcon works to enable people to enjoy good health and a high quality of life. Job Description We are seeking a highly motivated and experienced Sales Manager - Product Specialist to drive commercial growth and represent our world-class ophthalmic and diagnostic product portfolio across Norway or Finland. This senior professional will play a dual role: combining strategic sales leadership with in-depth product expertise, strengthening Topcon's position as a trusted partner to healthcare professionals and institutions. What You'll Do As Sales Manager / Product Specialist, you will take full ownership of your territory's commercial success. You will manage the entire sales cycle: from identifying new opportunities and nurturing key accounts, to closing deals and ensuring customer satisfaction. In parallel, you will act as a product specialist, delivering clinical and technical insight that empowers customers to make confident investment decisions. Your responsibilities will include: Developing and executing a territory business plan that drives growth and achieves sales and margin targets. Identifying and securing new business opportunities across hospitals, clinics, and optometry practices. Building and maintaining long-term customer relationships through regular meetings, demonstrations, and consultations. Acting as the product expert , delivering presentations, demonstrations, and post-sale support for Topcon's ophthalmic portfolio. Collaborating with marketing, service, and product management teams to deliver integrated customer solutions. Representing Topcon at major national and international trade fairs, exhibitions, and professional events. Preparing accurate forecasts, reports, and market insights, ensuring CRM and pipeline data are kept up to date. Monitoring competitor activity and market trends, contributing to the regional commercial strategy. Who You Are You are a strategic, customer-focused, and results-driven sales professional with a strong technical mindset and genuine passion for the ophthalmic and diagnostic equipment sector. You thrive on building relationships and translating technical excellence into commercial success. You will: Demonstrate a proactive, entrepreneurial approach to territory management and business growth. Communicate persuasively with technical and non-technical audiences. Build trust and credibility with healthcare professionals, decision-makers, and partners. Show resilience, determination, and adaptability in complex or competitive sales environments. Balance strategic vision with hands-on sales execution and customer engagement. Collaborate effectively across cross-functional teams to ensure a seamless customer experience. Represent Topcon with professionalism, confidence, and integrity at all times. Act as a product ambassador, translating complex technology into clear, value-driven solutions. Qualifications A bachelor's degree in business, engineering, life sciences, optometry, or a related technical discipline - or equivalent experience in B2B medical/ophthalmic sales. 5-10+ years' proven sales experience in medical devices, ophthalmic equipment, diagnostic instruments, or a similar technical sales environment. Demonstrated success in meeting or exceeding sales targets and managing full sales cycles. Strong understanding of clinical workflows, ophthalmic diagnostics, and market trends. Experience presenting at trade fairs, exhibitions, or professional conferences. Solid CRM and digital tool proficiency; capable of managing pipelines, data, and forecasts effectively. Valid driver's license and willingness to travel nationally and internationally as needed. Fluency in English (written and spoken). Additional Information Videos To Watch",
    "status": "new",
    "notes": ""
  },
  "score": 45.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "senior",
    "lead",
    "manager",
    "IT"
  ],
  "category": "Review"
}