{
  "job": {
    "id": "f555f11cd9b844dc",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/service-delivery-manager-pankkitoimiala-scsgi-19763918",
    "title": "Service Delivery Manager, pankkitoimiala",
    "company": "CGI Suomi",
    "location": "Helsinki –",
    "posted_date": "Julkaistu 18.11.",
    "discovered_date": "2025-12-01T14:39:27.539083",
    "description": "Position Description: CGI on yksi suurimmista IT- ja liiketoimintakonsultoinnin yrityksistä Suomessa ja maailmalla. Vahva kokemuksemme eri toimialoilta auttaa julkisen ja yksityisen sektorin asiakkaitamme onnistumaan digitaalisessa muutoksessa ja saavuttamaan tavoitteitaan entistä tehokkaammin. Service Delivery Manager - pankkitoimiala Haluatko olla mukana kehittämässä tulevaisuuden myynnin työkaluja ja palveluita? Etsimme kokenutta Service Delivery Manageria, joka vastaa pankkitoimialan myynnin työkalujen ja palveluiden kehityksestä, ylläpidosta ja jatkuvasta parantamisesta. Tässä roolissa olet avainasemassa varmistamassa, että ratkaisut tuottavat todellista arvoa myyjille, asiakaskohtaamisiin ja koko pankin asiakaskokemukseen. Roolisi ja tehtäväsi Service Delivery Managerina johdat palvelutoimitusta yhdessä osaavan tiimimme kanssa. Työsi on monipuolinen yhdistelmä ihmisten johtamista, kehitystyön koordinointia ja yhteistyötä eri sidosryhmien - IT:n, liiketoiminnan ja ulkoisten kumppaneiden - kanssa. Arjessasi vastaat mm. seuraavista: • IT-palveluiden ja sovellusten kehityksen ja hallinnan kokonaisuudesta • kehitystyön priorisoinnista ja etenemisen seurannasta • palveluiden jatkuvasta parantamisesta ja laadun varmistamisesta • tiiviistä yhteistyöstä liiketoiminnan, teknologian ja toimittajien kanssa Tuleva tiimisi Pääset osaksi pankkitoimialan asiakkuuksiin keskittyvää tiimiä, joka vastaa myynnin työkalujen ja palveluiden kehittämisestä. Toimimme ketterässä ja kansainvälisessä ympäristössä, jossa tiimit tukevat toisiaan yli toiminnallisten rajojen. Työskentelemme joustavasti hybridimallissa yhdistäen etä- ja lähityön parhaat puolet. Edellytämme sinulta • Kokemusta IT-palveluiden tai sovellusten kehittämisestä ja/tai hallinnasta pankki- tai rahoitussektorilla (erityisesti in-house-ympäristössä) • Syvällistä ymmärrystä pankin back office -prosessien ja myynnin työkalujen vuorovaikutuksesta • ITIL-osaamista ja mieluiten ITIL 4.0 -sertifikaattia • Kokemusta projektinhallinnasta ja taloudellisesta raportoinnista • Ketterien menetelmien ja jatkuvan palvelun parantamisen tuntemusta • Erinomaista yhteistyö- ja viestintäkykyä sekä kykyä toimia luotettavana kumppanina eri sidosryhmille • Sujuvaa suomen ja englannin kielen taitoa sekä kokemusta kansainvälisestä työympäristöstä Tarjoamme sinulle Tiedämme, että onnistuminen perustuu ihmisiin ja kulttuuriin, toimivia työkaluja ja teknologiaa unohtamatta. CGI:llä saat luoda juuri sinulle sopivaa urapolkua mielenkiintoisten tehtävien sekä sisäisen urakierron kautta. Voit myös jatkuvasti kehittää taitojasi ja syventää osaamistasi mm. CGI Academian avulla. Tarjoamme sinulle työn, jossa voit kehittyä haluamaasi suuntaan sekä mahdollisuuden omistaa yhtiön osakkeita ainutlaatuisen osakesäästöohjelmamme avulla. Henkilöstöstämme 85 % on osakkeenomistajia ja siksi olemmekin CGI Partnereita. Meillä työ joustaa, kun elämäntilanteesi sitä vaatii. Pidämme huolta sinusta ja hyvinvoinnistasi monipuolisin henkilöstöeduin ja tarjoamme mm. kattavan työterveyshuollon, vapaa-ajan vakuutuksen, sairaan lapsen hoitopalvelun sekä mahdollisuuden työsuhdepolkupyörään. Osallistumalla CGI:n hyvinvointiyhteisöjen toimintaan pääset myös tutustumaan työkavereihin eri puolilta taloa yhteisten harrastusten parissa. Tutustu meihin lisää yrityskohtaisesta työehtosopimuksestamme! Tule rakentamaan omaa urapolkuasi meille! Mikäli tämä tehtävä voisi olla seuraava askel urallasi, haethan tehtävää 7.12.2025 mennessä. Etenemme rekrytointiprosessissa heti sopivan kandidaatin löydyttyä. Lisätietoja tehtävästä antaa Jan-Christian Sjelvgren, numerosta 0505508652. Perusmuotoinen turvallisuusselvitys tullaan tekemään tehtävän niin vaatiessa. Tutustu meihin lisää: CGI Ura Facebook , Instagram , LinkedIn , X , YouTube #LI-MP5 Skills: Customer Interface Management Delivery Management English Finnish Scrum Master What you can expect from us: Together, as owners, let's turn meaningful insights into action. Life at CGI is rooted in ownership, teamwork, respect and belonging. Here, you'll reach your full potential because... You are invited to be an owner from day 1 as we work together to bring our Dream to life. That's why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our company's strategy and direction. Your work creates value. You'll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise. You'll shape your career by joining a company built to grow and last. You'll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons. Come join our team-one of the largest IT and business consulting services firms in the world.",
    "status": "new",
    "notes": ""
  },
  "score": 65.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "preferred_company": 15.0,
    "preferred_location": 10.0
  },
  "matched_keywords": [
    "delivery manager",
    "lead",
    "manager",
    "IT"
  ],
  "category": "Review"
}