{
  "job": {
    "id": "f68486e7e8302ca8",
    "source": "duunitori",
    "url": "https://duunitori.fi/tyopaikat/tyo/technical-product-manager-sdsan-19725194",
    "title": "Technical Product Manager",
    "company": "Danfoss",
    "location": "Vaasa ja 2 muuta –",
    "posted_date": "Julkaistu 5.11.",
    "discovered_date": "2025-12-01T14:38:30.079106",
    "description": "The Impact You'll Make At Danfoss Drives, we're driving the transformation toward a smarter, safer, and more energy-efficient future. As our new Technical Product Manager, Cybersecurity, you'll play a key role in protecting the technology that powers sustainable industry - ensuring our electrical motor drives meet the highest global cybersecurity standards You'll help shape how cybersecurity comes to life in our products - from design to certification - giving customers the confidence that their automation systems are secure and future-ready. This is your opportunity to make a tangible impact at the intersection of innovation, compliance, and safety Join a team that values collaboration, continuous learning, and doing work that truly matters. Together, we'll set new benchmarks for cybersecurity in industrial automation Position is located: Vaasa, Tampere or Helsinki What You'll Be Doing Lead and manage cybersecurity certification activities (IEC62443-4) for our drive products, working closely with skilled development and compliance teams. Collaborate with internal R&D, product management, and customers to align on cybersecurity goals and deliver trusted, compliant solutions. Guide documentation and validation processes that demonstrate compliance throughout the product lifecycle. Supervise and maintain security lifecycle activities, ensuring consistent, evidence-based certification outcomes. Support continuous improvement by sharing best practices and identifying opportunities to enhance security processes. What We're Looking For Proven experience in embedded device cybersecurity development and certification. Hands-on knowledge of the IEC62443-4 cybersecurity certification process - including document management, audits, and implementation. Degree (B.Sc. or M.Sc.) in computer science, automation, or a related engineering field. Structured, self-driven mindset with strong communication and stakeholder management skills. Experience in functional safety (IEC61508) or electrical motor drives is an advantage. Join Danfoss Drives and become part of a team making a significant impact in energy efficiency and electrification. As a global leader in power conversion solutions, we are committed to sustainability, exceptional quality, and fostering an inclusive work environment. Our technology powers industries worldwide and supports global decarbonization efforts. Engineer a better future with Danfoss, where meaningful change begins with you! What You'll Get from Us We promote from within and support your learning with mentoring, training, and access to global opportunities. You'll have flexibility, autonomy, and support to do your best work while maintaining a healthy work-life balance. Your well-being matters to us. We strive to create an inclusive work environment where people of all backgrounds are respected, and valued for who they are. Ready to Make a Difference? If this role excites you, we'd love to hear from you! Apply now to start the conversation and learn more about where your career can go with us. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, veteran status, or other protected category. Danfoss engineers solutions that increase machine productivity, reduce emissions, lower energy consumption, and enable electrification. Our solutions are used in such areas as refrigeration, air conditioning, heating, power conversion, motor control, industrial machinery, automotive, marine, and off- and on-highway equipment. We also provide solutions for renewable energy, such as solar and wind power, as well as district-energy infrastructure for cities. Our innovative engineering dates back to 1933. Danfoss is family-owned, employing more than 39.000 people, serving customers in more than 100 countries through a global footprint of 95 factories. Danfoss engineers solutions that increase machine productivity, reduce emissions, lower energy consumption, and enable electrification. Our solutions are used in such areas as refrigeration, air conditioning, heating, power conversion, motor control, industrial machinery, automotive, marine, and off- and on-highway equipment. We also provide solutions for renewable energy, such as solar and wind power, as well as district-energy infrastructure for cities. Our innovative engineering dates back to 1933. Danfoss is family-owned, employing more than 39.360 people, serving customers in more than 100 countries through a global footprint of 95 factories.",
    "status": "new",
    "notes": ""
  },
  "score": 55.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "negative_keywords": -20.0,
    "preferred_company": 15.0
  },
  "matched_keywords": [
    "product manager",
    "infrastructure",
    "documentation",
    "lead",
    "manager",
    "IT"
  ],
  "category": "Review"
}