{
  "job": {
    "id": "1465176",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1465176",
    "title": "QA Engineer",
    "company": "Reach-U AS",
    "location": "Unknown",
    "posted_date": "2025-11-10T13:23:23.000+00:00",
    "discovered_date": "2025-12-02T23:33:47.807348",
    "description": "Reach-U works with customers around the world on unique, data-driven software projects. With our purpose-built technology, our customers can perform business analysis more interactively and much faster than with other tools. Join our team in Tartu and make a global impact! What You'll Be Doing: Were looking for a detail-oriented and proactive QA Engineer with a strong interest in test automation to join our QA community. Youll work closely with developers, project managers, and other stakeholders to ensure our products meet the highest standards of quality, reliability, and performance. Your responsibilities will include: Design, implement, and maintain test plans and test cases (manual and automated). Execute functional, regression, integration, and exploratory tests. Develop and maintain test automation scripts (if applicable). Identify, document, and track defects; work closely with developers to resolve them. Participate in sprint planning, backlog grooming, and daily standups. Analyze test results and provide feedback on product quality. Contributing to continuous improvement of QA processes and test automation strategy. What You'll Bring to the Team: 2+ years of hands-on QA experience (manual and/or automation). Strong understanding of SDLC, testing methodologies, and QA best practices. Experience with tools such as: Manual: Jira, Postman Automation: Selenium, Cypress, Playwright etc. Familiarity with CI/CD pipelines (e.g., GitHub Actions, Jenkins). Knowledge of API testing (REST, GraphQL). Good scripting skills in [JavaScript / Python / Java / etc.]. Strong communication and collaboration skills. Attention to detail and analytical thinking. Initiative to improve testing processes and product quality. Excellent English and Estonian proficiency (written & spoken). It would be great if you are familiar with following: Performance testing (using JMeter, k6 or other similar tool). Security or accessibility testing awareness (OWASP Top10, WCAG). ISTQB FL certificate or other QA certifications. Why Join Reach-U? Opportunities for professional development and growth. Strong customers that trust us with the most demanding and fulfilling tasks. One self-development day per month. Sports or health compensation.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 60.0,
  "score_breakdown": {
    "positive_keywords": 60.0
  },
  "matched_keywords": [
    "python",
    "javascript",
    "java",
    "ci/cd",
    "API",
    "project manager"
  ],
  "category": "Review"
}