{
  "job": {
    "id": "1460957",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1460957",
    "title": "Senior Lawyer",
    "company": "Wallester AS",
    "location": "Unknown",
    "posted_date": "2025-11-03T13:33:57.000+00:00",
    "discovered_date": "2025-12-02T23:39:22.393145",
    "description": "Masters degree in law from Estonia (preferred) or another EEA/EU university. Full professional fluency in English required; Estonian language skills considered an advantage. Minimum 2 years legal practice in the financial sector, either in-house or at a law firm specialising in financial law, ideally in payments, fintech, or banking. Expertise in one or more of the following areas: payment services regulation, contract drafting and negotiation, data protection, AML/CFT, corporate governance, or intellectual property. Proven ability to take ownership of legal fields and serve as a subject-matter expert. Take ownership of key legal fields and provide high-level advice across the business. Monitor regulatory developments, assess compliance implications, and advise stakeholders on legal risks and business impact. Draft, review, and negotiate agreements, legal opinions, and other key documents. Lead dispute resolution, litigation, and settlement processes, coordinating internal teams and external advisors. Mentor junior legal team members and lead smaller project-based teams. Represent the legal function in the development of new services and products. Serve as the primary manager and contact for external advisors and foreign offices in complex international legal matters. Design and enhance internal legal workflows, policies, and cross-functional projects. Ensure compliance with corporate governance requirements and support company secretarial matters. Competitive salary Medical Insurance upon the completion of the probationary period A modern office in the center of Tallinn Referral program Stebby Free parking Growth and Development We invest in your professional journey with continuous learning opportunities, skill development programmes, and a clear path for career progression Collaborative and Innovative Environment Join a talented, motivated team that thrives on creativity, innovation, and collaboration in a fast-paced Fintech setting Team Events and Company Celebrations Take part in regular team-building activities and company-wide events that strengthen connections and celebrate shared success",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -40.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "senior"
  ],
  "category": "Low Priority"
}