{
  "job": {
    "id": "1460968",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1460968",
    "title": "Lawyer (Employment & OHS)",
    "company": "Wallester AS",
    "location": "Unknown",
    "posted_date": "2025-11-03T13:42:13.000+00:00",
    "discovered_date": "2025-12-02T23:33:52.725463",
    "description": "Develop and maintain Wallesters employment law and OHS policy framework. Advise managers and executives on employment law and OHS matters. Draft and update employment contracts, templates, internal policies, and OHS guidelines. Support organisation-wide projects related to changes in employment or OHS policies. Liaise with public authorities on employment and OHS issues. Lead representation in employment-related disputes, coordinating with external counsel when necessary. Monitor developments in Estonian and EU employment/OHS regulation and advise on impact. Deliver internal training and awareness initiatives. Provide general support to the legal team when not engaged in employment or OHS matters. Develop and maintain Wallesters employment law and OHS policy framework. Advise managers and executives on employment law and OHS matters. Draft and update employment contracts, templates, internal policies, and OHS guidelines. Support organisation-wide projects related to changes in employment or OHS policies. Liaise with public authorities on employment and OHS issues. Lead representation in employment-related disputes, coordinating with external counsel when necessary. Monitor developments in Estonian and EU employment/OHS regulation and advise on impact. Deliver internal training and awareness initiatives. Provide general support to the legal team when not engaged in employment or OHS matters. Estonias largest payment institution by transaction volume Licensed to provide services across the EEA and UK, serving both B2B and B2C sectors Issuer of Visa cards with the highest level of Visa membership: Principal Member Headquartered in Tallinn, with offices in France and Latvia, and a sister company in the UK Team of ~150 professionals, working primarily in English, with strong multilingual diversity",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}