{
  "job": {
    "id": "1462140",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1462140",
    "title": "Tarkvaraarendaja",
    "company": "Töötukassa vahendatud pakkumised",
    "location": "Unknown",
    "posted_date": "2025-11-05T03:04:15.000+00:00",
    "discovered_date": "2025-12-02T22:39:38.365096",
    "description": "Tööandja nimi:\nFOB Solutions OÜ\n\nTööülesanded:\nOtsime kogenud back-end arendajat, kes soovib panustada innovaatilisse ja laia kasutajaskonnaga avaliku sektori projekti.\nTöö hõlmab süsteemide arhitektuuri kavandamist, API-de disaini ja integreerimist, hajussüsteemide arendust ning pilvelahenduste juurutamist. Otsime arendajat, kellel on tugev tehniline taust ja soov luua stabiilseid ning skaleeritavaid teenuseid, mis toetavad suuremahulist kasutajaliiklust ja reaalajas andmetöötlust.\nPeamised kasutatavad tehnoloogiad:\nJava, Spring, Gradle, REST, Kafka, AWS\n\nNõutud keeleoskus:\nET, kõne: B1, kiri: B1, kohustuslik\n\nMuud nõuded:\nKui oled valmis võtma vastu põnevaid väljakutseid ja panustama tipptasemel projektidesse, siis FOB Solutions on just Sulle õige koht!\nKandideeri kohe!\n\nOmalt poolt pakume:\n- Null mikrojuhtimist: Usume oma töötajatele vabaduse andmises oma töös silma paista ja usaldame oma meeskonnaliikmeid ilma mikrojuhtimiseta silmapaistvate tulemuste saavutamises.\n- Avatud suhtlus: Sinu arvamus on meile oluline. Hindame Sinu ideid, tagasisidet ja teadmisi. Meie ettevõtte kultuur soodustab avatud suhtlemist.\n- Andekas meeskond ja kolleegid: Liitud meeskonnaga, mis koosneb kogenud arendajatest ja spetsialistidest, kes on oma tööle väga pühendunud. Sul on võimalus neilt  õppida ja aidata kaasa positiivse ja kaasava töökoha loomisele.\n- Väga konkurentsivõimeline töötasu vastavalt Sinu pädevusele\n- Toredad meeskonnaüritused ja võrgustiku loomise võimalused\n- Isiklik arengukava\n- Värsked puuviljad, suupisted, kohv ja palju muud\n\nKandideerimise info:\nTähtaeg: 2025-12-05\nTöösuhte kestus: tähtajatu\n\nVajalikud dokumendid:\nCV\n\nLisateave:\nVarasem töökogemus: vähemalt 5 aastat",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "aws"
  ],
  "category": "Low Priority"
}