{
  "job": {
    "id": "1463290",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1463290",
    "title": "Tehase juht",
    "company": "Mercuri Urval",
    "location": "Unknown",
    "posted_date": "2025-11-28T11:00:01.296+00:00",
    "discovered_date": "2025-12-02T22:39:43.201644",
    "description": "Ootused kandidaadile:\nSelles põnevas ja nõudlikus rollis edu saavutamiseks peaks Sul olema vähemalt viieaastane tootmise juhtimise kogemus eelistatult tehase juhi või tootmisjuhi tasemel ning vähemalt bakalaureuse tasemel tehniline või tööstusalane haridus (nt mehhatroonika, tootmise juhtimine, tööstusinseneeria, tehnika). Oled tulemusele orienteeritud juht, kes väärtustab arengut ja koostööd.\nLisaks eeldame, et Sa:\nOled tulemuslik tootmisvajaduste täitmisel, keskendudes tootlikkusele, kvaliteedile ja kuludele\nSuhtled vabalt eesti ja inglise keeles (teiste keelte oskus on eeliseks)\nOled kogenud ja koostöövalmis juht ning hea suhtleja\nUsud kvaliteedi tähtsust ning oled varasemas töös kasutanud erinevaid kvaliteedistandardeid\nOled kasutanud vähemalt üht ERP süsteemi\nOmad head praktilist kogemust tootmise planeerimisest, hooldusest, logistikast ja kvaliteediprotsessidest\nMõistad LEAN filosoofiat ja jagad selle põhimõtteid\nOled töötanud rahvusvahelises kontsernis\n\nTööülesannete kirjeldus:\nMeie jaoks on oluline kvaliteet, kasv ja areng. Tehase juht vastutab tehase arendamise eest koostöös peakorteriga ning firma kogu tegevuse juhtimise eest Eestis. Oluline on arendada koostööd kontserni sees veelgi suurema sünergia ja veelgi paremate tulemuste saavutamiseks. Seisad hea selle eest, et meie Eestis asuv tehas toodaks ja tarniks ohutult, õigeaegselt, õiges koguses ja vajaliku kvaliteediga. Sinu roll hõlmab loomulikult ka inimeste juhtimist, kulude kontrolli ning turvalise töökeskkonna tagamist.\nTehase kõiki osakondi tootmist, hooldust, ladu, kvaliteeti ja kohalikke tugifunktsioone juhtides toetad Sulle alluvaid professionaale ja tagad nende tõhusa omavahelise koostöö. Vastutad kogu tootmisüksuse eelarve eest, hallates rahavooge muuhulgas varude ja lao optimaalse kasutamise abil, kuid ei kanna müügivastutust.\nOled peamiseks kontaktisikuks meie väliste partnerite ja kontserni teiste üksuste jaoks ning teed tihedat koostööd peakontoris asuva ostu-, kvaliteedi-, inseneriteami ja projektijuhtimise meeskonnaga.\nSinu igapäevaste oluliste ülesannete seas on veel:\nEelarve ja kulude jälgimine ning efektiivsusmeetmete rakendamine\nVõtmemõõdikute (efektiivsus, seisakud, kvaliteet, laovarud jne)analüüs ja analüüsitulemuste põhjal tootmise tõhustamine\nOhutus- ja keskkonnanõuetega vastavuse tagamine\nTöötajate värbamine, väljaõpe ja tulemusjuhtimine koostöös personaliosakonnaga\nGrupi kvaliteedistandardite rakendamine\n\nOmalt poolt pakume:\nPakume arendavat tootmisvaldkonna rolli rahvusvahelises ettevõttes, millega kaasneb motiveeriv hüvituspakett, kõik vajalikud töövahendid ning ametiauto.\n\nLisainfo:\n5112427\nHelistage soovitavalt vahemikus 9:00 - 12:00",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}