{
  "job": {
    "id": "1464515",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1464515",
    "title": "Kvaliteedijuht",
    "company": "Mercuri Urval",
    "location": "Unknown",
    "posted_date": "2025-11-26T09:01:59.032+00:00",
    "discovered_date": "2025-12-02T22:39:43.201787",
    "description": "Ootused kandidaadile:\nSelles põnevas ja nõudlikus rollis edu saavutamiseks peaks Sul olema mõneaastane tööstusettevõtte kvaliteedijuhtimise, kliendiauditite, uute toodete lansseerimise ja kvaliteedisertifikaatidega töötamise kogemus ning tehniline või tööstusalane koolitus (kutse- või kõrgharidus näiteks kvaliteedijuhtimise, tootmise juhtimise või tööstusinseneeria valdkonnas). Kvaliteediaudiitori koolitus ja erinevate probleemilahenduse meetodite koolitus on samuti vajalik. Oled tulemusele orienteeritud kvaliteedijuht, kes väärtustab arengut ja koostööd.\nLisaks eeldame, et Sa:\nOled tulemuslik nii igapäevaste tegevuste kui ka süsteemitasandi kvaliteedihalduses\nSuhtled vabalt eesti ja inglise keeles (teiste keelte oskus on eeliseks)\nOled koostöövalmis ja hea suhtleja\nMõistad kvaliteedi tähtsust ning tunned põhjalikult erinevaid kvaliteedistandardeid ja meetodeid (nt Six Sigma, APMI, Kaikaku)\nOled töötanud rahvusvahelises keskkonnas\nOled analüütiline ja struktureeritud\n\nTööülesannete kirjeldus:\nMeie jaoks on oluline kvaliteet, kasv ja areng. Kvaliteedijuht vastutab tehase kvaliteediprotsesside arendamise eest koos peakorteriga ning kogu Eestis asuva kvaliteedialase tegevuse juhtimise eest. Oluline on arendada koostööd kontserni kvaliteedijuhi ning teiste tehaste kvaliteedijuhtidega veelgi suurema suurema sünergia ja veelgi paremate tulemuste saavutamiseks.\nVastutad selle eest, et meie tooted ja protsessid vastaksid klientide ootustele ja spetsifikatsioonidele, seadusandlikele nõuetele ja firma kvaliteedistandarditele. Vastutad täielikult Eesti tehase kvaliteedihalduse süsteemi ja tooteohutuse eest. Allud otseselt tehase juhile igapäevaste tegevuste osas ja funktsionaalselt kontserni kvaliteedijuhile meetodite, süsteemide ja grupi arendusprojektide osas.\nVastavalt vajadusele toetad oma tööga tehase kõiki osakondi tootmist, hooldust, ladu ja kohalikke tugifunktsioone ning Sulle allub kvaliteedispetsliast. Edendad tugevat kvaliteedikultuuri, haldad tõhusalt kvaliteedihalduse süsteemi ning tagab, et protseduurid on ajakohased, lihtsalt järgitavad ja järjekindlalt rakendatud.\nOled kvaliteediteemade osas meie peamine kontakt klientide, tarnijate, audiitorite ja ametiasutustega suheldes.\nSinu igapäevaste oluliste ülesannete seas on veel:\nKvaliteedialaste võtmemõõdikute jälgimine, analüüs ja aruandlus\nParendusettepanekute esitamine tehase juhile ja kontserni kvaliteedijuhile\nMuutuste haldamine ja kvaliteedi planeerimine uute toodete juurutamisel\nKliendikaebustega tegelemine ja ennetavad ning korrigeerivad meetmed\nStruktureeritud probleemilahenduse juhtimine (nt 8d ja Ishikawa)\nTarnijate kvalifitseerimise toetamine\nSise- ja muude auditite planeerimine ja läbiviimine\nTestimisvõimaluste ja mõõteseadmete kalibreerimise ja korrasoleku tagamine\n\nOmalt poolt pakume:\nPakume arendavat tootmisvaldkonna rolli rahvusvahelises ettevõttes, millega kaasneb motiveeriv hüvituspakett ja kõik vajalikud töövahendid.\n\nLisainfo:\n5112427\nHelistage soovitavalt vahemikus 9:00 - 12:00",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}