{
  "job": {
    "id": "1466630",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1466630",
    "title": "DevOps Systems Engineer Road Logistics (m/w/d)",
    "company": "Kühne + Nagel ",
    "location": "Unknown",
    "posted_date": "2025-11-26T09:01:59.042+00:00",
    "discovered_date": "2025-12-02T22:39:50.109919",
    "description": "Job description:\nIt's more than a job\nIn this IT role, you will manage, develop, and support the technology infrastructure that powers Kuehne+Nagel's global systems and operations. This contribution is vital to making both special and ordinary moments in the lives of people a reality. In fact, your work enables our teams to deliver fresh fruit, time-sensitive healthcare products and much more to people all around the world. Working in IT at Kuehne+Nagel contributes to more than we imagine.\nAre you a talented DevOps engineer with a passion for automation and solving complex challenges? Join our international team in Tallinn and play a pivotal role in building and supporting the successful delivery of value in our Road Logistics products.\nThe main focus of this role is development-oriented. You will design, implement, and maintain the DevOps platform that supports the development process and release pipelines for Road Logistics applications throughout the entire software development lifecycle. A key aspect of the role is optimizing workflows through automation and well-architected systems. Additionally, you will be involved in migrating applications to containers and cloud environments, including OpenShift, Kubernetes, and AWS. Ensuring the efficient utilization of cloud-based infrastructure and services across all teams is essential, preventing silos or knowledge islands. You will also champion best practices such as observability, Infrastructure-as-Code, and GitOps, seamlessly integrating them into the existing infrastructure and processes.\nHow you create impact\nTaking part in managing non-production and production environments for Road Logistics applications.\nImplementing observability pillars with centralized monitoring, logging and alerting.\nAutomating tasks and processes as much as possible.\nCollaborating with infrastructure and product development teams to improve applications and processes.\nEnsure security and compliance across all stages of the software development lifecycle.\nPromoting DevOps culture and mindset.\nWhat we would like you to bring\nMinimum 3 years of experience in a similar role (DevOps Engineer, SRE, or Platform Engineer).\nHands-on experience with at least one major cloud provider, preferably AWS.\nStrong Linux background with experience in configuration management tools (Ansible preferred).\nProficiency in CI/CD tools, ideally Jenkins or GitLab, with experience in automation and deployment.\nScripting skills for automating routine tasks using Python, Groovy, or Bash.\nExpertise in container tooling and orchestration, such as Kubernetes or OpenShift.\nAbility to develop scalable solutions that do not reinvent the wheel but can rather themselves serve as blueprints for tackling similar or even new challenges.\nExperience working in hybrid infrastructures, securely connecting cloud and on-premises environments, with strong collaboration skills in international teams and proficiency in English (spoken and written).\nWhat's in it for you\nJoin Kuehne+Nagel's IT Hub in Tallinn, where your work will have a meaningful impact on the logistics industry. Here, you'll find a hybrid work model, extensive health benefits, and a culture of continuous learning that ensures your career growth. You'll be surrounded by extraordinary and committed people, all dedicated to shaping the future of logistics. Even if you don't tick every box, we encourage you to apply your unique perspective and experience could be exactly what we need. Be part of a team that values work-life balance, supports your personal well-being, and empowers you to contribute to something truly impactful.\nWho we are\nLogistics shapes everyday life - from the goods we consume to the healthcare we rely on. At Kuehne+Nagel, your work goes beyond logistics; it enables both ordinary and special moments in the lives of people around the world.\nAs a global leader with a strong heritage and a vision to move the world forward, we offer a safe, stable environment where your career can make a real difference. Whether we help deliver life-saving medicines, develop sustainable transportation solutions or support our local communities, your career will contribute to more than you can imagine.\nWe kindly advise that placement agencies refrain from submitting unsolicited profiles. Any submissions of candidates without prior signed agreement will be considered our property and no fees will be paid.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 60.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "python",
    "kubernetes",
    "aws",
    "ci/cd",
    "devops",
    "architect"
  ],
  "category": "Low Priority"
}