{
  "job": {
    "id": "1466614",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1466614",
    "title": "Network Operations Engineer",
    "company": "Playtech Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-26T09:01:59.037+00:00",
    "discovered_date": "2025-12-02T22:39:50.110286",
    "description": "Network Operations Engineer:\nAbout Playtech\nFounded in 1999, the company has a premium listing on the Main Market of the London Stock Exchange and is focused on regulated and regulating markets across its B2B business. By leveraging its proprietary technology, Playtech delivers innovative products and services to ensure a safe, engaging and entertaining gaming experience.\nAs the gaming industry's leading technology company, it combines business intelligence-driven software, services, content, and platform technology to drive excellence and innovation across the sector. Read more about who we are and what we do here: www.playtechpeople.com and www.playtech.com\nHere at Playtech, we genuinely believe that people are our biggest asset. Diverse thoughts, experiences, and individual characteristics enrich our work environment and lead to better business decisions. Embracing differences and maintaining transparency in our processes is the core of Playtech's overall commitment to responsible business practices.\nReady to level up your career? Join Playtech as a Network Operations Engineer!\nAre you ready to make an impact in the world of cutting-edge infrastructure?\nPlaytech's\nInfrastructure team is searching for a driven and innovative\nNetwork Operations Engineer\nto help keep the digital gears turning smoothly. If solving challenges excites you and networking is your playground, this is the opportunity you've been waiting for.\nYour influential mission. You will...\nKeep Things Running: Manage and support critical networking components to ensure uninterrupted service.\nShape the Future: Maintain firewall rules and configure load-balancer business logic with the guidance of an experienced team.\nInnovate & Experiment: Be part of infrastructure-focused R&D projects that push boundaries.\nBuild Smarter: Help to develop automation tools to optimize processes.\nBe the Guardian: Take on on-call duties to ensure network infrastructure remains rock-solid 24/7.\nComponents for success. You...\nAre a Creative Thinker: You approach problems like a true engineer, thinking outside the box and crafting both tailored and standardized solutions.\nExcel as a Networking Pro: You're experienced in building and maintaining robust network infrastructures that support diverse products.\nDemonstrate Technical Know-How: Your hands-on expertise spans firewalls, load balancers, switches, routers, and DDoS mitigation solutions (bonus points if CheckPoint, F5, Juniper, or Cisco is in your arsenal!).\nRemain Cool Under Pressure: You excel in dynamic situations, adapting quickly and strategically while juggling multiple tasks with precision.\nLeverage Automator Extraordinaire: You prefer to work smart by leveraging scripting, automation, and orchestration tools.\nCommunicate and Connect Effectively: With your polished English communication skills, you effortlessly collaborate with colleagues and clients.\nYou'll get extra points for...\nFamiliarity with cloud networking concepts and public cloud platforms (like AWS) gives you a winning edge!\nThrive in a culture that values...\nInnovative Projects: Tackle unique challenges with industry-leading tools and technology.\nExpert Mentorship: Work alongside top-notch specialists and accelerate your learning.\nHolistic Growth: Enjoy support for your professional journey, active lifestyle, and mental well-being.\nCommunity Spirit: Engage in exciting events and enjoy perks that make you proud to belong.\nINFRASTRUCTURE UNIT\nOur infrastructure is spread over 20 different countries and 34 data centers. We rely on 25 000 virtual machines and have 39 000 TB of storage space.\nImpressive? Using cutting-edge technologies, we provide central IT infrastructure services to business and internal customers worldwide.\nNETWORK OPERATIONS TEAM\nThe Network Operations team is a dynamic and highly skilled group of Engineers who are ensuring the seamless functioning of digital networks. They possess a deep understanding of complex network architectures and protocols, allowing them to tackle any challenge that comes their way. With our collaborative spirit and unwavering commitment to excellence, we form a cohesive team that thrives on innovation and pushes the boundaries of what is possible in the world of networking.\nPlaytech is an equal opportunities employer. Our mission is to welcome everyone and create inclusive teams. We celebrate differences and encourage everyone to join us and be themselves at work.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "aws",
    "architecture",
    "architect",
    "mentor"
  ],
  "category": "Low Priority"
}