{
  "job": {
    "id": "1466966",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1466966",
    "title": "Senior Credit Risk Analyst",
    "company": "TF Bank AB Eesti filiaal",
    "location": "Unknown",
    "posted_date": "2025-11-12T16:23:08.000+00:00",
    "discovered_date": "2025-12-02T22:39:51.695776",
    "description": "Who we are looking for?:\nWe are seeking a talented Senior Credit Risk Analyst to join our growing credit risk analytics team. This role is specifically designed for professionals with minimum of 3 years of experience in the lending industry who are looking to develop their career in credit risk analytics and statistical modelling within the banking sector.\nPlease note:\nThis position is for a Senior Credit Risk Analyst role focused on credit risk assessment and modelling, not financial analysis.\nAbout the Role\nAs a Senior Credit Risk Analyst, you will contribute to the development and enhancement of our credit risk analytics capabilities. This is an excellent opportunity for someone with a first experience in unsecured lending to get wider exposure and larger remit (affordability and underwriting scorecards and credit strategy, pricing and credit risk management) whilst working with cutting-edge statistical models and data-driven insights.\nYou will have the opportunity to work in an pan-European team and get exposure to credit risk analytics across our international markets including Baltic countries, Germany, Austria and other European markets.\n\nKey Responsibilities::\nData Analysis & Insights: Collect, analyse, and interpret data from multiple sources including internal systems and Credit Bureaus to identify trends, patterns, and opportunities that inform credit policy, credit limit and pricing strategies\nModel Development: Contribute to developing and maintaining statistical models, including scorecards and other credit risk assessment tools\nStakeholder Collaboration: Provide clear, actionable insights and recommendations to stakeholders across the business, supporting informed decision-making and business growth\nCross-functional Teamwork: Work collaboratively with colleagues in the decision sciences and analytics team, as well as other departments across different locations\nCommunication & Reporting: Present complex analytical findings to both technical and non-technical audiences through clear presentations, reports, and data visualisations\n\nEssential Requirements::\nEducation & Experience:\nBachelor's degree in Mathematics, Statistics, Economics, Physics, Computer Science, Engineering, or related quantitative discipline. A Master's degree is preferred.\nMinimum of 3 years of experience in analytics, data science, data analysis, or lending/credit assessment within the financial services sector.\nPrevious experience working for an unsecured lender (bank, fintech, or similar credit provider).\nTechnical Skills:\nStrong analytical and problem-solving abilities with excellent attention to detail\nProficiency in SQL for data extraction, manipulation, and analysis\nUnderstanding of statistical analysis techniques and data modelling methodologies\nExperience or strong interest in predictive modelling (logistic regression knowledge would be advantageous)\nProfessional Skills:\nExcellent written and verbal communication skills in English\nAbility to translate complex data into clear, actionable business insights\nStrong presentation skills with experience communicating to diverse audiences\nProven ability to work effectively in fast-paced environments whilst managing multiple priorities\n\nDesirable Requirements::\nProgramming experience in Python or R\nExperience with data visualisation tools\nUnderstanding of machine learning techniques applied to credit risk\n\nWhat we offer::\nCompetitive salary and benefits package\nOpportunity to work with advanced analytics and statistical modelling techniques\nProfessional development and training opportunities\nCollaborative, inclusive working environment\nFlexible working arrangements\nCareer progression opportunities within our growing analytics function",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "python"
  ],
  "category": "Low Priority"
}