{
  "job": {
    "id": "1467500",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1467500",
    "title": "Quality Assurance Engineer (Manual Testing)",
    "company": "Interactive Brokers Software Services Estonia",
    "location": "Unknown",
    "posted_date": "2025-11-27T12:00:48.725+00:00",
    "discovered_date": "2025-12-02T23:31:27.273061",
    "description": "Interactive Brokers is seeking a Manual Quality Assurance Engineer to join our mQA department. You will be a part of Quality Assurance team that focuses on testing various end user systems, to deliver our clients cutting edge world class solutions for electronic trading. The position is well-suited for an organized individual who is thorough and detailed, can meet deadlines, follow written procedures, collaborate for improvements, and be a team player. Responsibilities Manual functional testing of software releases in mobile and desktop apps during product or feature development. Report test results and submit bug reports for found issues to the bug database (Jira). Handle the whole bug lifecycle up to resolution, verification and closure. Complete other test-related tasks assigned by the Test Lead. Configure hardware and software environments as needed to complete assigned testing. Write and assist in developing test plans and procedures for different web-based products. Assist in the automation of relevant test procedures. Provide technical expertise on specific products and specialized environments. Minimum qualifications: Strong communication skills (good written/spoken English skills are a must). At least one year of software testing experience. Familiarity with testing methodologies and the defect-reporting process. Knowledge of the most common web browsers and general-purpose Windows products. Basic knowledge of iOS/Linux products is a plus. Ability to methodically produce the steps that exhibit bugs in the product and the ability to reproduce and communicate these steps. Showing initiative in gaining in-depth experience in technology relevant to testing company products. Ability to efficiently work independently as well as part of the team. Passion for building top-quality products. A bachelor's degree in computer science or a related field is a big plus. Discretionary, performance-based bonus Stock incentive plan Private health insurance Sport activity compensation Lunch in the office *The benefits package will be reviewed regularly and may be subject to change. Please apply here: https://job-boards.greenhouse.io/ibkr/jobs/8000925002 Sport activities compensation, private health insurance, free lunches, annual bonuses, stock bonus program.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "database"
  ],
  "category": "Low Priority"
}