{
  "job": {
    "id": "1468215",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468215",
    "title": "Head of Internal Audit",
    "company": "IPF Digital AS",
    "location": "Unknown",
    "posted_date": "2025-11-14T12:52:31.000+00:00",
    "discovered_date": "2025-12-02T23:39:27.128329",
    "description": "We are seeking a Head of Internal Audit who will play a key role within IPF Digital, leading and executing the internal audit strategy across all markets. This role will be responsible for ensuring effective risk management, governance, and control processes, while providing independent assurance and actionable insight to IPF Digital management and the Group Head of Internal Audit. Our ideal candidate will strengthen the organisations ability to manage risks, comply with regulatory requirements, and continuously improve its operations in line with the IPF Digital business strategy. About IPF Digital (in a nutshell) IPF Digital provides fast, flexible, and convenient credit solutions under the Creditea and Credit24 brands to retail customers in Estonia, Latvia, Lithuania, Mexico, Australia, and the Czech Republic. Our solutions are designed to be mobile-first with fully digital processes. The technology stack includes a native mobile APP, digital web journeys, and micro-services infrastructure. We offer different type of loan product like instalment loan, credit line, and buy-now-pay-later. Our customers might require money for something vital, such as paying an unexpected bill or coping with day-to-day expenses. Or they may be looking for help to carry out home improvements, buy a car, or start a business. Whatever they need, we offer innovative financial services that are respectful, responsible, and straightforward. Key Responsibilities: Develop and deliver the internal audit plan, ensuring coverage of key business risks, including those specific to the E-Money Institution (EMI) in Estonia with Group Internal Audit methodology and regulatory expectations. Provide independent assurance on governance, risk management, and controls, with focus on EMI compliance and Estonian regulator (Finantsinspektsioon) requirements. Monitor e-money licence obligations, including safeguarding of funds, capital adequacy, AML controls, and operational resilience. Engage with senior stakeholders across IPF Digital and the wider Group to align on risks and regulatory priorities. Report and liaise with regulators, ensuring timely communication of audit findings, risk assessments, and remediation progress. Manage audit resources and third-party providers, ensuring efficient delivery of the audit plan and adherence to quality standards. Advise leadership with insights on internal controls, governance, and compliance processes. Promote a culture of risk awareness and integrity, embedding compliance responsibilities across the business. Stay current on laws, regulations, and best practices to drive continuous improvement and best-in-class audit delivery. Qualifications, skills and experience: Degree-level education with professional accounting qualification (ACA, ACCA, CIMA) or equivalent; CIA/CMIIA certification desirable. 7+ years experience in risk-based internal auditing within complex, multinational environments, with background in accounting, financial reporting, or business process management. Strong knowledge of internal audit, governance, risk, and control frameworks, plus understanding of financial products and digital lending models (desirable). Proven ability to manage senior stakeholders and collaborate across geographically dispersed teams. Excellent communication, report-writing, and presentation skills, credible with senior leaders. Strong analytical and problem-solving abilities, able to manage multiple complex projects under pressure. Skilled in coaching and mentoring to support team development. Fluent in English; proficient in Microsoft Office; willing to travel as needed. What we can offer you: Competitive salary; Annual bonus; Additional employer health insurance and/or sports compensation (Stebby); Anonymous mental health counseling service \"Võõras Sõber\"; Partial remote work opportunity; Modern office in Ülemiste City; Good work assets; Parking near the office; Internal and external training opportunities; Career and development opportunities; Fun company and team events - we even celebrate Halloween! Opportunity to work in a dynamic and fast-paced environment; Chance to make a real impact on the growth and success of the company. You will enjoy working at IPF Digital if you value a truly international work environment where you can take responsibility for your tasks; you value a friendly and open work culture and good teamwork. Here's how our team describes our culture: \"The culture at IPFD is driven by our shared values. People are put first; we accept differences and encourage individuality. Due to our flat business structure, we enjoy collaborating. Although recognition is highly valued, failure is also accepted. Enjoying some good times together is also highly encouraged!\" Sounds good? :) Then Please Apply, and let's meet up. ;)",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "senior",
    "aws",
    "infrastructure",
    "API"
  ],
  "category": "Low Priority"
}