{
  "job": {
    "id": "1468615",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468615",
    "title": "Circuit Design Engineer",
    "company": "Tallinna Elektrotehnika Tehas \"Estel\" AS",
    "location": "Unknown",
    "posted_date": "2025-11-17T07:52:08.000+00:00",
    "discovered_date": "2025-12-02T23:39:23.976269",
    "description": "TET Estel (Tallinn Electrical Engineering Factory), founded in 1870, is a leading player in the power converter equipment market. We design and manufacture power converter systems and semiconductor devices for industrial applications worldwide, offering complex, high-quality, turnkey technological solutions.. We are expanding our R&D department and are looking for a talented Circuit Design Engineer to join our team in Tallinn. 🎓 Requirements Bachelor's degree in Electrical or Electronic Engineering; At least 3 years of hands-on experience in circuit design; Experience in schematic and PCB documentation development; Proficiency in MATLAB and/or Mathcad for modeling and simulations; Knowledge of modern electronic components, layout, and EMC principles; Language skills: English, Estonian, and Russian; Accuracy, teamwork, and a proactive, solution-oriented mindset. 🔧 Key Responsibilities Design low- and/or high-power electronic circuits for converter equipment; Develop documentation for printed circuit boards (PCBs); Perform necessary technical and electrical calculations; Prepare technical specifications and requirements for circuit applications; Select and evaluate components, participate in forming component purchase requests; Provide engineering supervision during the manufacturing process; Take part in testing and commissioning of power converter systems. 🌟 We Offer A stable position in a technologically advanced company with 150+ years of history; Participation in complex R&D projects and real industrial applications; Professional growth and training opportunities; A supportive and experienced engineering team; Competitive salary and performance-related bonuses; A role where your engineering ideas become real products. 📍 Location: Tallinn, Estonia 📅 Apply by: 17 December 2025 If you're passionate about circuit design and want to contribute to the future of power electronics, we'd love to hear from you! 👉 Send your CV and cover letter (with salary expectations) via cv.ee or directly to hr@tet-estel.com 🔗 Learn more: www.tet-estel.com",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}