{
  "job": {
    "id": "1468212",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1468212",
    "title": "Reisikonsultant / Travel Consultant",
    "company": "SIA INTERLUX Travel",
    "location": "Unknown",
    "posted_date": "2025-11-28T12:02:13.972+00:00",
    "discovered_date": "2025-12-02T23:39:27.128297",
    "description": "Otsime oma meeskonda reisikonsultanti Meist: Interlux Travel on rahvusvaheline reisikorraldaja, kellel on üle 10 aasta kogemust kvaliteetsete ja nõutud reiside korraldamisel Balti riikides ja väljaspool. Meie meeskond kasvab, mistõttu otsime oma professionaalsesse kollektiivi positiivset, suhtlemisvalmis ja aktiivset reisikonsultanti. Sinult ootame: Eesti ja vene keele oskust kõnes ja kirjas Valmidust õppida ja uusi väljakutseid vastu võtta Positiivset ellusuhtumist ja head probleemilahendusoskust Enesekindlust arvutikasutamisel ning suhtlemisel e-posti ja telefoni teel Eelnev töökogemus turismi, müügi või klienditeeninduse valdkonnas tuleb kasuks B-kategooria juhiluba on eeliseks Sinu peamised tööülesanded: Suhtlemine reisihuviliste ja klientidega Suhete hoidmine reisibüroodega Reiside soovitamine, pakkumine ja broneerimine Broneerimissüsteemide kasutamine (väljaõpe meie poolt) Ole usaldusväärne reisikonsultant ja tugi klientidele ning partneritele kogu reisi vältel Pakume Sulle: Stabiilset töökohta rahvusvahelise kogemusega ettevõttes Tugevat ja reisisõbralikku meeskonda, kus reisimine on elu osa Põhipalka alates 1200 € bruto + tulemuspõhine boonus Tasustatud vaba päeva sünnipäeval Paindlikkust, arenguvõimalusi ja sõbralikku töökeskkonda Täielikku sotsiaalset garantiid ning töölepingut vastavalt Eesti seadustele Vanus ei ole takistuseks oluline on Sinu suhtumine, tahe õppida ja areneda! Kui tunned, et see töö sobiks Sulle, siis kandideeri juba täna! Võtame ühendust vaid järgmisesse vooru pääsenud kandidaatidega. We Are Looking for a Travel Consultant About Us: Interlux Travel is an international tour operator with over 10 years of experience organizing quality and in-demand trips in the Baltics and beyond. As we continue to grow, we are looking for a positive, communicative, and proactive colleague to join our professional team. What We Expect From You: Fluency in Estonian and Russian (spoken and written) Openness to new challenges and a willingness to learn A positive mindset, ability to react quickly, and problem-solving attitude Confidence using a computer and communicating via email and phone Experience in tourism, sales, or customer service is a strong advantage Category B driver's license (preferred) Your Main Responsibilities: Communicate with clients interested in traveling Maintain relationships with travel agencies Recommend, offer, and book trips while responding to client inquiries Work with reservation systems (we will train you!) Be a reliable travel advisor and support for clients and partners from start to finish What We Offer: A stable job in a company with international experience An energetic team where traveling is a way of life Salary starting from €1200 gross + performance-based bonuses Paid day off on your birthday Flexibility, opportunities for growth, and a friendly work environment Full social guarantees and a contract in accordance with Estonian law Age is not a barrier your attitude, drive, and willingness to grow are what matter most! If you feel this could be your next step apply today! We will contact selected candidates for the next stage of the hiring process.  + tulemuspõhine boonus / performance-based bonuses",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "react"
  ],
  "category": "Low Priority"
}