{
  "job": {
    "id": "1469463",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1469463",
    "title": "Mapping Team Lead",
    "company": "Starship Technologies OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-18T11:18:02.000+00:00",
    "discovered_date": "2025-12-02T22:39:53.288307",
    "description": "Starship Technologies is revolutionizing deliveries with autonomous robots. These robots are designed to deliver food, groceries, and packages across college campuses and neighborhoods in minutes. Starship has now completed millions of autonomous deliveries to date, traveled millions of miles, and is currently doing more than 140k road crossings each day. Our contribution to society includes reducing congestion, and pollution, providing zero-emissions deliveries, increasing the quality of life for residents, empowering seniors and disabled people, and enabling affordable delivery for local businesses.\nWith over 300 locations in 6 countries worldwide, we have brought a series of world firsts as we launched robotic delivery in new cities, areas, and countries. Our deliveries are profitable due to significant technology investment, and combined with substantial commercial momentum and interest, expanding to new partners and locations has become the beating heart of our growth.\nWere looking for a\nMapping Team Lead\nto join our\nAutonomous Driving team\n. Mapping Team is one of the three pillars of our ability to expand and scale with confidence they are responsible for, critically, high-precision maps that make our robots smarter, safer and faster. This is a unique opportunity to lead, shape, and drive a critical part of how we adapt robotics to fit, suit, and serve local communities in countries across the world.\nYour main responsibilities are:\nPrioritisation & Planning\nDrive excellent prioritisation, scheduling, and planning to maximise price-to-performance impact across the team.\nPlan and sequence work across map additions, geographic expansions, and safety-critical tasks.\nUse data fluently to forecast hiring needs, track performance, and guide operational decisions.\nCross-Functional Teamwork\nCollaborate closely with teams such as Commercial, Launch, Public Affairs, and Local/Remote Operations to ensure alignment, clarity, and shared outcomes.\nHigh Velocity Execution\nOperate effectively in a fast-moving environment with rapidly increasing launch velocity.\nStay calm, decisive, and outcome-focused amid ambiguity, shifting deadlines, and incomplete information.\nOperational & Tooling Improvements\nIdentify and drive improvements in tools, software, workflows, and systems to increase efficiency, safety, and long-term scalability.\nAdvocate for automation and scalable long-term solutions.\nTeam Growth & Development\nGrow, mentor, and develop a high-impact team with strong ownership, engagement, and clarity of purpose.\nLead the evolution of team responsibilities as Starship changes and as automation changes processes.\nWhat's in it for you?\nThis is a wildly unique role: an opportunity to lead a key scaling team, working to expand industry-leading self-driving delivery robot technology on a uniquely large scale, creating history.\nYou will have the opportunity to shape and build a unique system for expansion, and to grow the team around it, including working with sister engineering teams in Autonomous Driving to improve the process of expansion.\nWork with extremely passionate and motivated people across the company in operations, engineering and commercial.\nYou can immerse yourself in the world of technology and innovation.\nYou'll have endless opportunities to learn from our inspirational, talented team members across the globe.\nWhat we hope you'll bring to the table:\nExperience in data analysis (including exploratory analysis) and using data for decision-making and forecasting.\nAbility to think strategically, predict outcomes, and guide teams to adapt effectively.\nProven team leadership experience: mentoring, growing, and motivating a team to deliver impact.\nA proven ability to thrive under pressure, tight deadlines, and changing conditions.\nExceptional prioritisation skills across very different tasks and outcomes.\nExcellent communicator with strong relationship-building skills, able to align, inspire, and collaborate across teams.\nWant to learn more about our robots and our people? Get in touch and lets have a chat! Also, have a sneak peek to our blog and discover more about us!",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "team lead",
    "mentor"
  ],
  "category": "Low Priority"
}