{
  "job": {
    "id": "1470453",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1470453",
    "title": "Senior Data Engineer",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-20T06:04:23.000+00:00",
    "discovered_date": "2025-12-02T22:39:50.110195",
    "description": "What will help you to succeed in the role?:\nYou will be a good fit for the role if you have:\nDegree in (Business) Informatics, Data Engineering, Mathematics, or a comparable field\nProven experience in data integration, data modeling, and data flow design\nStrong skills in SQL and data integration tools (e.g., Azure Data Factory) or programming languages (e.g., Python)\nSolid understanding of relational databases, modern data architectures, cloud-based data analytics tools and platforms (e.g. Databricks)\nExperience working closely with business stakeholders, ideally with product owners\nAnalytical thinking, structured work approach, and high level of initiative\n\nWhat will be your challenge in this role?:\nAs a Data Engineer, you will play a key role in building the next evolution of our customer risk platform. The focus lies on integrating data from various internal systems into a centralized, real-time database, laying the foundation for consistent and reliable data processing and analysis across the organization.\nYou will join one of our platform product teams and you are expected to deal with:\nTarget System Analysis\n. Identify and document data fields, formats, and structures needed in the central target systems, etc\nInternal Source System Analysis\n. Evaluate existing internal systems, determine relevant data, coordinate data exports, etc\nDesign Data Integration Concepts.\nDevelop mapping logics,, define transformation rules, data flows and technical interfaces, document data models, etc\nTechnical Implementation\n. Build and test ETL/ELT processes, ensure data consistency, quality, and traceability, etc\nDrive and own data engineering topics\n. Standardize mechanisms for PII data handling, support operational data activities, etc in collaborative way with software engineers and other relevant stakeholders\n\nWhat do we offer: :\nInclusive and valuing culture\nAt Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks.\nHealth & Wellbeing\nYour physical and mental health is important to us. Take advantage of our various preventive care and support services.\nProfessional and Personal Development\nTake advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings\nMonetary Benefits & Discounts\nKnow that you're appreciated with plenty of employee benefits & discounts just for you.\nFlexibility\nOur diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "python",
    "azure",
    "architecture",
    "architect"
  ],
  "category": "Low Priority"
}