{
  "job": {
    "id": "1471615",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471615",
    "title": "Malware Research Engineer",
    "company": "Malwarebytes Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-21T14:51:53.000+00:00",
    "discovered_date": "2025-12-02T23:39:23.976887",
    "description": "Highly developed sense of integrity and demonstrated passion for excellence with respect to treating and caring for customers. Creative thinking and problem solving, with a positive and motivated approach. Ability to setup and conduct research/analysis in an emulated/virtual environment, such as VMWare or Hyper-V. Ability to research & classify malicious domains and IPs. Experience with and understanding of malware research tools involved in static & dynamic analysis and core aspects of a threat research & response team. Basic understanding and experience using various operating systems, incl. Windows, Linux, Mac, and Android. Ability and passion to stay up to date with the latest malware threats and collaborate with other researchers, coordinators, as well as developers. Process daily threat-feeds, related to newly created malware and write detection rules for various technologies. Investigate and resolve customer related inquiries related to protection, performance, and usability. Conduct research and threat hunting for the latest cyber-web threats affecting our customers. Provide feedback on new projects and syntaxes/tools being developed that involve your daily work and suggest ideas how to handle different threat types. Support content creation efforts incl. threat descriptions, blogs, and presentations Employee Referral Bonus Program Health benefits Wellness programs Comprehensive Time Off policy An opportunity to do something great for yourself and the world!",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}