{
  "job": {
    "id": "1471344",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471344",
    "title": "Java vanemarendaja/arhitekt",
    "company": "Fujitsu Estonia AS",
    "location": "Unknown",
    "posted_date": "2025-11-28T10:00:01.774+00:00",
    "discovered_date": "2025-12-02T22:39:40.080227",
    "description": " Sina oled oluline lüli lisandväärtuse loomisel.:\nKui soovid anda oma panuse Eesti riigi majandusse läbi suurte avalike organisatsioonide ning eraettevõtete strateegiliste töövahendite arendamise, siis tule ja liitu Fujitsu meeskonnaga.\nOma töös puutud kokku erinevate arendusinitsiatiivide elluviimisega, uute lahenduste väljatöötamisega ja põnevate projektide teostamisega - parimad praktikad kuuluvad selle kõige juurde.\n\nPakume Sulle paindlikkust ja piirideta arenguvõimalust ehk meie juures on Sul võimalik::\n- töötada rahvusvahelises ettevõttes, mis pakub stabiilsust ja kindlust - oleme Eesti IT-turul tegutsenud juba üle 30 aasta:\n- teha koostööd meeskonnas, kus kõiki\nmõtteid ja ideid saab vabalt arutada, omavaheline hea huumor ning südamlik suhtumine käib tööpäeva juurde\n;\n- arendada oma professionaalseid oskusi ja teadmisi toote ja tehnoloogia valdkonnas ning erinevates Eestis või Soomes ärisektorites. Sinu arengut toetab ka\nligipääs LinkedIn Learning keskkonda\n;\n- nautida\ntöö- ja eraelu tasakaalu\n, see tähendab, et pakume paindlikkust tööajas ja töökohas sul on\nvõimalus töötada kodus või meie Tallinna või Tartu kontoris.\n- töötada meeskonnas, kelle\njuht on hooliv, inimkeskne ja lahendustele orienteeritud\n(tuginedes Fujitsu rahulolu uuringule saame kinnitada, et meeskond hindab oma juhti kõrgelt.)\nLisaks pakume muid ettevõtte hüvesid muuhulgas näiteks\n7 kalendripäeva lisapuhkust,\ntervisekindlustust või tervise- ja spordikompensatsiooni, haiguspäevade hüvitamist\njne.\n\nKui soovid liituda meiega, siis ootame Sinult::\n- vähemalt\n5-aastast infosüsteemide arendamise kogemust JAVA programmeerimiskeelega\n;\n- varasemat töökogemust JavaScript raamistike (Angular/React/Vue vms.), PostgreSQL/Oracle tehnoloogiatega;\n- teadmisi ja praktilist kogemust konteinerite tehnoloogiatega (Kubernetes, Docker, HELM jne), et luua kaasaegseid ja skaleeritavaid lahendusi\n- analüütilist ja arhitektuurset mõtlemist, mis toetab sind uute lahenduste arendamisel;\n- teadmisi tarkvara turvalisuse nõuetest ja põhimõtetest;\n- oskust juhtida nooremarendajaid, jagada neile ülesandeid, motiveerida ja õpetada;\n- head eesti keele oskust;\nKui oled meile sooviavalduse teele saatnud, siis:\n- tutvume Sinu avaldusega;\n- positiivse otsuse korral kutsume MS Teams´i töövestlusele meie meeskonnajuhiga;\n- teises vestlusvoorus osaled tehnilisel vestlusel meie vanemarendajaga;\n- saadame tööpakkumise e-mailile.\nFujitsu Estonia väärtustab mitmekesisust ja kaasatust. Me usume, et igaühe ainulaadsus rikastab meie meeskonda. Meie juures hinnatakse igaühte ning diskrimineerimisele pole ruumi - kõik kandidaadid, olenemata nende taustast, on teretulnud.\n\nTarkvaraosakond tööandjana:\nMeid võid usaldada. Oleme maailmaturul tegutsenud juba aastast 1935 ja Eestis 1991. Ühe suurima IT-ettevõttena oleme Eestis tööandjaks ligi 400 inimesele. Pikaajaline kogemus võimaldab meil oma töötajatele pakkuda kindlustunnet ja stabiilsust. Oleme usaldusväärsed tervikuna, mis tähendab, et igale meie meeskonnaliikmele saab loota.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 10.0,
  "score_breakdown": {
    "positive_keywords": 50.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "javascript",
    "react",
    "postgresql",
    "docker",
    "kubernetes"
  ],
  "category": "Low Priority"
}