{
  "job": {
    "id": "1471521",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471521",
    "title": "Sales Manager",
    "company": "VILPE BALTICS SIA",
    "location": "Unknown",
    "posted_date": "2025-11-28T13:00:01.039+00:00",
    "discovered_date": "2025-12-02T23:33:47.807472",
    "description": "Sales Manager Estonia Location: Flexible within Estonia, preferably in the Tallinn region or nearby Reports to: Head of Baltics About VILPE VILPE Oy is the leading Finnish developer and manufacturer of innovative roofing and ventilation solutions, trusted across the Nordics, Baltics, and Europe for over 50 years. Our mission is to create healthier, smarter, and more sustainable buildings through intelligent roof and ventilation technologies. We are now expanding our operations in Estonia and looking for a Sales Manager to drive the growth of our VILPE Sense smart solution product family a cutting-edge system for real-time roof and humidity monitoring thats changing the way buildings are maintained and protected. Your Key Responsibilities Lead the sales and market development of the VILPE Sense smart solution and other VILPE products in Estonia. Build and strengthen long-term partnerships with distributors, retailers, installers, designers, and contractors. Identify and convert new B2B opportunities in the construction, roofing, and ventilation sectors. Act as a technical advisor, providing product training, demonstrations, and solution support to professional partners and end users. Promote brand awareness and represent VILPE at trade events, seminars, and key industry meetings. Prepare and execute an annual sales action plan aligned with company strategy. Manage customer and project information in the CRM system and deliver regular performance reports. Continuously develop your expertise and stay up to date with industry trends and smart building technologies. About You Degree in business with technical experience, or engineering/technical education with B2B sales background. Minimum 3 years of sales experience in the construction, roofing, or ventilation industry; an existing professional network is an advantage. Passion for technology and innovation eager to learn and explain smart building solutions in a clear and engaging way. Fluent Estonian and English; Russian language skills are an asset. Confident in using Microsoft Office and CRM systems. A self-driven, customer-focused, and target-oriented professional with a proactive and diplomatic approach. What We Offer A chance to lead the Estonian market entry for a breakthrough smart building solution. An international, innovative working environment with supportive Nordic values. Comprehensive onboarding and product training. Company car or compensation for personal car use. Modern tools and technical equipment. Competitive monthly gross salary based on candidates skills and experience starting from €2500, plus an attractive performance-based bonus system. Personal Qualities for Success You are a solution-oriented and entrepreneurial sales professional who thrives on building partnerships and delivering value. You combine technical understanding with sales drive, balancing commercial goals with the needs of distributors and end users. You remain calm and determined under pressure and see challenges as opportunities to grow. How to Apply If you are ready to drive the success of VILPE Sense and be part of an innovative company shaping the future of smart roofing and ventilation, send your CV and cover letter in English to APPLY section. Contact phone during working hours +37122305950. Competitive monthly gross salary based on candidates skills and experience starting from €2500, plus an attractive performance-based bonus system.  Company car or compensation for personal car use.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "API"
  ],
  "category": "Low Priority"
}