{
  "job": {
    "id": "1471768",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471768",
    "title": "Senior Cloud Engineer",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-24T05:21:59.000+00:00",
    "discovered_date": "2025-12-02T22:39:50.110214",
    "description": "What do you need to succeed in the role? :\nA bachelor's degree in computer science or a related field.\nHands-on experience working with infrastructure as code approach using Terraform.\nHands-on experience working with Azure cloud and Kubernetes.\nExperience one of scripting language PowerShell, bash or Python.\nExperience setting up and working with security, monitoring & alerting solutions (Azure Monitor, New Relic, Microsoft Defender for Cloud, etc.)\nFamiliarity with CI/CD approach for application and infrastructure deployment.\nFamiliarity with containerization using Docker.\nFamiliarity with Azure SQL database server and RDBMS principles.\nFluent written and spoken English language skills for effective communication and collaboration with our international team.\nAlso, nice to have:\nPrevious experience working in the banking or Fintech domain.\nA reasonable level of competence in software development, cybersecurity, application monitoring & support.\nPrevious experience working with RabbitMQ or another queue system.\nExperience with database and queue services: backup policy, monitoring, data migration.\nPrevious experience working with Kafka, PostgreSQL or MongoDB.\nPrevious experience working with IIS and Nginx web services.\n\nWhat will be your challenge? :\nDesign, develop, and test secure cloud infrastructure solutions, tailored to specific requirements and business needs.\nImplement new and extend existing solutions following the Infrastructure as Code (IaC) approach using Terraform and Packer.\nClose involvement with implementation and maintenance of such services as Kubernetes, HashiCorp Vault and Consul, and database services using Azure SQL Server, MongoDB Atlas, RabbitMQ, etc.\nCreate and maintain monitoring and alerting using Azure Monitor and New Relic.\nCreate and maintain comprehensive documentation of Infrastructure Product.\nShare and present architectural decisions to the team.\nCollaborate with other teams to improve their infrastructure implementation.\n\nWhat do we offer::\nInclusive and valuing culture\nAt Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks.\nHealth & Wellbeing\nYour physical and mental health is important to us. Take advantage of our various preventive care and support services.\nProfessional and Personal Development\nTake advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings\nMonetary Benefits & Discounts\nKnow that you're appreciated with plenty of employee benefits & discounts just for you.\nFlexibility\nOur diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 10.0,
  "score_breakdown": {
    "positive_keywords": 80.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [
    "python",
    "postgresql",
    "mongodb",
    "docker",
    "kubernetes",
    "azure",
    "ci/cd",
    "architect"
  ],
  "category": "Low Priority"
}