{
  "job": {
    "id": "1471457",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1471457",
    "title": "Senior Product Manager in Corporate Lending Products Unit",
    "company": "Luminor",
    "location": "Unknown",
    "posted_date": "2025-11-21T12:33:39.397+00:00",
    "discovered_date": "2025-12-02T22:39:51.695889",
    "description": "Join our team as a Senior Product Manager!\nYes, you can! That's our attitude towards our work, ambitions, ideas, and relationships. We at Luminor believe that anyone has the potential to achieve big things and encourage everyone to achieve them, professionally and personally.\nWhoever you are and whatever your role is, with Luminor, you will get a once-in-a-lifetime opportunity to build a local banking champion.\nSenior Product Manager is a role for Luminors success to drive product development agenda and achieve a competitive offering in the market. This role holds end to end responsibility for an assigned corporate lending process development and support.\nWhat You Will Do:\nManaging      allocated corporate lending processes across Baltic countries:\n- Deep insight in Customer and stakeholders needs\n- Market trends, benchmarking with competitors\n- Develop new and improve existing allocated processes\n- Ensure right balance between business demands, compliance requirements,      acceptable risks levels and technical capabilities\nManaging      developments of features & functionalities for allocated processes:\n- High level business requirements on expected features/functionalities\n- Close co-operation with business analysts\n- Managing development backlog prioritization\n- Managing business testing and roll-out of developed      features/functionality to relevant stakeholders (incl. trainings,      documentation)\nSupport      in ensuring high data quality of data created during lending processes\nContribution      to compliance in corporate lending products domain\n: coordination      and implementation of assigned compliance initiatives (incl. initiation of      closure of allocated audit, compliance, Oprisk gaps)\nWhat We Expect:\nExperience      in leading cross-functional teams\nKnowledge      in product development and/or product domain expertise\nStakeholder      management with strong analytical thinking and ability to make decisions      quickly\nExperience      in analyzing large data  (product statistics      and analytics; results of A/B tests)\nHigher      education in Finance, Economics, Business Administration or similar\nFluent      English and local language are required in spoken and written      communication due to working on the Pan-Baltic level\nWhat We Offer:\nFlexibility.\nFlexible      working hours, Hybrid work, and the possibility to work from anywhere in      the EU, Iceland, Switzerland, and the UK (in total 90 days per year)\nInternational      teams.\nTeams that go outside Pan-Baltic borders, where people      value challenging work together with good humor and having fun\nMore      vacation.\nAdditional weeks of vacation are available to all      employees who have been in the company for 1 year or more\nVolunteer      time off.\nWe care about giving back to society, therefore, you      will get additional days off for volunteering purposes\nPaid      leave.\nWe are proud of our employees who are participating in      military training. Therefore, Luminor offers 30 fully paid calendar days      for military training every year\nHealth      benefits.\nA competitive benefits package in addition to your      salary that includes health insurance after the first 3 months pass in all      three Baltic states, as well as Health days in case of your absence due to      sickness without a doctor's note needed\nWellbeing.\nAccess      to tools and resources that help you feel good and be productive at work      and in life\nProfessional      growth.\nInternal and external training programs, workshops,      conferences, online training, etc.\nSpecial      Offer for Luminor products & services.\nEnjoy special offers      & pricing for products and services provided by Luminor\nGross      salary.\n2980 - 4100 EUR/month, which is to be determined      depending on your level of experience and competencies\nThe application deadline is the 5th of December.\nWe are looking for a candidate primarily already located within the Baltics. Please apply with your CV in English and\nPDF format\n!",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}