{
  "job": {
    "id": "1473499",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473499",
    "title": "Employer Branding and Communications Partner",
    "company": "Playtech Estonia OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-26T09:52:18.000+00:00",
    "discovered_date": "2025-12-02T22:39:53.289300",
    "description": "Employer Branding and Communications Partner :\nAbout Playtech\nFounded in 1999, Playtech has a premium listing on the Main Market of the London Stock Exchange and is focused on regulated and regulating markets across its B2B business. By leveraging proprietary technology, Playtech delivers innovative products and services to ensure a safe, engaging, and entertaining gaming experience.\nAs the gaming industry's leading technology company, Playtech combines business intelligence-driven software, services, content, and platform technology to drive excellence and innovation across the sector. Read more about who we are and what we do here: www.playtechpeople.com and www.playtech.com.\nAt Playtech, we genuinely believe that people are our biggest asset. Diverse thoughts, experiences, and individual characteristics enrich our work environment and lead to better business decisions. Embracing differences and maintaining transparency in our processes is the core of Playtech's overall commitment to responsible business practices.\nReady to level up your career?\nAre you passionate about shaping how a leading tech company is seen by the world? Playtech Estonia is searching for an enthusiastic\nEmployer Branding and Communications Partner\nto drive our brand and communications strategy locally and support globally. If you thrive in a dynamic environment, love building relationships, and want to make a real impact, this is your chance to join a team where your ideas matter.\nYour Influential Mission: You Will...\nLocal Focus\nLead impactful communication:\nDrive external and internal communications for Playtech Estonia, ensuring our voice is clear, engaging, and aligned with our brand.\nShape our employer brand:\nDevelop and execute strategies that position Playtech as a top employer in Estonias tech industry.\nShowcase Playtech at events:\nOrganize and manage our presence at career fairs and IT conferences, creating memorable experiences for attendees.\nBe our ambassador:\nHost office visits for guests and students, sharing Playtechs culture and values.\nManage public engagement:\nRespond to external inquiries, sponsorship requests, and collaboration opportunities with professionalism and creativity.\nLead CSR initiatives:\nDrive local Corporate Social Responsibility projects and contribute to global programs that make a positive impact.\nEmpower brand ambassadors:\nCoordinate and inspire our local Brand Ambassador group to strengthen internal engagement.\nCreate engaging content:\nManage Playtech Estonias social media channels (Facebook, Instagram) with fresh, authentic content.\nGlobal Focus\nLead internal and global People and Culture communications:\nCollaborate with global teams to keep employees informed and engaged, manage the communications calendar, and ensure consistent messaging across regions.\nDevelop and deliver People & Culture communications:\nCreate and implement content, maintain templates, and coordinate timing to align global and local priorities.\nComponents for Success: You...\nAre proactive, independent, and confident in decision-making.\nBuild strong relationships across all levels and functions.\nDemonstrate fluency in Estonian (native level) and English (both written and spoken).\nBring hands-on experience in employer branding, communications, or related fields.\nHave a higher education (Bachelors or Masters) in marketing, communications, business, or a relevant area, or equivalent practical experience.\nPossess an analytical mindset, able to use data and insights to drive strategy and improvements.\nThrive in a fast-paced, ever-changing environment, creating structure and processes where needed.\nYou'll Get Extra Points For...\nExperience in digital marketing, social media management, or content creation.\nCertifications in communications, marketing, or related fields.\nPrevious achievements in employer branding or communications roles.\nExperience organizing or supporting CSR initiatives.\nKnowledge of the Estonian tech industry or labor market.\nThrive in a Culture That Values...\nIndependence and trust, no micromanagement, just empowerment.\nCollaboration with passionate, supportive colleagues.\nOpportunities for growth, development, and making a real impact.\nA diverse, inclusive, and welcoming environment.\nHow to Apply?\nIn addition to your CV, please add a brief\ncover\nletter covering your goals, your current experience in employer branding, communications, or related fields, and/or working in a corporate environment. You can write it in the comment section at the end of the application page (under \"your message to the hiring manager\").\nMeet the Team\nJoin a vibrant, collaborative team at Playtech Estonia, where your ideas and expertise will help shape our employer brand and communications strategy. Youll work alongside passionate professionals who value initiative, creativity, and partnership. Be part of a business thats making a difference, locally and globally.\nPlaytech is an equal opportunities employer. Our mission is to welcome everyone and create inclusive teams. We celebrate differences and encourage everyone to join us and be themselves at work.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}