{
  "job": {
    "id": "1473702",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473702",
    "title": "Operational Risk Officer (Data Oversight)",
    "company": "Luminor",
    "location": "Unknown",
    "posted_date": "2025-11-26T14:05:22.698+00:00",
    "discovered_date": "2025-12-02T22:39:51.696855",
    "description": "Join our team as a\nOperational Risk Officer (Data Oversight)\n!\nYes, you can! That's our attitude towards our work, ambitions, ideas, and relationships. We at Luminor believe that anyone has the potential to achieve big things and encourage everyone to achieve them, professionally and personally.\nWhoever you are and whatever your role is, with Luminor, you will get a once-in-a-lifetime opportunity to build a local banking champion.\nHow You Will Make an Impact:\nOversee and challenge the controls implemented by the first line of defense and perform routine monitoring of Data management/AI risks under the guidance of a senior team member;\nContribute to the collection and analysis of data for risk assessments and reports;\nContribute to independent assurance activities on Data management risks types;\nContribute to the development of recommendations for improving the effectiveness of risk management and control measures;\nIdentify, monitor, analyze, measure, manage, and report on Data management/AI risks under the guidance of a senior team member;\nContribute to independent risk reporting to Luminors management and regulatory authorities;\nContinuously keep updated with the regulatory environment and emerging trends to support Data/AI risk management;\nContribute to other relevant elements of Luminors operational risk management framework;\nContribute to team and company performance through effective collaboration and acting with energy, enthusiasm and commitment;\nSubstitute your team members;\nPerform other tasks relevant to the role given by direct manager and/or functional manager.\nWhat Makes You a Great Fit:\n1-3 years of experience in operational risk   management, audit or a related field;\nUnderstanding of technology, data management/AI   related risks and control measures;\nExperience with risk assurance methodology and   reporting;\nExperience with risk assessment and management tools.\nStrong analytical and problem-solving skills, with   the ability to evaluate information and make recommendations;\nAbility to effectively communicate concepts and   situations to audiences with varying levels of technical fluency;\nAbility to work independently and as part of a team;\nFluent English is required in spoken and written communication due to working on the Pan-Baltic level\nWhy You Will Love Working Here:\nFlexibility.\nFlexible working hours, Hybrid work, and the possibility to work from anywhere in the EU, Iceland, Switzerland, and the UK (in total 90 days per year)\nInternational teams.\nTeams that go outside      Pan-Baltic borders, where people value challenging work together with good      humor and having fun\nCulture.\nYoull be joining a team where things move fast, ideas flow freely, and change is part of the everyday. Its a dynamic environment that keeps you learning, growing, and never bored\nMore vacation.\nAdditional weeks of vacation are available to all employees who have been in the company for 1 year or      more\nVolunteer time off.\nWe care about giving back to      society, therefore, you will get additional days off for volunteering      purposes\nPaid leave.\nWe are proud of our employees who are participating in military training. Therefore, Luminor offers 30 fully paid calendar days for military training every year\nHealth benefits.\nA competitive benefits package in addition to your salary that includes health insurance after the first 3 months pass in all three Baltic states, as well as Health days in case of your absence due to sickness without a doctor's note needed\nWellbeing.\nAccess to tools and resources      that help you feel good and be productive at work and in life\nProfessional growth.\nInternal      and external training programs, LinkedIn learning, workshops, conferences, online training, etc\nSpecial Offer for Luminor products & services.\nEnjoy special offers & pricing for products and services provided by Luminor\n...",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}