{
  "job": {
    "id": "1473485",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473485",
    "title": "Assembly Operator",
    "company": "Starship Technologies OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-26T09:34:07.251+00:00",
    "discovered_date": "2025-12-02T23:33:57.472917",
    "description": "As an Assembly Operator, you will join our Manufacturing team and play an essential part in our mission to provide the world with affordable and environment-friendly deliveries. Every day, our robots are completing thousands of autonomous deliveries in the US, UK and Europe, and were hitting records on an almost weekly basis. NB! Please note that this role will be hired through staffing platform GoWorkaBit (no employment contract) but you will be integrated into our company culture and will work closely with our team members. You will be one of us! The salary for this position is 8.50€/hour and it is a full time role with work from Monday to Friday. Building subassemblies. Testing subassemblies. Servicing and refurbing subassemblies. Collaborating with engineers and team members to assure smooth operations on manufacturing site. Opportunity to work on industry-leading self-driving delivery robot technology on a uniquely large scale, creating history and making things happen. You can immerse yourself in the world of technology and innovation. You will have a chance to work with people with a strong inner burning and motivation. We are self-aware and seek feedback and improvement. We dont want to wait until we are told what needs to be done but take it as a matter of pride to figure out solutions for topics in various teams and areas. Youll have endless opportunities to learn from our inspirational, talented team members across the globe. Previous experience with various hand tools (manual or electrical screwdrivers etc.). Strong work ethic and ability to work at a fast pace. Knowledge of safety regulations and procedures. Good spoken and written communication in English.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}