{
  "job": {
    "id": "1473963",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473963",
    "title": "Baltikumi haldusjuht",
    "company": "Evidensia Loomakliinikud OÜ",
    "location": "Unknown",
    "posted_date": "2025-11-27T06:29:47.000+00:00",
    "discovered_date": "2025-12-02T22:39:43.202421",
    "description": "Ametikoha täitmiseks vajalikud oskused ja isikuomadused::\nTöökogemus ja haridus:\n•\tProjektijuhtimise kogemus\n•\tTööalast tegevust toetav kõrgharidus\n•\tMuudatuste juhtimise kogemus\n•\tHaldusjuhtimise kogemus\n•\tTehniliste ülesannete lahendamise ja juhtimise kogemus\nOskused ja isikuomadused:\n•\tSuhete loomise ja hoidmise oskus\n•\tHea analüüsivõime ja oskus kogemusest õppida\n•\tLahendustele orienteeritus, positiivsus ja võime töötada tõhusalt ka pingelistes olukordades\n•\tOskus keskenduda olulisele ja prioriteete seada\n•\tTäpsus dokumentatsiooni koostamisel, haldamisel ja kooskõlastamisel\n•\tTehnilised teadmised ja majanduslikult mõtlemise oskus\n•\tRiiklike regulatsioonide tundmine, mis on seotud kinnisvara haldamise ja hooldamisega\n•\tHead teadmised uutest tehnoloogiatest ja lahendustest\n•\tB-kategooria juhiload\n\nAmetikoha peamised tööülesanded:\nHaldusjuhi eesmärk on tagada etevõtte igapäevaste tegevuste sujuv ja tõhus toimimine, korraldades haldus- ja tugiteenuste protsesse.\nHaldusjuht hoiab ja toetab toimivat töökeskkonda ning tagab grupi nõuete ja standardite järgimise. Koordineerib ehituslike- ja tehniliste seadmete ja protsesside toimimist koostöös erinevate osapooltega.\nAdministreerib, koostab, arhiveerib ja vajadusel kooskõlastab grupipoolset ja kohalikku dokumendihaldust.\nTehnilised ülesanded:\n•\tIT-süsteemide arenduse koordineerimine ja haldamine koostöös grupi IT koostööpartneritega\n•\tKoostöö kasutatavate tarkvarade ja kõnekeskuse arendajatega\n•\tKoostöö IT-partneritega, et tagada vajalikud töövahendid ja nende toimimine\n•\tSeadmete ja töövahendite hangete, hoolduse, remondi ja korrashoiu koordineerimine ja dokumentatsiooni koostamine\n•\tTööks vajalike tehnosüsteemide (elekter, küte, internet, vesi, ventilastioon, küte, AC, lift) vahendite hoolduse ja dokumentatsiooni koordineerimine\n•\tRuumide ja sisseseade remondi- ja arendustööde koordineerimine loomakliinikutes\n•\tProjektides osalemine ja vajadusel juhtimine koostöös juhtkonna, grupi ja loomakliinikute juhtidega\nDokumendihaldusega seotud ülesanded:\n•\tGrupi standardite ja nõuete rakendamine kohalikul tasandil\n•\tDokumendihaldus ja administratiivne tugi ärivaldkondadele\n•\tPõhivarade nimekirja haldamine koostöös raamatupidajate ja loomakliinikute juhtidega\n•\tLisanduvate loomakliinikute dokumentatsiooni kontroll ning grupi nõuetega vastavusse viimine, sh integreerimine grupi süsteemidega ja tehniliste auditite läbiviimine\n•\tAndmebaaside haldamise koordineerimine (nt Kotkas, Monday)\n•\tJätkusuutlikuse valdkonna haldamine\n•\tStandardite, kiirgustegevuslubade ja isikudosimeetriaga seotud nõuete täitmise tagamine\n•\tPACS, Osirix integreerimine Evidensia loomakliinikutes koostöös IT-osakonnaga\n\nMeiega::\nTöötad tipptasemel ja pidevalt areneva tehnoloogiaga ettevõttes\nOled väärtuslik tiimiliige kirglikke professionaalide toetavas tiimis ning valdkonna tippspetsialistide võrgustikus\nSaad läbida mitmeid koolitusi ja kasutada erinevaid arenguvõimalusi\nOn Sul põnev ja mitmekesine töö ning head töötingimused, sealhulgas võimalus kasutada ametiautot\nSaad osaleda põnevatel ühisüritustel\nToetad enda vaimset ja füüsilist tervist",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}