{
  "job": {
    "id": "1473954",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473954",
    "title": "Senior Software Engineer (Client)",
    "company": "Riverty ",
    "location": "Unknown",
    "posted_date": "2025-11-27T05:23:41.000+00:00",
    "discovered_date": "2025-12-02T22:39:50.109459",
    "description": "What will help you to succeed in the role:  :\nTo thrive in this role and make a meaningful impact, we believe the following qualities and experiences will serve you well:\nYoure a seasoned software engineer with a strong command of C# and .NET, and a track record of delivering production-grade systems.\nYouve built and supported cloud-native applications and understand the challenges of distributed systems.\nYou think in systems and design with focus on scalability, resilience, and long-term maintainability.\nYoure proactive in shaping technical direction and enjoy contributing to architectural decisions.\nYou care deeply about craftsmanship and continuously seek opportunities to improve your skills and share knowledge with others.\nYou thrive in collaborative environments, value diverse perspectives, and communicate clearly in English across disciplines.\nYoure comfortable taking ownershipfrom ideation to deploymentand balancing technical excellence with business impact.\nFamiliarity with FinTech or banking systems is a plus.\n\nWhat will be your challenge: :\nYou will join one of our product teams and daily you will:\nDesign, develop, test, and ship robust, maintainable, and readable software, applications, APIs, and other workflows\nInitiate, participate in, and communicate technical architecture designs\nAttend regular scrum ceremonies as a member of an agile cross-functional team\nAnalyze, discuss, and implement business requirements while maintaining good documentation of the systems and components you create\nBring in industry standards and best practices to continually improve our codebase and architecture\nMake a positive impact on our engineering culture by adopting, implementing, and providing feedback on best standards and practices\n\nWhat do we offer: :\nInclusive and valuing culture\nAt Riverty, you can be who you are. We strive to create an inclusive environment and an appreciative culture, enhanced by our employee networks.\nHealth & Wellbeing\nYour physical and mental health is important to us. Take advantage of our various preventive care and support services.\nProfessional and Personal Development\nTake advantage of our numerous training and development opportunities. Benefit, for example, from training courses offered by Bertelsmann University, language courses or leadership trainings\nMonetary Benefits & Discounts\nKnow that you're appreciated with plenty of employee benefits & discounts just for you.\nFlexibility\nOur diverse working models empower you to customize your work to perfectly align with your preferences. Benefit from mobile office, flexible working hours and part-time models.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 40.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "architecture",
    "architect",
    "agile",
    "scrum"
  ],
  "category": "Low Priority"
}