{
  "job": {
    "id": "1473673",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1473673",
    "title": "Senior Operational Risk Officer (External Theft & Fraud)",
    "company": "Luminor",
    "location": "Unknown",
    "posted_date": "2025-11-26T13:27:59.845+00:00",
    "discovered_date": "2025-12-02T22:39:51.695931",
    "description": "Senior Operational Risk Officer (External Theft & Fraud)\n!\nYes, you can! That's our attitude towards our work, ambitions, ideas, and relationships. We at Luminor believe that anyone has the potential to achieve big things and encourage everyone to achieve them, professionally and personally.\nWhoever you are and whatever your role is, with Luminor, you will get a once-in-a-lifetime opportunity to build a local banking champion.\nAs a\nSenior Operational Risk Officer (External Theft & Fraud)\n,your mission is to  bring expertise, curiosity, and independent challenge to one of the most dynamic risk areas in banking. Youll help shape how we protect our customers and our business from external fraud, strengthening resilience across the Baltics and keeping Luminor a step ahead of emerging threats.\nHow You Will Make an Impact:\nShape and maintain the Group-wide External Theft & Fraud risk management framework, including its vision, roadmap, and supporting methodologies\nIdentify improvement opportunities in fraud strategy, risk assessment, controls, analytics, and reporting to strengthen operational resilience\nEstablish principles for fraud-related processes and ensure alignment with regulatory requirements, internal policies, and industry good practices\nProvide independent second-line oversight by assessing and challenging the effectiveness of first line controls through RCSAs and dedicated reviews\nDefine second-line requirements for fraud-related analysis, investigation, and reporting procedures, and regularly evaluate their effectiveness\nSupport complex fraud investigations and contribute to high-quality periodic reporting to management, stakeholders, and regulatory authorities\nDrive organization-wide awareness of fraud laws, regulations, internal requirements, and emerging external trends\nSupport the annual External Fraud Risk Assessment and contribute to broader risk management activities across the Group\nRepresent Luminor in engagements with regulators and industry associations related to external fraud topics\nWhat Makes You a Great Fit:\nStrong expertise in financial-sector Fraud Risk Management, including frameworks, controls, investigation practices, and regulatory expectations\nSolid understanding of fraud-related legislation and supervisory requirements across the Baltics\nExcellent analytical and decision-making skills, including the ability to form sound judgments under time pressure\nStrong communication and stakeholder management skills, with the ability to present complex topics clearly and concisely\nExperience working cross-functionally and cross-border, ideally in a pan-Baltic or multinational environment\nHigher education in Law, Finance, Economics, Mathematics, or a related field\nCertifications relevant to fraud risk, investigations, operational risk, or financial crime would be an advantage.\nFluent English is required in spoken and written communication due to working on the Pan-Baltic level\nWhy You Will Love Working Here:\nFlexibility.\nFlexible working hours, Hybrid work, and the possibility to work from anywhere in the EU, Iceland, Switzerland, and the UK (in total 90 days per year)\nInternational teams.\nTeams that go outside Pan-Baltic borders, where people value challenging work together with good humor and having fun\nCulture.\nYoull be joining a team where things move fast, ideas flow freely, and change is part of the everyday. Its a dynamic environment that keeps you learning, growing, and never bored\nMore vacation.\nAdditional weeks of vacation are available to all employees who have been in the company for 1 year or more\nVolunteer time off.\nWe care about giving back to society, therefore, you will get additional days off for volunteering purposes\nPaid leave.\nWe are proud of our employees who are participating in military training. Therefore, Luminor offers 30 fully paid calendar days for military training every year\nHealth benefits.\nA competitive benefits package in addition to your salary that includes health insurance after the first 3 months pass in all three Baltic states, as well as Health days in case of your absence due to sickness without a doctor's note needed\nWellbeing.\nAccess to tools and resources that help you feel good and be productive at work and in life\nProfessional...",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "aws"
  ],
  "category": "Low Priority"
}