{
  "job": {
    "id": "1474682",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474682",
    "title": "French & Spanish Teacher (Full-time)",
    "company": "International School of Estonia",
    "location": "Unknown",
    "posted_date": "2025-11-28T07:49:33.806+00:00",
    "discovered_date": "2025-12-02T23:33:57.472570",
    "description": "The International School of Estonia (ISE) invites applications for the position of Full-Time French & Spanish Teacher, starting August 2026. ISE is a private, co-educational, not-for-profit institution located in Tallinn, Estonia. It is the only fully accredited international school in the country, authorised to deliver the full International Baccalaureate (IB) Continuum (PYP, MYP, and DP), and accredited by both the New England Association of Schools and Colleges (NEASC) and the Council of International Schools (CIS). Essential Qualifications: University degree in Education or relevant field. Certified qualification as a French & Spanish teacher (candidates currently completing certification will also be considered). Ability to provide a recent clear police record / criminal background check Desirable Qualifications and Professional Attributes: Training and/or experience in the IB PYP, MYP, DP. Demonstrated commitment to high standards of teaching and learning. Capacity to inspire, motivate, and support students in achieving their potential. Professionalism, flexibility, and a collaborative approach to working within an international school environment. Conditions of Appointment: ISE offers a competitive salary and, for overseas candidates, an additional benefits package that includes: accommodation allowance, relocation & support, comprehensive international medical insurance. Application Procedure: Applications should include: A letter of interest and introduction Curriculum Vitae Contact details of two professional referees Completed applications should be submitted electronically to vacancies@ise.edu.ee no later than January 31, 2026. Please note: The school reserves the right to appoint a suitable candidate prior to the closing date. Only candidates shortlisted for an interview will be contacted. Further information about ISE can be found at https://ise.edu.ee",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -40.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}