{
  "job": {
    "id": "1474475",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474475",
    "title": "Kinnisvarahalduse projektijuht",
    "company": "Psience OÜ klient",
    "location": "Unknown",
    "posted_date": "2025-11-27T16:11:16.741+00:00",
    "discovered_date": "2025-12-02T22:39:43.202352",
    "description": "Sinult ootame:\nTehnilist või majandusalast kõrg- või rakenduskõrgharidust\nVähemalt 3-aastast kogemust kinnisvarahalduse, ehituse või üüripindade majandamise valdkonnas\nVäga head organiseerimisvõimet ja süsteemsust\nKliendikesksust, tehnilist taiplikkust ja lahendustele orienteeritust\nÄrilist mõtlemist, sh finantskirjaoskus ja lepingute lugemise oskus\nEesti ja inglise keele oskust kõnes ja kirjas\nIT- ja haldustarkvarade tundmist\nIseseisva töötamise võimet.\n\nSinu töölaud:\nKliendisuhtluse ja üürisuhete korraldamine (sh üürimaksete jälgimine, üürnike poolt soovitud ehitustööde korraldamine, jooksvate probleemide lahendamine)\nHoonete ja tehnosüsteemide haldus (sh regulaarsed hooldus- ja remonditööd, hoonete turva- ja tuleohutuse nõuete jälgimine jms)\nUute objektide valmimisega seotud tegevused korteriühistu loomisel ning hooldus- ja halduspartneritega koostöö käivitamisel\nÜüripindadega seotud finantsjuhtimine\nLepingute ja tarnijate ning dokumentatsiooni ja raportite haldus\nValminud ehitiste garantiiperioodi kohustuste täitmine, sh esitatud pretensioonide haldamine, garantiitööde organiseerimine ning garantiitööde kulude planeerimine ja kontroll.\n\nSulle pakume:\nPõnevat tööd valdkonna juhtivas, uuenduslikus ja jätkusuutlikus ettevõttes\nVõimalust osaleda linnaruumis oluliste hoonete halduse ja järelteeninduse protsessis\nKaasaaegseid töötingimusi ja kvaliteetseid töövahendeid\nToetavat ja professionaalset meeskonda\nKorralikku motivatsioonipaketti ja mitmekesiseid lisahüvesid, sh soodustused kinnisvara soetamisel\nKoolitus- ja arenguvõimalusi\nArendavaid meeskonnasündmusi.",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}