{
  "job": {
    "id": "1474126",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474126",
    "title": "Client Relationship Manager",
    "company": "Wallester AS",
    "location": "Unknown",
    "posted_date": "2025-11-27T09:17:14.000+00:00",
    "discovered_date": "2025-12-02T22:39:53.288902",
    "description": "Requirements :\nBS degree in business administration or related field\nSuccessful previous experience in client account or relationship management\nHigh emotional intelligence\nIndependent thinking and self-starting\nVery good communication skills\nAbility to communicate at all company levels (from technical personnel to management)\nFormal presentation and negotiation skills\nGreat organizational skills\nStrong decision-making skills\nFluency in English, knowledge of other languages is a plus\nSuperior analytical skills\n\nResponsibilities:\nAs a CRM Manager at Wallester, you will be responsible for managing and developing a portfolio of B2B clients using our Wallester Business platform. Your primary mission will be to build long-term, trust-based relationships, support clients in scaling their transaction volumes, and ensure the seamless delivery of our services.\nYou will proactively monitor account performance, guide clients in their decision-making processes, and act as a strategic partner in identifying new opportunities for growth. The role also involves managing contract negotiations, resolving complex client issues, and serving as the main point of contact for all account-related matters.\nKey responsibilities include:\nDevelopment of the client Wallester Business portfolio\nBuild trusted relationships with clients\nGuiding clients in their decision-making process\nConfigure business cases and confirm integration flow\nCollect and prepare KYC/AML documents for Compliance review\nNegotiate contracts and close agreements\nEnsure the timely and successful delivery of our solutions according to client needs\nServe as the lead point of contact for all client account management matters\nPrepare weekly/monthly/quarterly reports for internal stakeholders\nReach out to existing clients daily, for retention and potential upsell purposes\nProactively expand business with existing clients and/or identify areas of improvement\nAssist with challenging client requests or issue delegations/escalations as needed\nCollaborate with internal departments to facilitate client needs fulfilment\nOperate independently on a day-to-day basis\n\nWhat we offer:\nCompetitive salary\nCareer opportunities\nMedical Insurance upon the completion of probational period\nSupportive and caring Leadership\nA modern office in the center of Tallinn\nA chance to work as part of a highly motivated and talented team\nReferral program\nStebby\nTeam building and Company Event\nFree parking",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "negative_keywords": -20.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [],
  "category": "Low Priority"
}