{
  "job": {
    "id": "1474550",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1474550",
    "title": "Noorem tarkvaraarendaja",
    "company": "Töötukassa vahendatud pakkumised",
    "location": "Unknown",
    "posted_date": "2025-11-28T03:03:06.000+00:00",
    "discovered_date": "2025-12-02T22:39:38.365061",
    "description": "Lisakirjeldus:\nTarkvaraarendaja\n\nTööandja nimi:\nDigitalspace OÜ\n\nTööülesanded:\nToote või projekti kavandamine, rakenduse projekteerimine, kavandamine ja väljatöötamine, süsteemide integreerimine, testimine, lahenduse kasutuselevõtt ja dokumenteerimine.\nJS, PHP, MySQL\n\nHaridustase:\npõhiharidus\n\nNõutud keeleoskus:\nEN, kõne: B2, kiri: B2, kohustuslik\n\nMuud nõuded:\nArusaamine andmebaaside funktsioonidest ja päringutest, oskus töötada ja leida lahendusi nii iseseisvalt kui meeskonnas, suhtlemisoskus nii kõnes kui ka kirjas.\n\nOmalt poolt pakume:\nMotiveerivat ning kogemustest tulenevat töötasu, millega kaasneb põnev väljakutse töötades multidimensionaalsete andmemahtude ja kujundustega, kus sul on võimalus luua uudseid lahendusi.\nMeie projektid on ambitsioonikad, isegi suurima kogemuste pagasiga arendajad saavad võimaluse täiendada ja laiendada oma oskusi ja teadmisi arenduses.\nUsume meeskonnatöösse ning panustame iga meeskonnaliikme arengusse ja koolitusse. Koolitus ja silmaringi laiendamine on tähtsaks osaks meie igapäevatöös.\nMeie töökeskkond on rahvusvaheline, mõnusalt sotsiaalne ning laid-back, töögraafikud on mõistlikkuse piires paindlikud, kodutöö võimalusega. Meie töövahendid on kaasaegsed ja kiired, kus sinu mugavus on esmatähtis.\nOleme sulle kõikjal toeks, olgu see siis uute trendide või töövahendite leidmine, ärianalüütika või tehniline tugi\n\nKandideerimise info:\nKui sa oled arendamisest niisama palju huvitatud kui meie ja sul on pealehakkamist pakkumaks kasutajakeskseid uudseid lahendusi, siis saada meile oma CV.\nTähtaeg: 2025-12-10\nTöösuhte kestus: tähtajatu\n\nVajalikud dokumendid:\nCV",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "mysql"
  ],
  "category": "Low Priority"
}