{
  "job": {
    "id": "1475112",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1475112",
    "title": "Administrative Assistant / Administratiivosakonna assistent",
    "company": "Jaapani  Suursaatkond",
    "location": "Unknown",
    "posted_date": "2025-11-28T14:54:11.000+00:00",
    "discovered_date": "2025-12-02T23:39:27.128353",
    "description": "The Embassy of Japan in Estonia seeks a full-time staff for the position of Administrative Assistant including the secretary works. 1. Estimated Starting Date: March-April 2026 2. Duties for this position include: Assisting with accounting operation. Coordinating with vendors, which may involve negotiation. Assisting with reception operations. Managing schedule. Supervising other local staff and providing guidance as needed. Assisting diplomats with their daily life in Estonia. Collecting information, conducting research, translating and preparing documents in English. Please note: The specific duties outlined above may be subject to adjustment or evolution after the successful candidate joins us, based on their qualifications and the evolving needs of the mission. 3. Working hours: Monday to Friday, 9:00 am 5:00 pm with a possibility of overtime work. 1 hour of lunch time is included. 4. Additional information: A competitive salary will be offered, commensurate with the successful candidate's experience and qualifications. Employees are entitled to annual leave, sick leave, and public holidays (in addition to Estonian public holidays, some Japanese holidays are also observed). The specific terms and conditions of remuneration and benefits will be discussed during the interview. 5. Requirements: Estonian citizenship or Residence permit for employment in Estonia. Good mental and physical health. Fluency in Estonian and English. *While not strictly mandatory, candidates with Japanese language proficiency (JLPT N2 level or higher) will be given strong preference. Proficiency in computer skills, including Microsoft Word and Excel, etc. A university degree. Excellent administrative, planning and organizational skills. Excellent research and analytical skills. 6. Application Deadline: By January 23, 2026 Please note: Following document screening, interviews and practical tests (e.g., telephone handling) will be conducted. 7. How to Apply: Interested applicants are requested to submit their CV and a cover letter, both in English to the Embassy via email (saiyou@ti.mofa.go.jp). Please ensure your CV includes the following essential details: your full name, date of birth, nationality, address, comprehensive contact details (including mobile phone number and email address), educational background, and work experience. Please be assured that all personal information provided will be treated with confidentiality and will only be used internally by the Embassy for the purpose of this recruitment process. It will not be disclosed to any third parties. Following an initial document screening, only shortlisted candidates will be contacted for an interview. Embassy of Japan in Estonia Harju 6, 15069 Tallinn E-mail: saiyou@ti.mofa.go.jp Jaapani Suursaatkond Eestis otsib täistööajaga töötajat saatkonna administratiivosakonna assistendi kohale. 1. Töö eeldatav algusaeg: märts-aprill 2026 2. Tööülesannete hulka kuulub: abistamine raamatupidamistoimingutes; suhtlemine erinevate teenusepakkujatega ja vajadusel läbirääkimine; abistamine vastuvõttude korraldamisel; ajakavade haldamine; kohalike töötajate juhendamine ja vajadusel nõu andmine; diplomaatide abistamine nende igapäevaelus Eestis; informatsiooni kogumine, uurimistööd, tõlkimine ja dokumentide ettevalmistamine inglise keeles. Pange tähele: eespool kirjeldatud konkreetsed ülesanded võivad pärast eduka kandidaadi tööleasumist muutuda või täieneda sõltuvalt kandidaadi kvalifikatsioonist ja diplomaatilise esinduse muutuvatest vajadustest. 3. Tööaeg: esmaspäevast reedeni kl. 9.00-17.00, valmisolekuga teha ületunde. 1-tunnine lõunapaus kuulub tööaja hulka. 4. Lisainformatisoon: Pakutakse konkurentsivõimelist palka, mis vastab eduka kandidaadi kogemustele ja kvalifikatsioonile. Töötajale võimaldatakse iga-aastast puhkust, haiguspuhkust ja puhkepäevi riigipühadel (Eesti riigipühadele lisanduvad ka mõned Jaapani pühad). Töötasu ja hüvitiste täpsemaid tingimusi arutatakse intervjuu käigus. 5. Nõuded kandideerimiseks: Eesti kodakondsus või elamisluba töötamiseks; hea füüsiline ja vaimne tervis; väga hea eesti ja inglise keele oskus. Jaapani keele oskus on soovitatav. Kuigi jaapani keele oskuks ei ole rangelt kohustuslik, eelistatakse kandidaate, kes valdavad jaapani keelt (JLPT N2 tase või kõrgem). arvutikasutamise oskus (Microsoft Word, Microsoft Excel jm); kõrgharidus; suurepärased haldus-, planeerimis- ja organiseerimisoskused; suurepärased uurimis- ja analüüsioskused. 6. Kandideerimise tähtaeg : 23. jaanuar 2026 Pärast dokumentidega tutvumist kutsutakse väljavalitud kandidaadid intervjuule ja palutakse täita mõned praktilised ülesanded. 7. Kuidas kandideerida Huvilistel palume saata nii oma CV kui ka kaaskiri ingliskeelsena saatkonnale e-posti teel (saiyou@ti.mofa.go.jp). CV peab sisaldama järgimisi olulisi andmeid: täisnimi, sünniaeg, aadress, kontaktinfo (mobiiltelefoni number ja e-posti aadress), kodakondsus, hariduslik taust ja töökogemused. Kinnitame, et kõiki esitatud isikuandmeid käsitletakse konfidentsiaalselt ja kasutatakse ainult asutusesiseselt käesoleva värbamisprotsessi eesmärgil. Neid ei avaldata kolmandatele osapooltele. Ühendust võetakse ainult esmase valiku läbinud kandidaatidega, et kutsuda nad tööintervjuule. Jaapani Suursaatkond Harju 6, 15069 Tallinn Email: saiyou@ti.mofa.go.jp",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "negative_keywords": -40.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "java"
  ],
  "category": "Low Priority"
}