{
  "job": {
    "id": "1476586",
    "source": "cvee",
    "url": "https://cv.ee/et/vacancy/1476586",
    "title": "Tehniline ekspert",
    "company": "RVM Systems OÜ",
    "location": "Unknown",
    "posted_date": "2025-12-02T14:02:00.233+00:00",
    "discovered_date": "2025-12-02T22:39:43.201623",
    "description": "Töö iseloom:\nOtsime tehnilist eksperti meie rahvusvahelise toe tiimi.\nTiim tegeleb igapäevaselt tarkvara ja mehaanika probleemide lahendamisega, mis tulevad sisse kõikidest RVM Systems riikidest.\nSulle sobib töö meie tiimis, kui sulle meeldib vaheldusrikas töö ehk oled valmis iga päev uusi probleeme lahendama. Sind iseloomustab uudishimulikkus ja sul on piisavalt kannatlikkust, et keerulisemate küsimuste puhul lahenduseni jõuda. Sa tunned end mugavalt inglise keeles suheldes, nii kõnes kui kirjas, sest suhtlemist teiste riikide spetsialistidega on palju.\n\nTööülesannete kirjeldus::\nsõsar- ning partnerettevõtete töötajatele tehnilise toe ja konsultatsiooni pakkumine keerulisemate probleemide lahendamisel (nii tark- kui riistvaralised probleemid)\nuutele turgudele laienemisel piirkonnajuhtidele tehnilise sisendi andmine\ntehnilise seadistuse kaardistamine ja teostamine (API liidestus, võrguühendused, seadmete sobiv seadistus jms)\nesinenud probleemide logimine, dokumenteerimine ning arendustegevuseks sisendi andmine\nkolleegide ning koostööpartnerite tehniline koolitamine\nvajadusel lähetustel käimine\n\nOotused kandidaadile::\nIT alane haridus või vastav töökogemus\nkesktasemel Linux teadmised (CLI, võrgud, tõrkeotsing)\nbaastasemel teadmised arvutivõrkudest\nheal tasemel eesti- ja inglise keel nii kõnes kui kirjas\ntugev probleemilahendamise, tõrkeotsingu ning keskendumise võime (sh logifailide lugemine ning seadistuste muutmine konfiguratsioonifailides)\nvarasem kogemus relatsiooniliste andmebaasidega - PostgreSQL (navigeerumine, käsureal muudatuste tegemine)\n\nKasuks tuleb::\nvarasem kogemus\nbash scriptide\nkoostamisel\nAPI lahenduste kasutamise ning seadistamise kogemus\n\nEttevõte pakub::\nsuurepärast kogemus rahvusvahelises, oma ala juhtivas Skandinaavia ringmajanduse ettevõttes\npidevaid arenemisvõimalusi\nspordikompensatsiooni, ühtehoidvat tiimi ja tiimiüritusi\nmugavat kontorit ja häid töötingimusi\nkodukontori võimalust",
    "contact_name": null,
    "contact_email": null,
    "contact_phone": null,
    "status": "new",
    "notes": ""
  },
  "score": 0.0,
  "score_breakdown": {
    "positive_keywords": 10.0,
    "required_missing": -50.0,
    "recency_fresh": 10.0
  },
  "matched_keywords": [
    "postgresql"
  ],
  "category": "Low Priority"
}